{"title":"Fracchia contro Dracula 1985 DVDRip XviD","uid":6640737,"size":737705984,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:01b2f6dd65f90ea7ed101f2e103df57e657e6d8f&amp;dn=Fracchia+contro+Dracula+1985+DVDRip+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1314736018,"description":"Fracchia contro Dracula\n\nPaese: Italia\nAnno: 1985\nDurata: 88 min\nGenere: Commedia\nRegia: Neri Parenti\nSoggetto: Neri Parenti, Franco Marotta, Laura Toscano e Paolo Villaggio\nSceneggiatura: Neri Parenti, Franco Marotta, Laura Toscano e Paolo Villaggio\nProduttore: Bruno Altissimi, Claudio Saraceni\nFotografia: Luciano Tovoli\nMontaggio: Sergio Montanari\nMusiche: Bruno Zambrini\n\nInterpreti e personaggi\n\nPaolo Villaggio: Giandomenico Fracchia\nEdmund Purdom: Conte Dracula\nGigi Reder: Ragioniere Filini\nAnia Pieroni: Contessina Oniria\nGiuseppe Cederna: Boris\nIsabella Ferrari: Luna\nRomano Puppo: Frankenstein\nFilippo Degara: Maggiordomo di Dracula\nSusanna MartinkovÃƒÂ¡: Catarina\nFederica Brion: Stefania\nPaul Muller: Datore di lavoro di Fracchia\nLars Bloch: il medico\nPlinio Fernando: un invitato alla cerimonia\n\nTrama\n\nIl geometra Giandomenico Fracchia (interpretato da Paolo Villaggio), ora divenuto agente immobiliare, rischia d'essere licenziato dall'agenzia in cui lavora se entro tre giorni non troverÃƒÂ  un acquirente, poichÃƒÂ© negl'ultimi tempi, per la sua dabbenaggine, non riesce a condurre in porto un affare. Allora, per restare a lavorare nell'azienda, cerca di rifilare a un cliente quasi cieco, il ragionier Arturo Filini, interpretato dal magistrale attore Gigi Reder, il castello del conte Vlad in Transilvania.\n\nIl castello e pero abitato dal conte Vlad - cioe Dracula (Edmund Purdom), il principe dei vampiri e dell'oscuritÃƒÂ  - insieme alla sorella, la contessina Oniria (Ania Pieroni), fidanzata del mostro Frankenstein (Romano Puppo). I due vampiri passano le loro giornate dormendo nelle rispettive bare e di notte, terrorizzano e azzannano la gente nei dintorni, &quot;svegliati&quot; dal suono inquietante e implacabile dell'organo del proprio maggiordomo cieco (Filippo Degara).\n\nFracchia e il suo cliente Filini vivranno ore terrificanti e avventurose, con l'avvocato Frankenstein che aspetta di sposare la fidanzata Oniria (che pero decide di sposare il ragioniere Fracchia, di cui a suo dire s'e innamorata) e con Dracula che attenta continuamente, ma invano, alla vita dello stesso ragioniere. Intanto nel castello sopraggiunge una certa Luna (Isabella Ferrari), sorella di Kaspar Jabonsk, un ammazzavampiri ucciso da Oniria, credendo che il colpevole sia in realtÃƒÂ  Dracula, che la fa mettere in gattabuia. Lei vuole liberare il paese che si trova sotto il castello, dalla minaccia vampiresca.\n\nFracchia e Filini liberano Luna e tentano di fuggire, ma vengono ripescati dal bramoso conte, la cui sorella Oniria e intenzionata a sposare il primo dei tre (l'agente immobiliare che vorrebbe vendere a Filini il castello). Una volta persa la sfida contro Filini e Giandomenico Fracchia, Dracula e costretto ad acconsentire all'&quot;amore&quot; di Oniria per il ragioniere, ma alla festa di matrimonio, Luna esce dalla torta delle nozze e intimorisce i non-morti (i vampiri invitati piÃƒÂ¹ alcuni zombie alla festa) con fulmini e saette con l'apparecchio ammazza vampiri di suo fratello.\nLuna, Fracchia e Filini fuggono, intanto Frankenstein (chiamato Frankie da Oniria) prende sulle spalle la contessa vampira e si riappacifica con lei nella stalla. Intanto Dracula perseguita ancora una volta il povero ragionier Fracchia, che per caso gl'infila la punta di frassino (che i vampiri non sopportano) del proprio ombrello nel cuore, e il vampiro muore.\n\nPoco dopo Giandomenico si risveglia nella sala d'un cinema insieme alla sua fidanzata Stefania, scoprendo ch'e stato tutto un sogno (o quasi...). Un uomo somigliante al conte (che, a sua insaputa, e proprio Dracula) gli dÃƒÂ  sorridente l'ombrello di frassino. Dopo, nella scena finale, quando i due se ne vanno, Dracula sorride beffardamente alla telecamera guardando lo spettatore scoprendo i canini da vampiro, mentre lo schermo si tinge di rosso sangue, per rimandare al suo gusto di nutrirsi del fluido vitale degli umani. Il motivo di questo finale e dovuto al fatto che una delle tante leggende che coinvolgono i vampiri e quella che attribuisce loro la capacitÃƒÂ  di entrare nei sogni dei comuni mortali, quindi si sospetta che Dracula sia entrato nel sogno di uno spettatore al cinema seduto di fronte a lui.\n\nVideo: Xvid 592x320 25.00fps\nBit rate: 1 026 Kbps\nAspect ratio: 1.850\nAudio: MPEG Audio Layer 3 44100Hz stereo\nBit rate: 89.2 Kbps\nLanguage: Italian\nSubtitles: None\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0128221/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0128221/&lt;/a&gt;","torrent":{"xt":"urn:btih:01b2f6dd65f90ea7ed101f2e103df57e657e6d8f","amp;dn":"Fracchia+contro+Dracula+1985+DVDRip+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01b2f6dd65f90ea7ed101f2e103df57e657e6d8f","infoHashBuffer":{"type":"Buffer","data":[1,178,246,221,101,249,14,167,237,16,31,46,16,61,245,126,101,126,109,143]},"announce":[],"urlList":[]}}