{"title":"Railworks TS2016 DTG DR BR 86 Loco Add-On","uid":12623707,"size":326511652,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:02745aa0e45a86fc5161bfaf08b211f954e051e0&amp;dn=Railworks+TS2016+DTG+DR+BR+86+Loco+Add-On&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"TS2015","files":1,"time":1445638092,"description":"Experience the thrill of controlling classic German steam traction in the form of the DR BR 86, which is available now for Train Simulator. \r\n\r\nThe Standard, or Einheitsdampflokomotive Class 86 was built between 1928 and 1943 by many of the German locomotive manufacturers of that era, it was a 2-8-2 tank locomotive and 776 were built. The first 10 locomotives were built with counter pressure brakes to be operable on mountain routes. \r\n\r\nThe Class 86 was designed to be operated on goods trains across branch line routes throughout Germany and beyond with Deutsche Bundesbahn, ÖBB (Austrian Federal Railways) and PKP (Poland) all being buyers of this locomotive. \r\n\r\nAfter 1942, the Class 86 started to be built as ‘transitional war’ variants to simply the design, making construction and maintenance cheaper and easier during the Second World War, changes were made to the cab windows and the wheels to name a few. \r\n\r\nThe first member of the class was retired as early as 1945 by ÖBB who withdrew their entire fleet by 1972. During their operating life this class did haul incredible ore trains with the aid of the DBR Class 52s. Deutsche Bundesbahn retired all engines in 1974, the DR used the engines till 1976, with two of the engines being re-activated in 1982 untill 1988. The last loco to be withdrawn was 86 0001, making it the longest serving of all the standard locomotives in a scheduled service by a national railway at an impressive 60 years old. \r\n\r\nTwelve Class 86s have survived into preservation today with 9 stored in Germany, 2 in Austria and 1 in Poland. One loco has been preserved, the DB BR 86 457 which unfortunately got extensively damaged in the fire at the Nuremberg Transport Museum. \r\n\r\nThe DR BR 86 for Train Simulator recreates the Class 86 steam locomotive as it operated for DB and DR as a mixed traffic locomotive in the common black and red livery from the 1930s used by Deutsche Bundesbahn. As a steam locomotive that operated into the 1970s and 1980s, it is fitted with modern safety systems such as PZB and also comes with Ucs wagons in black and white with the DB logo and Shimms wagons in DB Schenker and Railion livery. \r\n\r\nThe DR BR 86 features Driver Assist which provides you with real-time feedback on the handling of the locomotive, and can teach you how to provide optimum control input in order to keep the engine at peak operating condition. \r\n\r\n\r\n\r\nTHIS ADDON WILL NOT WORK ON LEGIT OF TRAIN SIMUALTOR 2016!!!!","torrent":{"xt":"urn:btih:02745aa0e45a86fc5161bfaf08b211f954e051e0","amp;dn":"Railworks+TS2016+DTG+DR+BR+86+Loco+Add-On","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02745aa0e45a86fc5161bfaf08b211f954e051e0","infoHashBuffer":{"type":"Buffer","data":[2,116,90,160,228,90,134,252,81,97,191,175,8,178,17,249,84,224,81,224]},"announce":[],"urlList":[]}}