{"title":"HISTORY OF POP AND ROCK MUSIC - part 504","uid":8509278,"size":1113590470,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:02e21aff83ed9a06a7df504de7b011fa47b2bbc9&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+504&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1369521140,"description":"\n\n                        PART  504\n\n\n         Madchester was a music scene that developed in Manchester, England, towards the late 1980s and into the early 1990s. The music that emerged from the scene mixed alternative rock, psychedelic rock and dance music. Artists associated with the scene included New Order, Happy Mondays, The Stone Roses, Inspiral Carpets, Northside, 808 State, James, The Charlatans, The Fall, A Guy Called Gerald, and other bands. The music scene in Manchester immediately before the Madchester era had been dominated by bands such as The Smiths, New Order, The Fall and James. These bands were to become a significant influence on the Madchester scene\n\n\n\n              THE STONE ROSES - Fools Gold  (1989)\n              HAPPY MONDAYS  -  Loose Fit  (1990) \n              HAPPY MONDAYS  -  Step On  (1990)\n              THE CHARLATANS  -  Weirdo  (1992)\n\n\n           &quot;Fools Gold&quot; was a single released by  The Stone Roses in 1989. &quot;Fools Gold&quot; became the band's biggest commercial hit at the time. It was their first single to reach the top ten of the UK Singles Chart and stayed in the Top 75 for fourteen weeks, peaking at number eight.\n\n          &quot;Loose Fit&quot; is a  song written and performed by Happy Mondays, released as a single in May 1990 and included in the album &quot;Pills 'n' Thrills and Bellyaches&quot; of the same year.In 2000 Q magazine placed &quot;Pills 'n' Thrills and Bellyaches&quot; at number 31 in its list of the 100 Greatest British Albums Ever. In 2005, the album was voted the 51st greatest album of all time by Channel 4 viewers.\n\n          &quot;He's Gonna Step On You Again&quot; (aka &quot;Step On&quot;) was a hit single, co-written by Christos Demetriou and performed by John Kongos in 1971.Happy Mondays covered the song, retitling it &quot;Step On&quot; in 1990. It was originally intended as a contribution to the Rubaiyat: Elektra's 40th Anniversary compilation for their US label Elektra, but they decided to keep it to release as a single, and instead covered Kongos's Tokoloshe Man for the compilation. The Happy Mondays version incorporates a short sample of three guitar notes from the original.\nIt became their biggest-selling single, peaking at Number 5 in the UK and even making it on to the Billboard Hot 100 chart at Number 57.\n\n       &quot;Weirdo&quot; was a single released by The Charlatans in 1992. It was the first single released from the band's second album &quot;Between 10th and 11th&quot;. The single reached #19 on the UK Singles Chart. The single was the band's most successful in the United States, peaking at #1 on the Billboard Modern Rock Tracks chart for a week in May 1992  and #10 on the Billboard Dance Music/Club Play Singles chart.","torrent":{"xt":"urn:btih:02e21aff83ed9a06a7df504de7b011fa47b2bbc9","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+504","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02e21aff83ed9a06a7df504de7b011fa47b2bbc9","infoHashBuffer":{"type":"Buffer","data":[2,226,26,255,131,237,154,6,167,223,80,77,231,176,17,250,71,178,187,201]},"announce":[],"urlList":[]}}