{"title":"Flipped (2010) NTSC BR2DVD NL subs TBS (Spookkie)","uid":6031710,"size":4435258755,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:048709a7dcc0fe69591944aa19ff76341c8349d8&amp;dn=Flipped+%282010%29+NTSC+BR2DVD+NL+subs+TBS+%28Spookkie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"spookkie","files":17,"time":1292103145,"description":"Flipped (2010) NTSC BR2DVD NL subs TBS (Spookkie)\n\nVerenigde Staten\nKomedie / Drama\n90 minuten\n\ngeregisseerd door Rob Reiner\nmet Madeline Carroll, Callan McAuliffe en Aidan Quinn\n\n'Flipped' vertelt het verhaal van Juli Baker en Bryce Loski. Juli houdt van kippen, zit vaak tijdenlang bovenin haar lievelingsboom voor zich uit te staren en gelooft, vanaf het begin dat ze zijn mooie blauwe ogen zag, dat ze ooit met Bryce zal gaan zoenen. Jammer genoeg voelt Bryce niet zoveel voor Juli. Hij vindt haar zelfs maar een beetje vreemd, want wie houdt er nou van kippen en zit zo lang wat dom voor zich uit te staren in een boom? In groep acht verandert echter alles. Bryce begint Juli toch wel erg leuk te vinden, terwijl Juli begint te denken dat de mooie blauwe ogen van Bryce misschien wel net zo leeg zijn als hijzelf...\n\nJuli Baker devoutly believes in three things: the sanctity of trees (especially her beloved sycamore), the wholesomeness of the eggs she collects from her backyard flock of chickens, and that someday she will kiss Bryce Loski. Ever since she saw Bryce's baby blues back in second grade, Juli has been smitten. Unfortunately, Bryce has never felt the same. Frankly, he thinks Juli Baker is a little weird--after all, what kind of freak raises chickens and sits in trees for fun? Then, in eighth grade, everything changes. Bryce begins to see that Juli's unusual interests and pride in her family are, well, kind of cool. And Juli starts to think that maybe Bryce's brilliant blue eyes are as empty as the rest of Bryce seems to be. After all, what kind of jerk doesn't care about other people's feelings about chickens and trees? With Flipped, mystery author Wendelin Van Draanen has taken a break from her Sammy Keyes series.\n\n\nDVD info:\n\n\n---Source: Flipped.2010.LiMiTED.1080p.BluRay.x264-SECTOR7\n---Audio: Engels 5.1 DD\n---Subs: Custom NL\n---Vertaling: Midewa  \n---Formaat: Video_TS &amp; Audio_TS\n---Formaat: NTSC\n---Menu: No\n---Bewerking: Bradje\n\nWeblink: http://www.moviemeter.nl/film/61998\nWeblink: http://www.imdb.com/title/tt0817177/\n\nBlack-Sam TBS","torrent":{"xt":"urn:btih:048709a7dcc0fe69591944aa19ff76341c8349d8","amp;dn":"Flipped+%282010%29+NTSC+BR2DVD+NL+subs+TBS+%28Spookkie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"048709a7dcc0fe69591944aa19ff76341c8349d8","infoHashBuffer":{"type":"Buffer","data":[4,135,9,167,220,192,254,105,89,25,68,170,25,255,118,52,28,131,73,216]},"announce":[],"urlList":[]}}