{"title":"Camp Rock (2008) [PBX]","uid":4249945,"size":452141275,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:05e325cfe3714828be3bf38a04c3c3cb506cc9aa&amp;dn=Camp+Rock+%282008%29+%5BPBX%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PhoenixBh","files":1,"time":1213920960,"description":"Disney Channels Original Movie Camp Rock!\n\nFeaturing Joe Jonas (And The Rest Of The Crew) And Demi Lovato!\n\n\n\nOfficial Release Dates\n\nCountry\tDate\nCanada \t20 June 2008 \t\nUSA \t20 June 2008 \t\nUK \t1 September 2008 \t\nGermany \t19 September 2008 \t\nAustralia \t26 September 2008 \t\n\n\n\n\n&quot;Camp Rock,&quot; centers on a teen girl who desperately wants to spend her summer at a prestigious rock camp, but can only attend if she works in the kitchen as one of the cooks. When she&amp;#039;s overheard singing - but not seen -- by a teen pop star at the camp, he is completely taken and sets out to find the girl behind the beautiful voice. But first she must confront her fears, step out of the kitchen and into the spotlight.  Written by fmmini\n\nCamp Rock is a musical that mostly focuses on a teen girl Mitchie (Demi Lovato) who desperately wants to spend her summer at a rock camp, but can only attend if she works in the kitchen as one of the cooks. When she&amp;#039;s overheard singing by teen pop star Shane Gray (Joe Jonas) at the camp, he has fallen head over heals and sets out to find the girl with the beautiful voice. Written by alrc2007\n\n&quot;Camp Rock,&quot; centers on a teen girl who desperately wants to spend her summer at a prestigious rock camp, but can only attend if she works in the kitchen as one of the cooks. When she&amp;#039;s overheard singing - but not seen -- by a teen pop star at the camp, he is completely taken and sets out to find the girl behind the beautiful voice. But first she must confront her fears, step out of the kitchen and into the spotlight to show how she really is Written by smily_558\n\nCamp Rock tells the rock n&amp;#039; roll Cinderella story of Mitchie Torres (Demi Lovato), a teen with an amazing voice and a driving ambition to be a pop singer who wants to spend her summer at a prestigious rock camp. Unfortunately, an expensive music camp is a bit out of reach for her family, but her mother gets a job as Camp Rock&amp;#039;s cook so that Mitchie can attend as long as she helps out in the kitchen between classes. Befriended by fellow camp member Caitlyn (Alyson Stoner) but intimidated by the immensely talented Tess Tyler (Meaghan Jette Martin) and her friends Peggy (Jasmine Richards) and Ella (Anna Maria Perez de Tagle), Mitchie lives a double life hiding that she is the cook&amp;#039;s daughter and posing as a well-to-do camper in order to become part of the hottest clique at camp. When she&amp;#039;s overheard singing, but not seen, by teen pop star and celebrity camp instructor, plus lead singer of Connect Three, Shane Gray (Joe Jonas), he is completely taken and sets out to find the girl behind the beautiful voice. Meanwhile, Mitchie will have to learn how to confront her fears, step out of the kitchen and into the spotlight as herself.\n\n\nMP4 Format\n\n\nCurtsy Of\n &lt;a href=&quot;\nhttp://disneystars1.blogspot.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://disneystars1.blogspot.com/&lt;/a&gt;\n\n\n\nPBX Release","torrent":{"xt":"urn:btih:05e325cfe3714828be3bf38a04c3c3cb506cc9aa","amp;dn":"Camp+Rock+%282008%29+%5BPBX%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05e325cfe3714828be3bf38a04c3c3cb506cc9aa","infoHashBuffer":{"type":"Buffer","data":[5,227,37,207,227,113,72,40,190,59,243,138,4,195,195,203,80,108,201,170]},"announce":[],"urlList":[]}}