{"title":"Kentucky Mountain Music (7-CD Box - Yazoo)","uid":7258972,"size":701952936,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:06addb25be287ea04c47da60751c8840840b9bfd&amp;dn=Kentucky+Mountain+Music+%287-CD+Box+-+Yazoo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mudmashers","files":186,"time":1336665868,"description":"Kentucky Mountain Music - Classic Recordings of the 1920s &amp; 1930s (7-CD Box - Yazoo, 192kb)\n\nReview by Ronnie D. Lankford, Jr.\n\nReleased in February 2003, Kentucky Mountain Music is the type of box set that will have old-time music lovers drawing up their holiday wish-list early. A roots music novice will probably question the size and scope of the set: Why would one state, after all, need seven full discs to document its music? But devotees know that (a) Yazoo wouldn't put out anything but a quality product and (b) Kentucky holds more old-time musical riches than most states. As Richard Nevins notes, &quot;no other state comes even close in both terms of fascinating diversity of styles and prodigious amounts of great performances.&quot;\n \nEach disc contains 22-25 performances including fiddle tunes, string band music, and vocals from the 1920s and 1930s. A number of well-respected names make multiple appearances including Burnett and Rutherford, Buell Kazee, and Fiddlin' Doc Roberts. There are a number of fine cuts from Jimmy Johnson String Band (&quot;Gate to Go Through&quot; and &quot;Drink More Cider&quot;), and Taylor's Kentucky Boys (&quot;The Dixie Cowboy&quot; and &quot;Forked Deer&quot;). There's a fun, snappy version of &quot;Hot Corn&quot; by Martin and Roberts, and some nifty banjo work by Henry L. Bandy on &quot;Five Up.&quot; There are also oddities like Bill Bundy's &quot;Poison in a Glass of Wine,&quot; about a jealous boy who poisons both himself and his true love, and the whimsical instrumental by the Fiddlin' Doc Roberts trio called &quot;Honeymoon Stomp.&quot;\n \nThe overall sound quality is good, though, as the liner notes point out, old recordings offer their share of problems when it comes to fidelity. The field recordings in particular were poorly recorded, leaving less room for improvement. Many kinks, however, have been ironed out, and fans will be thankful to have these recordings. Kentucky Mountain Music is a lovingly completed box set that will prove the perfect present for old-time fanatics everywhere.","torrent":{"xt":"urn:btih:06addb25be287ea04c47da60751c8840840b9bfd","amp;dn":"Kentucky+Mountain+Music+%287-CD+Box+-+Yazoo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06addb25be287ea04c47da60751c8840840b9bfd","infoHashBuffer":{"type":"Buffer","data":[6,173,219,37,190,40,126,160,76,71,218,96,117,28,136,64,132,11,155,253]},"announce":[],"urlList":[]}}