{"title":"10 Bass T- Do You Know The Way (1996)","uid":7348573,"size":55480126,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:06cf6daa19fad9cbac1fcf7e965cfef830bc6f5e&amp;dn=10+Bass+T-+Do+You+Know+The+Way+%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Starfave","files":14,"time":1339515107,"description":"REVIEW:\n\nAnd for those of you who don't understandThis... is hip-hop culture&quot;\n\nDamn straight. Jazzy like Gangstarr, gifted like December 25th, &quot;the ten-bass trio&quot; is in full effect on an album I can't be 100% convinced is a debut -- even though I've never heard of them before. This is too good to be a rookie crew with no rep; they've been recording something _somewhere_ before this.\n\nI'm loving this album to pieces yo. FRESH as hell metaphors like &quot;coming with more lyricals than white folks on prozac... got more styles in my house than Cindy Crawford&quot; in &quot;Good Times&quot; got me MAD OPEN. Milo and Solrac chop the mic up lovely with their rhymes, flow, and they manage to sound distinctive in an era where everybody sounds like Rakim or Cube. Selector G hooks up some really FAT ass basslines, drumlines, and all around head-nodda beats.\n\nThis album hits all over the place; showing a highly credible versatility in lyrical compositions. &quot;Some Say We're Spanish...&quot; rings the same bells for me that Chino XL's &quot;Who Am I&quot; hits and &quot;Open Your Eyes&quot; addresses &quot;how silly shit has gotten&quot; in both the music world and the urban world -- with a one-two-three knockout of chorus samples including Buckshot Shorty and Rakim. DAMN.\n\nThis album is far too short at only 12 tracks. I want any of you heads who know about other 10BASS T releases to get in touch with me and tell me how I can check out more of the skills. This is not hyperbole. 10BASS T is undoubtedly one of the best albums I've heard this year. Check out the San Jose Sound Recording Company at SJSR and tell them Flash and HEADz UP! sent you looking for 10BASS T!\n\nORIGINAL HEADz UP! score: 6 out of 6 (converted to RapReviews )TOTAL Vibes: 10 out of 10\n\n\n\n1\tBeat Generation\t\t\t\n2\tHip Hop Culture\t\t\t\n3\tGood Times\t\t\t\n4\t10 Bass Hit\t\t\t\n5\tScratch 'N' Sniff\t\t\t\n6\tWhat's the Definitoin of a 10basst\t\t\t\n7\tGood Times remix\t\t\t\n8\tOpen Your Eyes\t\t\t\n9\tThird World/first Person\t\t\t\n10\tPeople Gettin' Down\t\t\t\n11\tSome Say We're Spanish Some Say We're Black\t\t\t\n12\tBeat Generation #2\n\n\nsource :","torrent":{"xt":"urn:btih:06cf6daa19fad9cbac1fcf7e965cfef830bc6f5e","amp;dn":"10+Bass+T-+Do+You+Know+The+Way+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06cf6daa19fad9cbac1fcf7e965cfef830bc6f5e","infoHashBuffer":{"type":"Buffer","data":[6,207,109,170,25,250,217,203,172,31,207,126,150,92,254,248,48,188,111,94]},"announce":[],"urlList":[]}}