{"title":"Dragon Ball Raging Blast 2 PAL][Textos Spanish][Xbox360][www.con","uid":5932385,"size":7838695885,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:077d6e68f06a22429ffbbf7cac942393ef9ae9ef&amp;dn=Dragon+Ball+Raging+Blast+2+PAL%5D%5BTextos+Spanish%5D%5BXbox360%5D%5Bwww.con&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"consolasatope","files":4,"time":1288823018,"description":"Goku mejora su tÃƒÂ©cnica\nPero no es esto lo mÃƒÂ¡s importante. Lo que hemos querido comprobar hoy en el &quot;stand&quot; de Namco-Bandai es si el sistema de batalla ha evolucionado para resultar accesible y, a la vez, tan dinÃƒÂ¡mico como en el manganime. AsÃƒÂ­ ha sido. Dragon Ball: Raging Blast 2 mejora a su precedesor, en virtud tanto a una optimizada cÃƒÂ¡mara como a una conexiÃƒÂ³n de combos mÃƒÂ¡s espectacular.\n\nLa demostraciÃƒÂ³n nos permitÃƒÂ­a jugar con ocho personajes de la serie (Goku, KrilÃƒÂ­n, Freezer, CÃƒÂ©lula, Dabura, Bardock y Super Janemba), cada uno dotado con hasta cuatro ataques especiales que se activaban mediante el desplazamiento del &quot;stick&quot; derecho hacia diferentes direcciones.\n\nComo siempre, todo a cambio de magia, la cual recargamos mediante la presiÃƒÂ³n de la direcciÃƒÂ³n &quot;abajo&quot; en la cruceta direccional, algo que por otra parte nos dejarÃƒÂ¡ indefensos ante los ataques enemigos, como venÃƒÂ­a siendo habitual durante toda la franquicia de videojuegos.\n\nUno de los personajes jugables durante la feria fue Bardock. Se puede apreciar la extrema fidelidad de los protagonistas de la serie, ademÃƒÂ¡s de una limpieza impoluta en el uso de la tÃƒÂ©cnica &quot;cel-shading&quot;.\nUno de los personajes jugables durante la feria fue Bardock. Se puede apreciar la extrema fidelidad de los protagonistas de la serie, ademÃƒÂ¡s de una limpieza impoluta en el uso de la tÃƒÂ©cnica &quot;cel-shading&quot;.\nOndas vitales accesibles\nLa interfaz apenas se modifica con respecto a Raging Blast. Seguimos teniendo un cÃƒÂ­rculo que nos indica a travÃƒÂ©s de dos barras la cantidad de vida y de magia que nos resta. Ambos valores son fundamentales para leer bien los combates y tambiÃƒÂ©n para percibir si estamos preparados para lanzar la especialidad de cada luchador (mediante el botÃƒÂ³n R3). En el caso de KrilÃƒÂ­n, conseguimos lanzar un &quot;disco infernal&quot; que acabÃƒÂ³ instantÃƒÂ¡neamente con toda la barra vital de nuestro contendiente.\n\nNo obstante, la verdadera esencia de Dragon Ball: Raging Blast 2, su autÃƒÂ©ntico valor como videojuego de luchas, radica en la posibilidad de encadenar acciones una tras otra, con espectacularidad y fluidez de animaciones. Hasta se ha mejorado la tÃƒÂ©cnica de persecuciÃƒÂ³n de nuestro rival (Pursuit Attacks). Y todo de una manera muy intuitiva, sin exigirnos pulsar el botÃƒÂ³n en la milÃƒÂ©sima de segundo adecuada.\n\nGracias a ello, esta segunda parte mejora su experiencia jugable, la cual nos permite luchar en el aire, sumergirnos bajo el agua o movernos a gran velocidad destrozando montaÃƒÂ±as a nuestro paso si es que se ponen de por medio.\n\nUna de las caracterÃƒÂ­sticas a destacar es que podrÃƒÂ¡n dejarnos aturdidos. Para empezar a reaccionar, deberemos de pulsar los botones lo mÃƒÂ¡s rÃƒÂ¡pido posible. Date prisa o lo lamentarÃƒÂ¡s...\nUna de las caracterÃƒÂ­sticas a destacar es que podrÃƒÂ¡n dejarnos aturdidos. Para empezar a reaccionar, deberemos de pulsar los botones lo mÃƒÂ¡s rÃƒÂ¡pido posible. Date prisa o lo lamentarÃƒÂ¡s...\nExplosiÃƒÂ³n de furia\nCabe destacar que disfrutaremos, como es habitual en los juegos de la saga, de introducciones previas a las batallas, aunque todavÃƒÂ­a no hemos podido tener un primer contacto con la manera en que se va a narrar la historia original de Goku y sus amigos.\n\nEn cualquier caso, podemos confirmar que -al menos en la versiÃƒÂ³n americana- las voces estÃƒÂ¡n en japonÃƒÂ©s y son las propias del anime de TV. Con esto, Namco Bandai quiere obtener la mayor fidelidad posible, la cual queda enfatizada claramente por un apartado grÃƒÂ¡fico que vuelve a hacer acopio de &quot;cel-shading&quot; para mostrarnos a todos los personajes de Dragon Ball en todo su esplendor. Esta vez, si cabe, sus expresiones estÃƒÂ¡n mÃƒÂ¡s detalladas, incluidas las faciales, de las que tomaremos buena conciencia al principio de cada contienda (gracias a los tÃƒÂ­picos &quot;piropos&quot; precontienda).\n\nAparte del modo historia, Dragon Ball: Raging Blast 2 tambiÃƒÂ©n contiene el conocido modo versus (presente en la feria) y los torneos, ademÃƒÂ¡s de una modalidad online de la que se irÃƒÂ¡n conociendo mÃƒÂ¡s detalles a medida que se acerque el lanzamiento del producto, previsto para finales de aÃƒÂ±o.\n\n","torrent":{"xt":"urn:btih:077d6e68f06a22429ffbbf7cac942393ef9ae9ef","amp;dn":"Dragon+Ball+Raging+Blast+2+PAL%5D%5BTextos+Spanish%5D%5BXbox360%5D%5Bwww.con","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"077d6e68f06a22429ffbbf7cac942393ef9ae9ef","infoHashBuffer":{"type":"Buffer","data":[7,125,110,104,240,106,34,66,159,251,191,124,172,148,35,147,239,154,233,239]},"announce":[],"urlList":[]}}