{"title":"Sustainability of Products, Processes and Supply Chains","uid":14811742,"size":43541892,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07c7a85c78fefd994c253877e18ebf79372a9147&amp;dn=Sustainability+of+Products%2C+Processes+and+Supply+Chains&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1465196370,"description":"Sustainability of Products, Processes and Supply Chains - Theory and Applications - Fengqi You (Elsevier, 2015).pdf\r\n\r\nISBN 978-0-444-63472-6\r\n\r\nSustainability of Products, Processes and Supply Chains: Theory and Applications presents the recent theoretical developments and applications on the interface between sustainability and process systems engineering. It offers a platform for cutting-edge, holistic analyses of key challenges associated with computer-aided tools for incorporating sustainability principles and approaches into the design and operations of multi-scale process systems, ranging from molecular and products systems, to energy and chemical processes, and supply chains.\r\n\r\n\r\nPresents recent theoretical developments and applications on the interface between sustainability engineering and process engineering\r\nOffers cutting-edge, holistic analyses of key challenges associated with computer-aided tools for incorporating sustainability principles and approaches into the design and operations of multi-scale process systems\r\nBrings together the perspectives of leading researchers to stimulate innovative thinking in terms of sustainability","torrent":{"xt":"urn:btih:07c7a85c78fefd994c253877e18ebf79372a9147","amp;dn":"Sustainability+of+Products%2C+Processes+and+Supply+Chains","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07c7a85c78fefd994c253877e18ebf79372a9147","infoHashBuffer":{"type":"Buffer","data":[7,199,168,92,120,254,253,153,76,37,56,119,225,142,191,121,55,42,145,71]},"announce":[],"urlList":[]}}