{"title":"Reviews in Food and Nutrition Toxicity [Vol. 1-4]","uid":14620506,"size":12659848,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07edde517b057dc84ac197fb42c483301faf2bed&amp;dn=Reviews+in+Food+and+Nutrition+Toxicity+%5BVol.+1-4%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":4,"time":1463266774,"description":"Volume 1 brings together dozens of reviews, providing a clear understanding of the most current issues involved in food and nutrition toxicity. This important new series distills a broad range of research on food safety and food technology into one annual volume. Contributors from the fields of medicine, public health, and environmental science discuss the toxicity of herbal beverages, the use of phytoestrogens in the prevention of hormonal cancers, allergens in food, dietary phosphorus as a nutritional toxin, and more. Each chapter focuses on a particular subject, presenting the latest scientific data and detailed information.\r\n\r\nVolume 2 follows on directly from the successes of the first volume published last year. This series disseminates important data pertaining to food and nutrition safety and toxicology that is relevant to humans. Chapters in this series extend from the introduction of toxins in the manufacture or production of artificial food substances, to the ingestion of microbial contaminants or toxins and the cellular or physiological changes that arise.\r\n\r\nVolume 3 distills a wide range of research on food safety and food technology. Put together by a strong team with a wealth of broad experience, the continuation of this important new series includes contributions from the fields of medicine, public health, and environmental science.\r\n\r\nVolume 4 includes the most recent reviews of current issues involved in the toxicity of food and nutrients. With contributors from the fields of medicine, public health, and environmental science, the continuation of this series distills a broad range of research on food safety and food technology","torrent":{"xt":"urn:btih:07edde517b057dc84ac197fb42c483301faf2bed","amp;dn":"Reviews+in+Food+and+Nutrition+Toxicity+%5BVol.+1-4%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07edde517b057dc84ac197fb42c483301faf2bed","infoHashBuffer":{"type":"Buffer","data":[7,237,222,81,123,5,125,200,74,193,151,251,66,196,131,48,31,175,43,237]},"announce":[],"urlList":[]}}