{"title":"Game: A Global History (2013) pdf","uid":11602012,"size":5307611,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08c4f4c970b509a97746b2d9c41727cd3cbf829e&amp;dn=Game%3A+A+Global+History+%282013%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BookTheif","files":-1,"time":1417364721,"description":"Paula Young Lee, &quot;Game: A Global History&quot; \nEnglish | ISBN: 1780231709 | 2013 | 128 pages | PDF | 5 MB\n\nAntelope and porcupines in Africa, feral cats and wild goats in Australia and deer, pheasants and rabbits in the USA and Europe are just a few of the world's game animals, or creatures hunted for food. Game has been central to the development of humanity and forms a core part of cultures - and meat industries - from the Amazon to the Arctic. In Game, the first culinary overview of the subject, Paula Young Lee describes the fascinating history of a food so diverse it ranges from luxury good to staple of the poor. The animals we hunt as game have varied over history - quail and dormice were once so avidly pursued that they became semi-domesticated, and dishes like bear paws, reindeer pate and lark pie have seen their popularity come and go. The politics of hunting have also come into play, from the earliest hunting laws to today's quotas and efforts at sustainability, and made certain game more desirable: cookbooks once instructed readers how to disguise beef as the more elegant and coveted venison. Featuring unusual recipes for many little-eaten animals and cuts of meat, Game will be gobbled up by readers","torrent":{"xt":"urn:btih:08c4f4c970b509a97746b2d9c41727cd3cbf829e","amp;dn":"Game%3A+A+Global+History+%282013%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08c4f4c970b509a97746b2d9c41727cd3cbf829e","infoHashBuffer":{"type":"Buffer","data":[8,196,244,201,112,181,9,169,119,70,178,217,196,23,39,205,60,191,130,158]},"announce":[],"urlList":[]}}