{"title":"Handbook of Thermoplastic Elastomers 2nd ed","uid":15551067,"size":54208895,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b07b0815a8685ceb93b5d0c5a254660d125c68d&amp;dn=Handbook+of+Thermoplastic+Elastomers+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1471024871,"description":"Handbook of Thermoplastic Elastomers 2nd ed - Jiri George Drobny (WA, 2014).pdf\r\n\r\nHandbook of Thermoplastic Elastomers, Second Edition presents a comprehensive working knowledge of thermoplastic elastomers (TPEs), providing an essential introduction for those learning the basics, but also detailed engineering data and best practice guidance for those already involved in polymerization, processing, and part manufacture.\r\n\r\nTPEs use short, cost-effective production cycles, with reduced energy consumption compared to other polymers, and are used in a range of industries including automotive, medical, construction and many more. This handbook provides all the practical information engineers need to successfully utilize this material group in their products, as well as the required knowledge to thoroughly ground themselves in the fundamental chemistry of TPEs. The data tables included in this book assist engineers and scientists in both selecting and processing the materials for a given product or application.\r\n\r\nIn the second edition of this handbook, all chapters have been reviewed and updated. New polymers and applications have been added — particularly in the growing automotive and medical fields — and changes in chemistry and processing technology are covered.\r\n\r\n\r\n\r\nProvides essential knowledge of the chemistry, processing, properties, and applications for both new and established technical professionals in any industry utilizing TPEs\r\nDatasheets provide &quot;at-a-glance&quot; processing and technical information for a wide range of commercial TPEs and compounds, saving readers the need to contact suppliers\r\nIncludes data on additional materials and applications, particularly in automotive and medical industries","torrent":{"xt":"urn:btih:0b07b0815a8685ceb93b5d0c5a254660d125c68d","amp;dn":"Handbook+of+Thermoplastic+Elastomers+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b07b0815a8685ceb93b5d0c5a254660d125c68d","infoHashBuffer":{"type":"Buffer","data":[11,7,176,129,90,134,133,206,185,59,93,12,90,37,70,96,209,37,198,141]},"announce":[],"urlList":[]}}