{"title":"The Controversy Of Zion","uid":11724128,"size":58197741,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b4346c1813c2a714fa3fdc5104793c2084728ad&amp;dn=The+Controversy+Of+Zion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424988780,"description":"It is one of the commonplaces of history that adverse circumstances offer no obstacle to men of outstanding energy and ability. Douglas Reed, who described himself as &quot;relatively unschooled&quot;, started out in life as an office boy at the age of thirteen and he was a bank clerk at nineteen before enlisting at the outbreak of World War I. A less promising preparation for a man destined to be one of the most brilliant political analysts and descriptive writers of the century could hardly be imagined. He was already 26 years old when he reached the London Times in 1921 as a telephonist and clerk; and he was 30 when he finally reached journalism as sub-editor. Three years later he became assistant Times corespondent in Berlin before moving on to Vienna as Chief Central European corespondent. Reed broke with the Times in October 1943, near the time of the appearance of a book which was to win him instant world fame: INSANITY FAIR, a charming combination of autobiography and contemporary history. This was followed by more best sellers in quick succession. Commencing in 1951, Douglas Reed spent more than three years writing THE CONTROVERSY OF ZION - all 300,000 words of it. He completed the epilogue in 1956. Although there is correspondence to show that the book was once discussed with his publisher, the manuscript was never submitted, but remained for 22 years stowed away in Reed's home in Durban, South Africa. The question remains. Why?","torrent":{"xt":"urn:btih:0b4346c1813c2a714fa3fdc5104793c2084728ad","amp;dn":"The+Controversy+Of+Zion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b4346c1813c2a714fa3fdc5104793c2084728ad","infoHashBuffer":{"type":"Buffer","data":[11,67,70,193,129,60,42,113,79,163,253,197,16,71,147,194,8,71,40,173]},"announce":[],"urlList":[]}}