{"title":"My.Dream.Home.s03e12.PDTV.x264.Hector.mp4","uid":9684063,"size":401078182,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0bf33512e9938d4230f60b2e4b7711766120bcce&amp;dn=My.Dream.Home.s03e12.PDTV.x264.Hector.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GaryBradbury2012","files":-1,"time":1393722922,"description":"This show is called &quot;Property Brothers&quot; in some countries.\nPlease note that the episodes will soon be uploaded in a rather random order as that is the way Foxtel (my TV service) presents them! Luckily, you don't need to watch episode 8 before episode 9 etc!\n\nAfter selling their condo, Rose, Giancarlo, and their daughters are camped out in her parents' tiny basement. They want a spacious, one-storey house with a gourmet kitchen close to good schools. The Property Brothers come to the rescue helping them find a budget-friendly dream home that can be renovated on time... with a little help from Cindy Crawford. With a budget that doesn't match the couple's expectations, Drew and Jonathan struggle to sell the potential of a fixer-upper. But once they buy into the plan, Rose and Giancarlo start second-guessing Jonathan at every turn. Their late breaking changes cause major delays, yet impatience still gets the better of Giancarlo. And his offer to help with the wiring turns out to be no help at all. Looking to relieve stress, Jonathan and Drew go furniture shopping when they receive some advice from Cindy Crawford.\n\nIf you see &quot;Hector&quot; on the end of a file it means I capped it.\nEnjoy, Gaz/Hector :)","torrent":{"xt":"urn:btih:0bf33512e9938d4230f60b2e4b7711766120bcce","amp;dn":"My.Dream.Home.s03e12.PDTV.x264.Hector.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bf33512e9938d4230f60b2e4b7711766120bcce","infoHashBuffer":{"type":"Buffer","data":[11,243,53,18,233,147,141,66,48,246,11,46,75,119,17,118,97,32,188,206]},"announce":[],"urlList":[]}}