{"title":"FS2004 - Aerosoft - Real Germany 3 v1.2","uid":3823969,"size":161802620,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0c61e39a55e717a923b22ee047eeb0b7f9d5eea3&amp;dn=FS2004+-+Aerosoft+-+Real+Germany+3+v1.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"4X-AXG","files":16,"time":1191093805,"description":"Real Germany 3 \n\n(Bavaria)\nThe brand new add-on from Aerosoft brings a truly exciting experience to all Flight simmers. All friends of the beautiful Bavarian countryside will be thrilled to fly across this highly detailed aerial photographic scenery covering Bavaria (with the exception of eastern Bavaria) and eastern WÃƒÂ¼rttemberg. Especially flights in the German alpine region will be a unique adventure for every pilot. \n\nThe borders of the neighbouring areas such as the scenery Austria Professional and Switzerland Pro are blended in very well to ensure a smooth transition.\n\nThe PC pilot now has the chance to fly under VFR rules in this realistic landscape. The resolution reaches 0,5m/pixel though Flight Simulator restricts some areas to 4m/pixel. Houses, mountains, hills, rock formations, cities, towns, villages, barns, industrial areas, streets, waterways and lakes are now fully visible and recognizable on the PC screen.The detailed, digital elevation model (DHM) enhances the beautiful summer textures with a perfect three-dimensional view. The PC pilot will discover new exciting flying areas time and time again! A close to reality simulation of visual flying in nearly all weather conditions is now guaranteed in FS2004. The high level of reality in flight simulation when using single engine aircraft as used by many hobby pilots is now even greater than in most professional Simulators.\n\nThis scenery is fully compatible to the German Airports series for FS2004 and comes on a DVD with an extensive printed manual and a coloured ICAO map from the DFS for this region.","torrent":{"xt":"urn:btih:0c61e39a55e717a923b22ee047eeb0b7f9d5eea3","amp;dn":"FS2004+-+Aerosoft+-+Real+Germany+3+v1.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c61e39a55e717a923b22ee047eeb0b7f9d5eea3","infoHashBuffer":{"type":"Buffer","data":[12,97,227,154,85,231,23,169,35,178,46,224,71,238,176,183,249,213,238,163]},"announce":[],"urlList":[]}}