{"title":"Stargate SG-1 - Season 03 - Episodes 1 thru 11","uid":14099296,"size":7348143085,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0c83ff05250af5230714cfb2a2ae4ed6f71a4e72&amp;dn=Stargate+SG-1+-+Season+03+-+Episodes+1+thru+11&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":40,"time":1459306762,"description":"Stargate SG-1 - Season 03 - Episodes 12 thru 22\r\n\r\nDescription\r\nSeason Three\r\nStargate SG-1 Season Three Episode Guides\r\n\r\nimage\r\n\r\n\r\n3.01 &quot;Into The Fire Part 2&quot;\r\nHathor captures O'Neill and implants him with a Goa'uld symbiote that could eventually kill him. Meanwhile, O'Neill's rescue party is defeated by Hathor's invincible energy barrier, and time is running out. Is there any way to save O'Neill?\r\n\r\nGuide | Transcript\r\n301eg.jpg\r\n3.02 &quot;Seth&quot;\r\nWhen SG-1 hunts for a Goa'uld lord living on Earth, they discover this powerful alien in the form of a religious leader with a heavily armed cult following. O'Neill faces off with both government agents and the cult in a fiery clash that may destroy them all.\r\n\r\nGuide | Transcript\r\n302eg.jpg\r\n3.03 &quot;Fair Game&quot;\r\nO'Neill attempts to stop a Goa'uld invasion of Earth. But to call off the attack, the Goa'uld lords demand the destruction of the Stargate. O'Neill doesn't trust them—but the fate of Earth lies in the balance.\r\n\r\nGuide | Transcript\r\n303eg.jpg\r\n3.04 &quot;Legacy&quot;\r\nAfter Daniel begins to experience hallucinations, SGC doctors suspect that the number of trips through the Stargate may be limited. Daniel insists that something went wrong on SG-1's last mission, but no one believes him. With his condition worsening, will Daniel be able to convince them before he is permanently committed to a mental hospital?\r\n\r\nGuide | Transcript\r\n304eg.jpg\r\n3.05 &quot;Learning Curve&quot;\r\nAs part of an exchange program with the planet Orban, O'Neill travels to Earth with an alien girl who possesses incredible technical knowledge. But by the time O'Neill discovers the truth behind the child's superior mind…it may be too late for them all.\r\n\r\nGuide | Transcript\r\n305eg.jpg\r\n3.06 &quot;Point Of View&quot;\r\nAlternate reality versions of Carter and Kawalsky are found in Area 51. Brought to Stargate Command, they start to deteriorate. However, return to their own reality means certain death, as their world has been invaded by Goa'ulds.\r\n\r\nGuide | Transcript\r\n306eg.jpg\r\n3.07 &quot;Deadman Switch&quot;\r\nSG-1 is captured by Aris Boch, a bounty hunter chasing an evil Goa'uld named Kel'tar. He offers them freedom in exchange for their help. They agree, only to find that Kel'tar is in fact a Tok'ra, whose capture would endanger countless others.\r\n\r\nGuide | Transcript\r\n307eg.jpg\r\n3.08 &quot;Demons&quot;\r\nSG-1 encounters a medieval civilization and frees a woman tied to a stake as a sacrifice to a demon. With the woman freed, the demon vows to destroy the village unless the SG-1 team is offered up in appeasement.\r\n\r\nGuide | Transcript\r\n308eg.jpg\r\n3.09 &quot;Rules Of Engagement&quot;\r\nSG-1 lands in the middle of a blazing battle between Stargate soldiers and a Jaffa army. Believing the soldiers to be the missing-in-action SG-11 team, O'Neill and other others provide assistance…until the mystery team turns its weapons on SG-1.\r\n\r\nGuide | Transcript\r\n309eg.jpg\r\n3.10 &quot;Forever In A Day&quot;\r\nDuring a rescue of captured Abydonians, Daniel finds his missing wife, Sha're. But instead of greeting him, she attacks him—leading to her death at the hands of Teal'c. Distraught over her death and angry at Teal'c, Daniel quits Stargate Command.\r\n\r\nGuide | Transcript | Wallpapers | Screencaps\r\n310eg.jpg\r\n3.11 &quot;Past And Present&quot;\r\nSG-1 encounters an entire planet suffering from amnesia. The planet's leader, a woman named Ke'ra, returns to Earth with SG-1 to find a cure. But even as Ke'ra and Daniel develop a mutual attraction, SG-1 suspects she may not be who she appears to be.\r\n\r\nGuide | Transcript\r\n311eg.jpg","torrent":{"xt":"urn:btih:0c83ff05250af5230714cfb2a2ae4ed6f71a4e72","amp;dn":"Stargate+SG-1+-+Season+03+-+Episodes+1+thru+11","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c83ff05250af5230714cfb2a2ae4ed6f71a4e72","infoHashBuffer":{"type":"Buffer","data":[12,131,255,5,37,10,245,35,7,20,207,178,162,174,78,214,247,26,78,114]},"announce":[],"urlList":[]}}