{"title":"Robert Plant - Band Of Joy (2010) WMA320","uid":6125914,"size":174427719,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0c97c4d0bb5716eb52448538de768922b5d692dd&amp;dn=Robert+Plant+-+Band+Of+Joy+%282010%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1295941010,"description":"OK, I'll get this out up front: I think this is Robert Plant's single best offering. Ever. There, I said it - and I can feel the psychic outpourings from a gazillion Zep fans already. \n\nOf course Plant produced wondrous things in 'that other band'. I'm sure I could select any number of permutations of single Zeppelin, or even post-Zeppelin, tracks and put them together in a compilation that I rate higher than I do this. But, no previous, non-compilation, offering satisfies me in quite the way Band of Joy does. Perhaps that simply reflects the 30 plus years I've put on post the untimely demise of what to me was the unparalleled rock band. As one other reviewer has said: there was Zeppelin and then there was everyone else. \n\nSo what makes Band of Joy so pleasurable for me? It's a long list. For starters and in no particular order: \n\nTrack selection: I like the way Plant has delved into the archives and brought to us a selection of tunes that range from foot-stomping to dark and brooding. I can't fault it. He's introduced me to stuff I would not otherwise have heard and that means that I will probably go back to the source for some of it to hear how they have been reinterpreted. So, he's honouring us as listeners and those who have laid the way before him. \n\nPlant's voice: Of course his has always been one of the great distinctive rock voices. At 62 though we can't expect the wail of the Immigrant Song. On this album his voice ranges from playful to introspective and at all times he sounds completely in control of it. He does give us the occasional peek back to signature notes from his career but this is a wonderfully assured mature voice. He seems an artist who has absolutely nothing left to prove and is revelling in the artistic freedom that gives him. \n\nMusicianship: With the exception of Buddy Miller, I was not aware of any of the other instrumentalists on this album. Of course, RP has worked with the best in his time. These guys all live up to the standards one would expect. Plant's own comments sum them up: &quot;The musicianship of these guys is almost frightening, singing with them, I'm just sliding down the rigging with a knife in my teeth, trying to make off with a few experiences. Sometimes I think I should just be helping out in catering.&quot; \n\nPatty Griffin: long one of my favourite singer-songwriters Griffin brings an other worldliness to Band of Joy. Make no mistake, this is not an album of duets. Rather she adds a depth, complexity and richness to the sound that is almost instrumental. Having heard it I struggle to imagine the album without it. \n\nI'm hard pressed to single out favourites from this album. There's certainly no tracks that on the umpteenth listening I'm hitting the skip track button on. If pushed I would pick 'Central Two-O-Nine'; 'Silver Rider'; 'Falling in Love Again'; 'The Only Sound That Matters'; 'Monkey'; and 'Harm's Swift Way' but that list might change tomorrow. \n\nI'm fascinated to hear where Plant goes next. I could care less whether Zeppelin reunites - we have a wonderful archival history to draw from. In the liner notes to Band of Joy Plant gives gratitude to David Rawlings and Gillian Welch for kindness and hospitality. A collaboration with that couple would be fascinating. \n\nby T. Mitchell &quot;New (Zealand) fan&quot;\n\nTRACKLIST:\n\n01 - Angel Dance.wma                                        \n02 - House Of Cards.wma                                     \n03 - Central Two-O-Nine.wma                                 \n04 - Silver Rider.wma                                       \n05 - You Can't Buy My Love.wma                              \n06 - Falling In Love Again.wma                              \n07 - The Only Sound That Matters.wma                        \n08 - Monkey.wma                                             \n09 - Get Along Home Cindy.wma                               \n10 - Harms Swift Way.wma                                    \n11 - Satan Your Kingdom Must Come Down.wma                  \n12 - Even This Shall Pass Away.wma\n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:0c97c4d0bb5716eb52448538de768922b5d692dd","amp;dn":"Robert+Plant+-+Band+Of+Joy+%282010%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c97c4d0bb5716eb52448538de768922b5d692dd","infoHashBuffer":{"type":"Buffer","data":[12,151,196,208,187,87,22,235,82,68,133,56,222,118,137,34,181,214,146,221]},"announce":[],"urlList":[]}}