{"title":"History of the World - J. M. Roberts","uid":14321758,"size":1442660135,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0cfda31a18a3dabbe918e126c2c14a20ccf3a4df&amp;dn=History+of+the+World+-+J.+M.+Roberts&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Beanhh123","files":53,"time":1460612057,"description":"From the evolution of Homo sapiens to the exploration of space, the vast landscape of human history appears in J.M. Roberts's History of the World. Deftly written and evocatively illustrated, this book offers an outstanding one-volume survey of the major events, developments, and personalities of the known past.\r\nIn a truly remarkable work of compression and synthesis, Roberts sweeps through thousands of years of history, weaving the stories of empires, arts, religion, economics, and science into his lucid narrative. Beginning with the early hominids, he swiftly and authoritatively brings the story up through the emergence of Mesopotamian civilizations and ancient Egypt. Here, too, is comprehensive coverage of the Indian and Chinese civilizations (&quot;For two and a half thousand years,&quot; he points out, &quot;there has been a Chinese nation using a Chinese language&quot;), as well as developments in Africa and South America. Aided by photographs of key archaelogical finds (such as monumental Egyptian statues, Peruvian medallions, and Celtic jewelry), Roberts clearly explains the early arts, engineering, and religion. He also carefully ties in changing economics--such as trade routes and developments in agriculture and manufacturing--making clear their importance for the history of politics and changing societies. The story leaps ahead, through the Roman Empire, the explosive arrival of Islam, the rise and fall of samurai rule in Japan, the medieval kingdoms of sub-Saharan Africa, the Mongol conquests, and the early modern expansion of Europe across the globe. American independence, the French Revolution, the colonial empires, Japan's startling modernization, and the World Wars follow in turn, accompanied by discussions of scientific and technical breakthroughs","torrent":{"xt":"urn:btih:0cfda31a18a3dabbe918e126c2c14a20ccf3a4df","amp;dn":"History+of+the+World+-+J.+M.+Roberts","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cfda31a18a3dabbe918e126c2c14a20ccf3a4df","infoHashBuffer":{"type":"Buffer","data":[12,253,163,26,24,163,218,187,233,24,225,38,194,193,74,32,204,243,164,223]},"announce":[],"urlList":[]}}