{"title":"Saints.Row.IV.Repack.R.G.Revenants","uid":8842850,"size":5520599416,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0d2c4f15b707b8a7569e074698e14e6cfd5dd5a9&amp;dn=Saints.Row.IV.Repack.R.G.Revenants&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Taker009","files":19,"time":1377291663,"description":"Saints.Row.IV.Repack.R.G.Revenants\n\n\n\n\n\nSaints Row IV\nYear: 2013\nPublication Type: RePack [Repack]\nTablet: enclosing (RELOADED)\nLanguage: English / French / German / Italian / Spanish\nSound language: English\n\nDescription:\n\nStilport - a giant virtual &quot;sandbox&quot; in which everything is possible - superpowers, unimaginable transport and an arsenal of weapons of extraterrestrial! Enjoy the endless possibilities of the President and show its citizens that capable of a true leader of the Saints. In Saints Row IV Saints head was elected president of the United States. But this is only the beginning! And now, with nothing comparable, inflamed catastrophic alien invasion, the madness of Saints Row series has made a new round - the aliens\nabandoned the Saints in a virtual model of their hometown Stilport. Master the supernormal grand scale and pry humanity from alien grandfather's mental acumen Zinyaka. Escape from the virtual trap that caught the Saints or die trying. Saints Row IV throws the player into the abyss of alien technology and weapons\nthat will make every Saint in the face of ultimate destruction. Apply your alien superpowers to punch their way to the top. The advanced features and advanced customization, the player can jump off a building to building, overtaking fast sports cars, to send enemies flying power of telekinesis. All this and more\nin the most reckless of Saints Row!\n\nGAME FEATURES:\n\nThe American Dream - the story covers the whole country, the space and time! Saints Row IV\n\ncompared to Saints Row: The Third is like Saints Row: The Third, compared with the movie\n&quot;Do the Right Thing!&quot; This game can not prepare.\n\nSupreme Commander of the superhero - jump over the building, kill the people with the power of\nthought, pass through tanks like a knife through butter. And this is the most peaceful abilities,\nwhich will be accessible!\n\nAlien dangerous toys - use (for research purposes), an impressive array of alien weapons and vehicles.\n\nCustomise weapons of custom madness - you customize the look of your character, you set up his clothes.\nNow you can complete your way through a new set of weapons. Turn the ordinary to the exotic gun barrels.\n\nThe destructive duo - a free connection to the co-op mode, the standard for Saints Row,\njust got better! The only thing that could be cooler than the evil President with supernormal,\nthe two superpowers of the President of evil!\n\n\nREPACK FEATURES\n\n\nDo not cut / no recoded\nUpdate 1\nBecause of the characteristics of the separation on the discs is recommended to add the installer to avoid anti-virus - any virus it has no\nDLC:\nSeason Pass DLC\nAverage installation time ~ 12 minutes\nRePacked by RG Revenants\n\nSystem requirements:\n\nOperating system: Windows Vista / 7/8\nProcessor: Intel Core 2 Quad Q6600 / AMD Athlon II x3\nRAM: 2 GB\nVideo: NVIDIA GTX 260 | AMD Radeon HD 5800 series\nSound device: compatible with DirectX\nHard disk space: 8,4 GB\nWindows Â® Aero can cause performance degradation or image artifacts.\nIf you are using Windows Â® Aero, then disabling it can increase graphics performance.ete.\n\nFix for games on the internet.\n\nExtract the archive into the game folder.\nRun Steam and log into your (fake web) account.\nRun REVOLT Launcher.exe (as administrator):\nHOST:\nCOOP -&gt; ONLINE -&gt; NEW / LOAD GAME and create a game.\nPRESS INVITE FRIENDS, and then your friend.\nCLIENT:\nWait for prompt and press JOIN.\nPlay.","torrent":{"xt":"urn:btih:0d2c4f15b707b8a7569e074698e14e6cfd5dd5a9","amp;dn":"Saints.Row.IV.Repack.R.G.Revenants","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d2c4f15b707b8a7569e074698e14e6cfd5dd5a9","infoHashBuffer":{"type":"Buffer","data":[13,44,79,21,183,7,184,167,86,158,7,70,152,225,78,108,253,93,213,169]},"announce":[],"urlList":[]}}