{"title":"Mein Kampf: A Translation Controversy","uid":11704668,"size":3097407,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d5708dc7c5423707c6c4a765e8a459a2760fcd4&amp;dn=Mein+Kampf%3A+A+Translation+Controversy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424072705,"description":"They Got Mein Kampf Wrong! Adolf Hitler's book, Mein Kampf, has been controversial for many reasons but one of the greatest controversies has been over the English translations. We have discovered that these older versions contain mistranslations, inaccurate translations, and outright embellishment. Mein Kampf: A Translation Controversy takes a look at Mein Kampf like no one has before and explains many elements that have confused readers. We also reveal many passages that were quietly omitted from past English translations. I reviewed and checked every line and for the first time, Mein Kampf is available in an easy to understand version. This long road of research and sweat from the development of a new translation has revealed over 1000 errors in past English translations. Now you can discover previously unknown aspects to Mein Kampf and understand it as no one has before. There are many secrets in the pages of Mein Kampf. They have remained hidden by poor and inaccurate translations. In this critical analysis of the existing English translations, we will reveal countless errors that have distorted the meaning of the work. We will also explain some important points about Mein Kampf that have confused readers in the past and give you some background information that will enhance the political and historical meaning of this hotly debated work. Don't miss your chance to learn what few people know. Read Mein Kampf: A Translation Controversy now","torrent":{"xt":"urn:btih:0d5708dc7c5423707c6c4a765e8a459a2760fcd4","amp;dn":"Mein+Kampf%3A+A+Translation+Controversy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d5708dc7c5423707c6c4a765e8a459a2760fcd4","infoHashBuffer":{"type":"Buffer","data":[13,87,8,220,124,84,35,112,124,108,74,118,94,138,69,154,39,96,252,212]},"announce":[],"urlList":[]}}