{"title":"James Purdy - Eustace Chisholm and the Works (pdf)","uid":10319706,"size":1823967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d8f9c5c9ada0744e0fe22d459e11fbb35e02502&amp;dn=James+Purdy+-+Eustace+Chisholm+and+the+Works+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1402291357,"description":"James Purdy - Eustace Chisholm and the Works (Carroll &amp; Graf, 2005; first published 1967). 253 pp.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. \n\n\nA writer new to me, but after getting some more info on him, he looks fascinating. If anyone is interested in him, I'll upload more of his books. I have a few I can scan, as well as retail versions of two books (including Collected Stories).\n\ndescription:\n\n[Scanner's note: curiously, the book cover makes no mention that this is a &quot;gay&quot; novel, as the description below does. From what I've read about Purdy, that may be the least controversial thing about the book.]\n\nA literary cult hero of major proportions, James Purdy's exquisitely surreal fiction - Tennessee Williams meets William S. Burroughs - has been populated for more than forty years by social outcasts living in crisis and longing for love. His acclaimed first novel, Malcolm (1959), won praise from writers as diverse as Dame Edith Sitwell, Dorothy Parker, and Gore Vidal, while his later works, from the award-winning In a Shallow Grave (1976) to Gertrude of Stony Island Avenue (1998), influenced new generations of authors. \n\nEustace Chisholm and the Works, a 1967 novel that became a gay classic, is an especially outspoken book among the author's controversial body of work. Purdy recalls that Eustace Chisholm and the Works - named one of the Publishing Triangle's 100 Best Lesbian and Gay Novels of the 20th Century - outraged the New York literary establishment. More than breaking out of the pre-Stonewall closet, however, the book liberated its author and readers can be grateful for that.\n\n\n&quot;James Purdy is the outlaw of American fiction.&quot; -- New York Times\n\n\n","torrent":{"xt":"urn:btih:0d8f9c5c9ada0744e0fe22d459e11fbb35e02502","amp;dn":"James+Purdy+-+Eustace+Chisholm+and+the+Works+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d8f9c5c9ada0744e0fe22d459e11fbb35e02502","infoHashBuffer":{"type":"Buffer","data":[13,143,156,92,154,218,7,68,224,254,34,212,89,225,31,187,53,224,37,2]},"announce":[],"urlList":[]}}