{"title":"Simon and Simon Seasons  5 6 7 8","uid":9160025,"size":11948900127,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0d9e39931a779614d60b3c9931c4672c602b98f9&amp;dn=Simon+and+Simon+Seasons++5+6+7+8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":7,"uploader":"claudiatannahill","files":74,"time":1383858836,"description":"Simon &amp; Simon is an American detective television series that originally ran from November 24, 1981 to January 21, 1989. The series was broadcast on CBS and starred Gerald McRaney and Jameson Parker as two brothers who run a private detective agency together.\n\nThe show revolves around polar opposite Simon brothers, Rick (McRaney) and Andrew Jackson, a.k.a. A.J. (Parker). Rick was a United States Marine Corps Vietnam veteran and had much more street sense, while A.J. went to college and had book smarts. Rick preferred things that were viewed by his brother as lower-class, like pickup trucks (Rick's Dodge Power Wagon is notable for its dull paint and large metal bumper used in one episode to crush the engine of a car), while A.J. took care of his money and could afford to be more fashionable (A.J. often drove a 1957 Chevrolet Bel Air convertible, and later, a customized Chevrolet Camaro Z28 and also drove a 1968 Chevrolet Camaro RS convertible in the two-part episode, &quot;Pirate's Key&quot;). A.J. was a practicing Catholic, while Rick was not. Rick lived on a boat in A.J.'s yard. A.J. preferred to first try to do things by the rules while Rick was much more of a free spirit, using a classic P.I. type of justice. Even their guns are different: Rick has a .45 Colt Mod.1911 and A.J. has a .357 Magnum revolver.\n\nThe two went into business together, running a private detective service; the contrasting ways that the brothers went about their investigations and the subsequent conflicts between them provided much of the story each week, in addition to the plots of solving the cases. Although the premise in the series is that Rick is older and A.J. is younger, in fact McRaney and Parker were both born in 1947 with only a four-month age difference.","torrent":{"xt":"urn:btih:0d9e39931a779614d60b3c9931c4672c602b98f9","amp;dn":"Simon+and+Simon+Seasons++5+6+7+8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d9e39931a779614d60b3c9931c4672c602b98f9","infoHashBuffer":{"type":"Buffer","data":[13,158,57,147,26,119,150,20,214,11,60,153,49,196,103,44,96,43,152,249]},"announce":[],"urlList":[]}}