{"title":"Reaching for the Sun: How Plants Work 2nd ed","uid":6663769,"size":1665940,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0dadd43a244b57c6fab1f67fdfaabb3e7eee6940&amp;dn=Reaching+for+the+Sun%3A+How+Plants+Work+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1315608799,"description":"From their ability to use energy from sunlight to make their own food, to combating attacks from diseases and predators, plants have evolved an amazing range of life-sustaining strategies. Written with the non-specialist in mind, John King's lively natural history explains how plants function, from how they gain energy and nutrition to how they grow, develop and ultimately die. New to this edition is a section devoted to plants and the environment, exploring how problems created by human activities, such as global warming, pollution of land, water and air, and increasing ocean acidity, are impacting on the lives of plants. King's narrative provides a simple, highly readable introduction, with boxes in each chapter offering additional or more advanced material for readers seeking more detail. He concludes that despite the challenges posed by growing environmental perils, plants will continue to dominate our planet.\n \nWho would have thought that plants behave like squirrels and bears? Yet many do, as we can tell by watching a tree's autumn colors arrive. The yellow and green pigments, carotenoids, are hidden by the green photosynthetic pigment chlorophyll; only when the deciduous plant retrieves this chlorophyll for winter storage do the lighter colors show through. You'll learn about this process, about why one bad apple can spoil a whole barrel, why the Amazon rainforest matters, and myriad other matters of plant life in John King's lively natural history, Reaching for the Sun. The text is technically dense but highly readable.\n\nCUP 2011\n \n","torrent":{"xt":"urn:btih:0dadd43a244b57c6fab1f67fdfaabb3e7eee6940","amp;dn":"Reaching+for+the+Sun%3A+How+Plants+Work+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dadd43a244b57c6fab1f67fdfaabb3e7eee6940","infoHashBuffer":{"type":"Buffer","data":[13,173,212,58,36,75,87,198,250,177,246,127,223,170,187,62,126,238,105,64]},"announce":[],"urlList":[]}}