{"title":"EPOCH. v1.0.2","uid":6934370,"size":287290304,"categoryP":"games","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:0ddb1e160f02253e3ac9ef02b69ca15800945da5&amp;dn=EPOCH.+v1.0.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mobile-warez","files":2,"time":1325768907,"description":"EPOCH - Post-apocalyptic Robot Combat\n\nFeatured as &quot;Game of the Week&quot; on the App Store!\n\nTrailer\n\n* IGN.COM - &quot;iOS cover shooting done right&quot;. \n\n* TOUCHARCADE.COM - &quot;Cover never felt so awesome&quot;\n\n* SLIDETOPLAY.COM - &quot;Combine the gorgeous look with the superbly tuned touch-screen controls and high level of replayability, and result is a great and unique iOS action game ...&quot;\n\n* GIZMODO.CO.UK - &quot;EPOCH is the new cover-shooter king by several circuit-boards.&quot;\n\n* POCKETGAMER.CO.UK - &quot;re-imagining the genre completely for the touchscreen&quot;\n\n* APPOLICIOUS.COM - &quot;It's an absolutely gorgeous game with fast paced visceral combat that keeps you on your toes, and it even has an interesting story thrown in the mix.&quot;\n\n* GAMEPRO.COM - &quot;...the game is an Unreal Engine-powered visual tour-de-force that is sure to impress both you and your friends.&quot;\n\nUNRAVEL THE MYSTERY\n\nFollow the echoes of a lost civilization in a visually-stunning post-apocalyptic world where only robots survive to fight a never-ending war. Fight towards your goal and piece together the fragments to reveal exactly what happened when the old world ended. Is this the dawn of a new Epoch? And how can you find the one person you were originally assigned to protect?\n\nCHOREOGRAPH THE ACTION\n\nControl your character with intuitive finger swipes. Make split-second tactical decisions, take cover, select targets, dodge incoming fire, utilize special abilities, and launch countermeasures!\n\nDESTROY, SALVAGE AND UPGRADE\n\nBattle escalating waves of robots in arena-style combat, and upgrade yourself with pieces torn from your fallen enemies! Configure your robot with dozens of weapons, armors, boosters and counters.\n\nIMMERSIVE SINGLE-PLAYER CAMPAIGN\n\nFight in multiple locations across a vast and ravaged city, and gather fragments of the past with logs from a cast of characters, each with their own perspective on the apocalyptic events that destroyed a once-proud civilization.\n\nSTUNNING AAA VISUALS\n\nUtilize the enhanced visual capabilities of the iPhone4S and iPad 2 with high-resolution graphics powered by the UnrealEngine, the same engine used to create the visuals of the award winning Infinity Blade.\n\nAbout Uppercut Games\n\nUppercut Games is an independent game studio whose founders have a long development history, working on award winning games such as Bioshock, Tribes: Vengeance, Freedom Force and Fallout: Tactics.","torrent":{"xt":"urn:btih:0ddb1e160f02253e3ac9ef02b69ca15800945da5","amp;dn":"EPOCH.+v1.0.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ddb1e160f02253e3ac9ef02b69ca15800945da5","infoHashBuffer":{"type":"Buffer","data":[13,219,30,22,15,2,37,62,58,201,239,2,182,156,161,88,0,148,93,165]},"announce":[],"urlList":[]}}