{"title":"The Velvet Underground Nico [24 bit FLAC] vinyl","uid":8107614,"size":975326565,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0e0be21f42f8435fb7a0b2e4d6657f04f3e22d7d&amp;dn=The+Velvet+Underground+Nico+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"24.96","files":-1,"time":1360110872,"description":"One would be hard-pressed to name a rock album whose influence has been as broad and pervasive as The Velvet Underground &amp; Nico. While it reportedly took over a decade for the album's sales to crack six figures, glam, punk, new wave, goth, noise, and nearly every other left-of-center rock movement owes an audible debt to this set. While The Velvet Underground had as distinctive a sound as any band, what's most surprising about this album is its diversity. Here, the Velvets dipped their toes into dreamy pop (&quot;Sunday Morning&quot;), tough garage rock (&quot;Waiting for the Man&quot;), stripped-down R&amp;B (&quot;There She Goes Again&quot;), and understated love songs (&quot;I'll Be Your Mirror&quot;) when they weren't busy creating sounds without pop precedent. Lou Reed's lyrical exploration of drugs and kinky sex (then risky stuff in film and literature, let alone &quot;teen music&quot;) always received the most press attention, but the music Reed, John Cale, Sterling Morrison, and Maureen Tucker played was as radical as the words they accompanied. The bracing discord of &quot;European Son,&quot; the troubling beauty of &quot;All Tomorrow's Parties,&quot; and the expressive dynamics of &quot;Heroin&quot; all remain as compelling as the day they were recorded. While the significance of Nico's contributions have been debated over the years, she meshes with the band's outlook in that she hardly sounds like a typical rock vocalist, and if Andy Warhol's presence as producer was primarily a matter of signing the checks, his notoriety allowed The Velvet Underground to record their material without compromise, which would have been impossible under most other circumstances. Few rock albums are as important as The Velvet Underground &amp; Nico, and fewer still have lost so little of their power to surprise and intrigue more than 40 years after first hitting the racks.","torrent":{"xt":"urn:btih:0e0be21f42f8435fb7a0b2e4d6657f04f3e22d7d","amp;dn":"The+Velvet+Underground+Nico+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e0be21f42f8435fb7a0b2e4d6657f04f3e22d7d","infoHashBuffer":{"type":"Buffer","data":[14,11,226,31,66,248,67,95,183,160,178,228,214,101,127,4,243,226,45,125]},"announce":[],"urlList":[]}}