{"title":"Harry Turtledove - WorldWar Series Complete - Alternative WWII F","uid":6092633,"size":2620982595,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0ee9dca3a62e44b74e5f8fd1bd927102fd14c15d&amp;dn=Harry+Turtledove+-+WorldWar+Series+Complete+-+Alternative+WWII+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1294627136,"description":"**NOTE** - These torrents are from a private tracker. The OP's notes for the first book are listed below. No notes were provided for the other three books in the series, but the other three are complete with similar stats. \n\nUnabridged, Ripped from Audio Cassette\n\n\nTosev timeline is a fan name given to a series of Harry Turtledove's alternate history science fiction novels; it includes the Worldwar tetralogy, the Colonization trilogy, and the novel Homeward Bound, and its settings range from 1942 to 2031. The name is derived from Tosev 3, a name used by aliens to refer to Earth (the third-innermost planet of the star Tosev).\n\nThe saga opens with a conquest fleet of aliens arriving on Earth at the time of World War II. These aliens have planned invasion for centuries, based on the findings of a probe that examined Earth at the time of the Middle Ages. &quot;The Race&quot; expected to find life and technology on Earth (to them known as Tosev 3) the same as when their probe found it, as the Race themselves develop very slowly. The first series deals with the war, diplomatic negotiations, and the establishment of Race control over most of the world.\n\n    * Worldwar Tetralogy\n          o In the Balance (1994)\n          o Tilting the Balance (1995)\n          o Upsetting the Balance (1996)\n          o Striking the Balance (1996)\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Tosev_timeline&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Tosev_timeline&lt;/a&gt;\n\n\nGeneral Information\n===================\n Title:                  -In The Balance\n Author:                 Harry Turtledove\n Copyright:              1994\n Audiobook Copyright:    1994\n Genre:                  Audiobook\n Series Name:            Worldwar\n Position in Series:     1\n\nOriginal Media Information\n==========================\n Source:                 Rapid.org\n Condition:              Good\n\nFile Information\n================\n Number of MP3s:         17\n Total Duration:         24:25:13\n Total MP3 Size:         670.84\n Parity Archive:         Yes\n Ripped By:              Unknown\n Encoded At:             CBR 64 kbit/s 24000 Hz Joint Stereo\n ID3 Tags:               Set, v1.1, v2.3\n\nBook Description\n================\nThis intelligent speculative novel depicts an alternate history in which, at the height of World War II, Earth is attacked by alien beings with weapons far more destructive than any possessed by the Allied or Axis forces. Turtledove ( The Guns of the South ) gives a surprisingly convincing flavor to the time-worn story of warring nations uniting to repel extraterrestrials; his human characters, both actual and invented, ring true as they struggle to trust each other after years of enmity, and although the alien threat has a B-movie feel, he makes an effort to portray the invaders sympathetically as well. The first in a projected series, the book ends where it began: in and around a battle. The smooth writing is marred only by slightly overdone dialogue for real-life figures like General Patton. The historical details, especially those concerning the weapons and methods available in the 1940s to defend Earth, are accurate and well rendered.\n\nPoster's Note:\n\nThese audiobooks were posted to the group one or two years ago, but \nwere 32kb Cassette rips. The files I am posting have superior audio \nquality, so you may wish to add them to your collection.\n\n","torrent":{"xt":"urn:btih:0ee9dca3a62e44b74e5f8fd1bd927102fd14c15d","amp;dn":"Harry+Turtledove+-+WorldWar+Series+Complete+-+Alternative+WWII+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ee9dca3a62e44b74e5f8fd1bd927102fd14c15d","infoHashBuffer":{"type":"Buffer","data":[14,233,220,163,166,46,68,183,78,95,143,209,189,146,113,2,253,20,193,93]},"announce":[],"urlList":[]}}