{"title":"House.Of.Flying.Daggers.2004","uid":4330080,"size":1469789816,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0ef823b0763b1cccbe1054363ddfee986424b3db&amp;dn=House.Of.Flying.Daggers.2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zydebr","files":4,"time":1217993719,"description":"The film is set in 859 AD. The once great Tang Dynasty is now in decline. Numerous rebel groups have formed, the largest of which is the House of Flying Daggers, based in Feng Tian county. The Flying Daggers steal from the rich and give to the poor, gaining the support of the locals.\n\nThe local deputies have managed to kill the leader of the Flying Daggers, but the rebel group only becomes stronger, due to a mysterious new leader. Jin and Leo, two police captains, are ordered to kill the new leader within ten days.\n\nIn order to accomplish this, they arrest Mei (XiÃ‡Å½o MÃƒÂ¨i), a blind dancer who is suspected of being the daughter of the old leader. While Mei is incarcerated, Jin and Leo decide to let her go to track the mastermind; Jin will pretend to be a lone warrior called Wind, and break her out of prison. This will gain her trust, and hopefully, Jin will be led to the headquarters of Flying Daggers. The plan works, but Mei and Jin fall in love on the way. They are followed at a distance by Leo; Jin and Leo meet secretly to discuss their plans. Jin jokes about his seduction of the girl; Leo warns him sternly against getting involved.\n\nTo add authenticity to the deception, Leo and his men ambush the pair: the fight is, however, a fake. Further on, they are attacked again, but this time their assailants are apparently for real: Jin and Mei battle for their lives, being saved only by the intervention of an unseen knife-thrower. Furious, Jin confronts Leo: Leo explains that he has reported the matter up the chain of command and his general has taken over the pursuit. Jin realizes that he is now expendable.\n\nOnce again, Jin and Mei are attacked by the General&amp;#039;s men. They are hopelessly outnumbered; at the last minute they are saved when the House of Flying Daggers reveal themselves. Jin and Leo are captured and taken to their headquarters.\n\nAt this point, a number of surprising revelations are made. Mei is not blind, nor is she the old leader&amp;#039;s daughter - she was merely pretending to be. Leo is in fact an undercover agent for the House of Flying Daggers, who have engineered the whole chain of events in order to draw the General into a decisive battle. Furthermore, Leo is in love with Mei: he has waited for three years for her whilst working undercover.\n\nMei, however, cannot bring herself to love Leo: over the last few days she has fallen for Jin. But as Jin is now a liability, she is ordered by Nia, the leader of the House of Flying Daggers, to kill him. Instead Mei takes him away then frees him: Jin begs Mei to flee with him, but she is torn between her love and her duty to the House, as well as guilt over Leo; Jin leaves alone.\n\nIn the final tragic scenes, Mei decides to ride after Jin, but is ambushed by Leo who is embittered by her rejection and consumed by jealousy for Jin. Leo throws daggers at her. Mei, not realizing that the daggers were doubled only managed to ward off one knife, while the other strikes her in the chest. As Mei lies dying, Jin returns to find Leo, and an epic battle of honor begins. The last scene sees Mei, regaining consciousness, grabbing the dagger in her chest and threatening to pull it out and to throw it in order to kill Leo if Leo kills Jin with his throwing dagger (this would kill Mei, as it would enable the blood to flow and cause her to bleed to death). Jin begs her not to do it, willing to die rather than let her be killed, but she continues to threaten to sacrifice her own life for Jin. Infuriated, Leo throws his arm out as if to throw a knife at Jin, and Mei rips the dagger out of her own heart to deflect it; she opted to try to deflect Leo&amp;#039;s attack and save Jin rather than throw it at Leo and kill him in revenge. However, all her dagger does is deflect a droplet of blood, as Leo never threw his dagger. The implication is that if she is willing to die for Jin, Leo, despite his feelings for her, would rather she died. Removing the dagger from her chest causes Mei&amp;#039;s death, and surmises her death as seemingly futile. Yet, the smile before her collapse signifies her knowledge that Leo will ultimately spare Jin&amp;#039;s life on account of her sacrifice. In the final scene, Leo walks off into the blizzard as Jin holds Mei&amp;#039;s lifeless body, singing the song originally sung by Mei at the beginning of the film in the Peony Pavilion.","torrent":{"xt":"urn:btih:0ef823b0763b1cccbe1054363ddfee986424b3db","amp;dn":"House.Of.Flying.Daggers.2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ef823b0763b1cccbe1054363ddfee986424b3db","infoHashBuffer":{"type":"Buffer","data":[14,248,35,176,118,59,28,204,190,16,84,54,61,223,238,152,100,36,179,219]},"announce":[],"urlList":[]}}