{"title":"Brian Auger's Oblivion Express - Second Wind","uid":3601500,"size":92857856,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0f4c7b8dcf77657e3adcec9379927bca8a2b890a&amp;dn=Brian+Auger%5C%27s+Oblivion+Express+-+Second+Wind&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"banzaidog","files":7,"time":1169488764,"description":"Second Wind was the band&amp;#039;s third outing overall, and the first with its new singer. In typical fashion, Brian Auger upped the creative ante once again. Whereas the previous two albums -- the self-titled debut, and A Better Land -- had showcased, respectively, the mirroring jazz and pop sides of the band, Second Wind combines them regally. \n\nWith Auger being free to arrange and play, his composing skills went through the roof. In addition, Ligertwood added to the compositional depth of the band, as evidenced by his fine work, &quot;Truth,&quot; which opens the album with its riff-oriented jazz undercoat and rockist sheen.\n\nLigertwood is an excellent rock vocalist, with his reedy middle-range voice and strained falsetto, he wrings the passion from his lyrics. Auger, here on B3, particularly, and on piano to a lesser degree, is simply dazzling on every track. The funky, jazzy grooves on this set are indicative of the direction Auger would mine on all of his future recordings (a fine example of their early fruit is on the driven, deep funk and roll of &quot;Somebody Help Us.&quot;) \n\nThe centerpiece of the album is the Eddie Harris, Auger, and Ligertwood composition, &quot;Freedom Jazz Dance,&quot; covered by everyone from War to the Beastie Boys. Simply put, this track is the pure embodiment of &quot;groove jazz.&quot; With its shimmering opening of elongated chords against a tight, rhythmic shuffle, it leaves room for solos, turnabout melodic improvisations, and a melody that is as serpentine as it is infectious. Second Wind is chunky grooves, wondrously complex instrumental interludes, and inspiring performances, all adding up to a solid, adventurous chapter in Oblivion Express&amp;#039; history.\n","torrent":{"xt":"urn:btih:0f4c7b8dcf77657e3adcec9379927bca8a2b890a","amp;dn":"Brian+Auger%5C%27s+Oblivion+Express+-+Second+Wind","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f4c7b8dcf77657e3adcec9379927bca8a2b890a","infoHashBuffer":{"type":"Buffer","data":[15,76,123,141,207,119,101,126,58,220,236,147,121,146,123,202,138,43,137,10]},"announce":[],"urlList":[]}}