{"title":"Lucky by Alice Sebold [epub, mobi]","uid":11280988,"size":734996,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0fb183c365a538f634efa95a4cde27625c2a3c54&amp;dn=Lucky+by+Alice+Sebold+%5Bepub%2C+mobi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":4,"time":1414214021,"description":"Lucky by Alice Sebold, in epub and mobi formats.\n\n\n\nsummary:  Enormously visceral, emotionally gripping, and imbued with the belief that justice is possible even after the most horrific of crimes, Alice Sebold's compelling memoir of her rape at the age of eighteen is a story that takes hold of you and won't let go.\n\n\nSebold fulfills a promise that she made to herself in the very tunnel where she was raped: someday she would write a book about her experience. With Lucky she delivers on that promise with mordant wit and an eye for life's absurdities, as she describes what she was like both as a young girl before the rape and how that rape changed but did not sink the woman she later became.\nIt is Alice's indomitable spirit that we come to know in these pages. The same young woman who sets her sights on becoming an Ethel Merman-style diva one day (despite her braces, bad complexion, and extra weight) encounters what is still thought of today as the crime from which no woman can ever really recover. In an account that is at once heartrending and hilarious, we see Alice's spirit prevail as she struggles to have a normal college experience in the aftermath of this harrowing, life-changing event.\n\n\nNo less gripping is the almost unbelievable role that coincidence plays in the unfolding of Sebold's narrative. Her case, placed in the inactive file, is miraculously opened again six months later when she sees her rapist on the street. This begins the long road to what dominates these pages: the struggle for triumph and understanding -- in the courtroom and outside in the world.\nLucky is, quite simply, a real-life thriller. In its literary style and narrative tension we never lose sight of why this life story is worth reading. At the end we are left standing in the wake of devastating violence, and, like the writer, we have come to know what it means to survive","torrent":{"xt":"urn:btih:0fb183c365a538f634efa95a4cde27625c2a3c54","amp;dn":"Lucky+by+Alice+Sebold+%5Bepub%2C+mobi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fb183c365a538f634efa95a4cde27625c2a3c54","infoHashBuffer":{"type":"Buffer","data":[15,177,131,195,101,165,56,246,52,239,169,90,76,222,39,98,92,42,60,84]},"announce":[],"urlList":[]}}