{"title":"Sadie Walker is Stranded - Madeleine Roux.epub","uid":9024860,"size":534869,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0fe2d7ce86751b4d833b2833109fc2c45be9504e&amp;dn=Sadie+Walker+is+Stranded+-+Madeleine+Roux.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1381349730,"description":"MONTHS AGO THE WORLD ENDED...\n\n...when an unknown virus spread throughout North America and then the world, killing millions of people. However, that is where the horror only started. The dead began to rise and when they rose they had an insatiable appetite for the living. A new hell had been unleashed on earth and the fight for survival had just begun.\n\nSadie Walker is one of the survivors in this new world. Living in north Seattle behind barrier that keep the living in and the dead out, she trying to get back to a normal life, while raising her eight-year-old nephew, if anyone even knows what &quot;normal&quot; is anymore. Then everything goes sideways when Shane is kidnapped by a group of black market thieves and they bring down a crucial barrier in the city while trying to escape, and flood the city with the walking dead. After rescuing her nephew, Sadie and Shane escape Seattle on the last remaining boat, along with other survivors. However, now they must face the complete chaos of a world filled with flesh eating zombies and humans who are playing with a whole new rule book when it comes to survival in their journey to find a new place that they can call home.","torrent":{"xt":"urn:btih:0fe2d7ce86751b4d833b2833109fc2c45be9504e","amp;dn":"Sadie+Walker+is+Stranded+-+Madeleine+Roux.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fe2d7ce86751b4d833b2833109fc2c45be9504e","infoHashBuffer":{"type":"Buffer","data":[15,226,215,206,134,117,27,77,131,59,40,51,16,159,194,196,91,233,80,78]},"announce":[],"urlList":[]}}