{"title":"The Red Men by  Matthew De Abaitua {dwg}","uid":11038305,"size":2381465,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10728a97f6fb2cc0d76b3feb7d6459c702fca5a1&amp;dn=The+Red+Men+by++Matthew+De+Abaitua+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gratefuldawg77","files":6,"time":1410823581,"description":"Nelson used to be a radical journalist, but now he works for Monad, one of the world's leading corporations. Monad make the Dr Easys, the androids which patrol London's streets: assisting police, easing tensions, calming the populace. But Monad also makes the Red Men - tireless, intelligent, creative and entirely virtual corporate workers - and it's looking to expand the programme. So Nelson is put in charge of Redtown: a virtual city, inhabited by copies of real people going about their daily business, in which new policies, diseases and disasters can be studied in perfect simulation. Nelson finds himself at the helm of a grand project whose goals appear increasingly authoritarian and potentially catastrophic. As the boundaries between Redtown and the real world become ever more brittle, and revolutionary factions begin to align themselves against the Red Men, Nelson finds himself forced to choose sides: Monad or his family, the corporation or the community,","torrent":{"xt":"urn:btih:10728a97f6fb2cc0d76b3feb7d6459c702fca5a1","amp;dn":"The+Red+Men+by++Matthew+De+Abaitua+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10728a97f6fb2cc0d76b3feb7d6459c702fca5a1","infoHashBuffer":{"type":"Buffer","data":[16,114,138,151,246,251,44,192,215,107,63,235,125,100,89,199,2,252,165,161]},"announce":[],"urlList":[]}}