{"title":"Super Furry Animals - Dark Days Light Years(split tracks + cover","uid":4871518,"size":75270851,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:11fab6cac41ce8c63bc0be2b881ac8caf828b58c&amp;dn=Super+Furry+Animals+-+Dark+Days+Light+Years%28split+tracks+%2B+cover&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"michelinman","files":17,"time":1240863029,"description":"[img]http://images.play.com/covers/8990161x.jpg[/img]\n\n    * Alternative giants Super Furry Animals make a welcome return with their ninth studio album, Dark Days / Light Years. Returning to the psychedelic rock vibes of their early work, the Welsh experimental unit merge monolithic riffs with spluttering beats to take us on a gloriously twisted journey into their mischievous technicolor minds.\n\n      The fact that they have been keeping themselves busy with various side projects, including Dafydd Leuan and Guto Pryce's acclaimed work with The Peth, and Gruff Rhys' Mercury nominated Neon Neon, has meant that Super Furry Animals haven't released an album since 2007's Hey Venus! Dark Days / Light Years though has finally landed and, with many tracks originally surfacing during the Hey Venus! sessions, stands to be a natural continuation. The album begins in true psychedelic form with 'Crazy Naked Girls'. Combining electronic twangs with flagrant dark humour, the track is a vast and pounding introduction to this speaker-blowing record. Immediately there is a notable inclusion of techniques from previous releases. As the short, sharp rock numbers 'Inconvenience' and 'Mountain' sparkle with the same glam-pop edge of their catchy top 20 single 'Golden Retriever', the iridescent 'Prijk', with its watertight bassline and tantalising techno beats, impacts with the catchiness of the renowned hit '(Drawing) Rings Around The World'. When the tempo drops, the album shines with some tender moments. With a circular guitar motif and dreamy vocals, 'Cardiff In The Sun' tantalises with romanticism and creates a surrounding soundscape that is alluringly epic and wonderfully beautiful. Whilst the cleverly executed 'White Socks / Flip Flops' shows that the band are capable of delivering beguiling power-pop, the Kraftwerk homage 'Inaugural Trams' (which features guest vocals from Franz Ferdinand's Nick McCarthy) hits with a sinister electro vibe. Such a hugely unconventional piece would seem out of place on any other album, but with the breathtaking eclecticism of the band and their songs, it is merely another great track on a wonderfully enchanting Super Furry Animals' record.\n\n      When a band reaches their ninth album, the temptation is always going to be there to live off previous successes and deliver a safe and unchallenging record. Luckily, Super Furry Animals are no ordinary band, and Dark Days / Light Years has proven to be no ordinary record. Benefiting from a desire to challenge musical convention, the prog-rock eccentrics have presented an exciting and intoxicating album that is one of their finest to date.\n\nTrack List\t\n\n \n\n   1. Crazy Naked Girls\n   2. Mt\n   3. Moped Eyes\n   4. Inaugural Trams\n   5. Inconvenience\n   6. Cardiff In The Sun\n   7. The Very Best Of Neil Diamond\n   8. Helium Hearts\n   9. White Socks / Flip Flops\n  10. Where Do You Wanna Go?\n  11. Lliwiau Llachar\n  12. Prijk\n\n[IMG]http://i78.photobucket.com/albums/j81/wrcfoucs/watching3vemq8.gif[/IMG]\n\n\n[img]http://i121.photobucket.com/albums/o219/uuffoo/vghlr7.png[/img]","torrent":{"xt":"urn:btih:11fab6cac41ce8c63bc0be2b881ac8caf828b58c","amp;dn":"Super+Furry+Animals+-+Dark+Days+Light+Years%28split+tracks+%2B+cover","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11fab6cac41ce8c63bc0be2b881ac8caf828b58c","infoHashBuffer":{"type":"Buffer","data":[17,250,182,202,196,28,232,198,59,192,190,43,136,26,200,202,248,40,181,140]},"announce":[],"urlList":[]}}