{"title":"Face Detection and Recognition - Asit Kumar Datta","uid":13133152,"size":10955405,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12bae5a92bbfc5824a56b2482cf9621e0c40e82d&amp;dn=Face+Detection+and+Recognition+-+Asit+Kumar+Datta&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1451866352,"description":"\nFeatures\r\n\r\n    Explains the theory and practice of face detection and recognition systems currently in vogue\r\n    Offers a general review of the available face detection and recognition methods, as well as an indication of future research using cognitive neurophysiology\r\n    Provides a single source for cutting-edge information on the major approaches, algorithms, and technologies used in automated face detection and recognition\r\n\r\nSummary\r\n\r\nFace detection and recognition are the nonintrusive biometrics of choice in many security applications. Examples of their use include border control, driver’s license issuance, law enforcement investigations, and physical access control.\r\n\r\nFace Detection and Recognition: Theory and Practice elaborates on and explains the theory and practice of face detection and recognition systems currently in vogue. The book begins with an introduction to the state of the art, offering a general review of the available methods and an indication of future research using cognitive neurophysiology. The text then:\r\n\r\n    Explores subspace methods for dimensionality reduction in face image processing, statistical methods applied to face detection, and intelligent face detection methods dominated by the use of artificial neural networks\r\n    Covers face detection with colour and infrared face images, face detection in real time, face detection and recognition using set estimation theory, face recognition using evolutionary algorithms, and face recognition in frequency domain\r\n    Discusses methods for the localization of face landmarks helpful in face recognition, methods of generating synthetic face images using set estimation theory, and databases of face images available for testing and training systems\r\n    Features pictorial descriptions of every algorithm as well as downloadable source code (in MATLAB®/PYTHON) and hardware implementation strategies with code examples\r\n    Demonstrates how frequency domain correlation techniques can be used supplying exhaustive test results\r\n\r\nFace Detection and Recognition: Theory and Practice provides students, researchers, and practitioners with a single source for cutting-edge information on the major approaches, algorithms, and technologies used in automated face detection and recognition","torrent":{"xt":"urn:btih:12bae5a92bbfc5824a56b2482cf9621e0c40e82d","amp;dn":"Face+Detection+and+Recognition+-+Asit+Kumar+Datta","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12bae5a92bbfc5824a56b2482cf9621e0c40e82d","infoHashBuffer":{"type":"Buffer","data":[18,186,229,169,43,191,197,130,74,86,178,72,44,249,98,30,12,64,232,45]},"announce":[],"urlList":[]}}