{"title":"Resonate: Present Visual Stories that Transform Audiences","uid":12860001,"size":24887868,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1375f1f53a40cbd3ea12f691908dc0503537b0b9&amp;dn=Resonate%3A+Present+Visual+Stories+that+Transform+Audiences&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"acer47x","files":3,"time":1448726515,"description":"Presentations are meant to inform, inspire, and persuade audiences. So why then do so many audiences leave feeling like they've wasted their time? All too often, presentations don't resonate with the audience and move them to transformative action.\r\n\r\nJust as the author's first book helped presenters become visual communicators, Resonate helps you make a strong connection with your audience and lead them to purposeful action. The author's approach is simple: building a presentation today is a bit like writing a documentary. Using this approach, you'll convey your content with passion, persuasion, and impact.\r\n\r\nAuthor has a proven track record, including having created the slides in Al Gore's Oscar-winning An Inconvenient Truth\r\nFocuses on content development methodologies that are not only fundamental but will move people to action\r\nUpends the usual paradigm by making the audience the hero and the presenter the mentor\r\nShows how to use story techniques of conflict and resolution\r\nPresentations don't have to be boring ordeals. You can make them fun, exciting, and full of meaning. Leave your audiences energized and ready to take action with Resonate","torrent":{"xt":"urn:btih:1375f1f53a40cbd3ea12f691908dc0503537b0b9","amp;dn":"Resonate%3A+Present+Visual+Stories+that+Transform+Audiences","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1375f1f53a40cbd3ea12f691908dc0503537b0b9","infoHashBuffer":{"type":"Buffer","data":[19,117,241,245,58,64,203,211,234,18,246,145,144,141,192,80,53,55,176,185]},"announce":[],"urlList":[]}}