{"title":"EnigmaT Set Rips { Cuts } - October 29th, 2013","uid":9119843,"size":960291184,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:14c96cbce6d78f450044e714e98c8956cf8d609a&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+29th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":107,"time":1383105320,"description":"Above &amp; Beyond - Anjunabeach (Genix &amp; Las Salinas Remix) (-LivE- ABGT 050 Rip)-enTc.mp3\nAbove &amp; Beyond - ID -October 2013- (-LivE- ABGT 050 Rip)-enTc.mp3\nAbove &amp; Beyond - Mariana (-LivE- ABGT 050 Rip)-enTc.mp3\nAbove &amp; Beyond - Sticky Fingers  (-LivE- ABGT 050 Rip)-enTc.mp3\nAbove &amp; Beyond feat. Alex Vargas - Sun &amp; Moon (Acoustic) (-LivE- ABGT 050 Rip)-enTc.mp3\nAbove &amp; Beyond feat. Richard Bedford - Alone Tonight (ID Remix) (-LivE- -Short-  ABGT 050 Rip)-enTc.mp3\nAdam Szabo &amp; Johan Vilborg feat. Johnny Norberg - Two To One (Cut From Tritonal Set)-enTc.mp3\nAeden - Elements (TrancEye Remix) (Cut From Space Garden Set)-enTc.mp3\nAly &amp; Fila feat. Susana - Without You (Woody van Eyden Remix) (Cut From A&amp;F Set)-enTc.mp3\nAndrew Bayer - Bullet Catch (-LivE- ABGT 050 Rip)-enTc.mp3\nAndrew Bayer - ID -October 2013- (-LivE- ABGT 050 Rip)-enTc.mp3\nAndrew Bayer - The District (-LivE- ABGT 050 Rip)-enTc.mp3\nAndrew Bayer vs. Norin &amp; Rad - Prototype (-LivE- -DaMaGeD- ABGT 050 Rip)-enTc.mp3\nAndrew Bayer vs. Norin &amp; Rad - Sa Caleta New Track (-LivE- -Short- ABGT 050 Rip)-enTc.mp3\nAndrew Bennett &amp; Paul Thomas - One Two Three (Cut From Emery Set)-enTc.mp3\nAqua &amp; Arctic - Volatility (Original Mix) (Cut From Feel Set)-enTc.mp3\nAraya - Sonar (Sunset Heat Remix) (Cut From Saux Set)-enTc.mp3\nArmin van Buuren feat. Trevor Guthrie - This Is What It Feels Like (Audien Remix) (Cut From Suspect 44 Set)-enTc.mp3\nAscania - Symbiosis (Peter Smith Remix) (Cut From Cosmic Heaven Set)-enTc.mp3\nAvail - Dominion (Truenorth Remix) (Cut 2 From Above Clouds Set)-enTc.mp3\nAvail - Dominion (Truenorth Remix) (Cut From Above Clouds Set)-enTc.mp3\nBinary Finary - 1998 (Twoloud Remix) (Cut From Bin Fin Set)-enTc.mp3\nBinary Finary vs. Iversoon &amp; Alex Daf - Dark Side (Mino Safy Remix) (Cut From Bin Fin Set)-enTc.mp3\nBlasterjaxx - Faith (Bassanova &amp; Dirty Herz Remix) (Cut From Oakenfold Set)-enTc.mp3\nBrad Ashtar - Azure (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nBrian Flinn - Dark Skies Over Kansas (Cut From Team 140 Set)-enTc.mp3\nCathy Burton - Reach Out To Me (Serdar Grey Remix) (Cut From Feel Set)-enTc.mp3\nChris Baker presents Virtue - Outer Reaches (Outer Space Remix) (Cut From Sty Set)-enTc.mp3\nDada Life - Born To Rage (USA Edit) (Cut From W&amp;W Set)-enTc.mp3\nDada Life - Rolling Stone T-Shirt (Suspect 44 Bootleg) (Cut From Suspect 44 Set)-enTc.mp3\nDaniel Meyer - Counting Days (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nDavid Surok - Out Of The Sky (Original Mix) (Cut From Sty Set)-enTc.mp3\nDelerium - Underwater (Above &amp; Beyond vs. Myon &amp; Shane54 Remix) (-LivE- ABGT 050 Rip)-enTc.mp3\nDimitri Vegas &amp; Like Mike vs DVBBS &amp; Borgeous - Stampede (Cut From W&amp;W Set)-enTc.mp3\nDon Diablo - Origins (Cut From W&amp;W Set)-enTc.mp3\nDustin Lenji - Hunter (Cut From W&amp;W Set)-enTc.mp3\nElfsong - Seldarine (Original Mix) (Cut From GO Set)-enTc.mp3\nEmanuele Congeddu - Fable Of Love (Araya Remix) (Cut From Bukovski Set)-enTc.mp3\nEssonita pres. Eleya'NeQua - Too Young (Cut From Evaa Set)-enTc.mp3\nFabio XB - Surreal (Original Mix) (Cut From GO Set)-enTc.mp3\nFelon - Isla (-LivE- ABGT 050 Rip)-enTc.mp3\nFelsic &amp; Mafic - Russia (Cut From Team 140 Set)-enTc.mp3\nGiuseppe Ottaviani feat. Vitamin B. - Waiting on Someday (OnAir Mix) (Cut From GO Set)-enTc.mp3\nHans Berg - Tucan Fever (-LivE- ABGT 050 Rip)-enTc.mp3\nHassen B - Land of Happiness (Cosmic Heaven Remix) (Cut From Cosmic Heaven Set)-enTc.mp3\nHassen B - Land Of Happiness (Cosmic Heaven Remix) (Cut From Sty Set)-enTc.mp3\nHollaphonic - Krazy (Cut From Emery Set)-enTc.mp3\nIlan Bluestone &amp; Jerome Isma-Ae - Under My Skin (Above &amp; Beyond's 80s Revival Rework) (-LivE- ABGT 050 Rip)-enTc.mp3\nIlan Bluestone - Big Ben (-LivE- ABGT 050 Rip)-enTc.mp3\nIlan Bluestone - Spheres (-LivE- ABGT 050 Rip)-enTc.mp3\nJames Woods - Penrose (Markus Hakala Remix) (Cut From Several Spirits Set)-enTc.mp3\nJimmy Chou - Luminance (Ozo Effy Remix) (Cut From Feel Set)-enTc.mp3\nJochan Dale - Miles Away (Cut From Evaa Set)-enTc.mp3\nJohan Ekman &amp; Truenorth - Eye Can (Do It) (Original Mix) (Cut 2 From Above Clouds Set)-enTc.mp3\nJohan Ekman &amp; Truenorth - Eye Can (Do It) (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nJohan Vilborg feat. Charlie Bath - Inside (Cut From Estiva Set)-enTc.mp3\nJohn Mash - Metamorphosi (Original Mix) (Cut From GO Set)-enTc.mp3\nJuventa feat. Erica Curran - Move Into Light (Koven Remix) (Cut From Estiva Set)-enTc.mp3\nKate Bush - This Woman's Work (John O'Callaghan Trance Mix) (Cut From GO Set)-enTc.mp3\nKenn Colt feat. Brenton Mattheus - Tonight (Cut From Tydi Set)-enTc.mp3\nKerry Wheeler featuring Ashton Palmer - Odyssey (Original Mix) (Cut From Feel Set)-enTc.mp3\nKyau &amp; Albert feat. Stoneface &amp; Terminal - We Own The Night (Satur8 &amp; Audiko Remix) (Cut From Feel Set)-enTc.mp3\nLeama - Requiem For A Dream (Refracture Remix) (Cut From Oakenfold Set)-enTc.mp3\nLedo - Hear My Scream (TrancEye Remix) (Cut From Space Garden Set)-enTc.mp3\nLEO - She's The One (Cut From Tritonal Set)-enTc.mp3\nLitagoria feat. Gloria - Misery (E.T Project Dub Mix) (Cut From Sty Set)-enTc.mp3\nM&amp;D Substance Feat. Justify - Don't Know Me (Original Mix) (Cut From Shah Set)-enTc.mp3\nManuel Le Saux - Precious (Darren Porter Remix) (Cut From Saux Set)-enTc.mp3\nMatt Eray - Key West (Original Mix) (Cut From Shah Set)-enTc.mp3\nMerk &amp; Kremont - Zunami (Cut From W&amp;W Set)-enTc.mp3\nMimax - Gates Of Albion (Paul Rigel Remix) (Cut From A&amp;F Set)-enTc.mp3\nMNBT - The Right Way (Original Mix) (Cut From GO Set)-enTc.mp3\nMuska - Peua (Cut From Emery Set)-enTc.mp3\nNafis - Summer Feeling (Cut From Several Spirits Set)-enTc.mp3\nNari &amp; Milani - Patriots (Cut From W&amp;W Set)-enTc.mp3\nNew Order - Blue Monday (Above &amp; Beyond Remix) (-LivE- ABGT 050 Rip)-enTc.mp3\nNorin &amp; Rad - ID -October 2013- (-LivE- ABGT 050 Rip)-enTc.mp3\nOliver Smith - Evermore (-LivE- ABGT 050 Rip)-enTc.mp3\nOst &amp; Meyer feat. Roman Polonsky - Hold My Hand (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nParamore - Decode (Julian van Sonck Bootleg) (Cut From Tydi Set)-enTc.mp3\nPaul Surety - Influence (Original Uplifting Mix) (Cut From Above Clouds Set)-enTc.mp3\nPlanet Perfecto - Bullet In The Gun (Kenneth Thomas &amp; The Madison Remix) (Cut From Feel Set)-enTc.mp3\nProgresia feat. Linnea Schossow - Fire Fire Fire (Ilan Bluestone Remix) (-LivE- ABGT 050 Rip)-enTc.mp3\nRambacy feat. Danny Claire - Love Is Gone (Dreamy's Broken Love Dub Mix) (Cut From S-Kape Set)-enTc.mp3\nRoggu - Firenze (Original Mix) (Cut From Feel Set)-enTc.mp3\nRuben de Ronde - For Granted (Ahmed Romel Remix) (Cut From Sied Set)-enTc.mp3\nRyogo - Alarm (Cut From Atkinson Set)-enTc.mp3\nSean Murphy &amp; Julie Harrington - Enchanted (Original Mix) (Cut From Feel Set)-enTc.mp3\nSecond Life - The Prophecy (Original Mix) (Cut From Ex-Driver Set)-enTc.mp3","torrent":{"xt":"urn:btih:14c96cbce6d78f450044e714e98c8956cf8d609a","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+29th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14c96cbce6d78f450044e714e98c8956cf8d609a","infoHashBuffer":{"type":"Buffer","data":[20,201,108,188,230,215,143,69,0,68,231,20,233,140,137,86,207,141,96,154]},"announce":[],"urlList":[]}}