{"title":"Who Was Jesus (2010)","uid":8853859,"size":1364861988,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:17475de352a9c33f4a80eef91d52da77845d9687&amp;dn=Who+Was+Jesus+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BKCritter","files":-1,"time":1377599369,"description":"Who Was Jesus? (2010)\n\nJesus.  No matter what your belief system, simply the name conjures instant recognition of the influence of one man on the course of history.  But who was Jesus?  What was his childhood like?  What was his message and mission?  Who Was Jesus? is the story of what it was like to be Jesus: to be born into tyranny and executed for preaching harmony, love and forgiveness to one's own warring people.  It's also the story of his disciples - his resolute followers - who risked death by carrying Jesus' message of salvation.\n\nThree expert guides - a historian, archaeologist and theologian - examine the evidence and paint an unprecedented contextual picture of the times in which Jesus lived.  Journey through the Holy Land as they examine the latest archaeological and historical evidence of Jesus' life from birth to adult.  Walk in the footsteps of Jesus through his life changing meeting with John the Baptist, his ministry on the shores of the Sea of Galilee, to his fateful entry into Jerusalem.\n\nWhat were the historical events and details leading up to Jesus' crucifixion?  Will these recent findings force us to redraw history?  Who Was Jesus? presents evidence that challenges us to take a closer look at the realities surrounding the greatest story ever told.\n\nDetails...\nVideo - 1.27G, 2:10:09, 720x480, H264, Matroska Video File\nAudio - 2 channel stereo, 44.1KHz, 192Kbps, 16 bit, AAC\n\nDiscovery Channel - Who Was Jesus?","torrent":{"xt":"urn:btih:17475de352a9c33f4a80eef91d52da77845d9687","amp;dn":"Who+Was+Jesus+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17475de352a9c33f4a80eef91d52da77845d9687","infoHashBuffer":{"type":"Buffer","data":[23,71,93,227,82,169,195,63,74,128,238,249,29,82,218,119,132,93,150,135]},"announce":[],"urlList":[]}}