{"title":"The Great Prank War","uid":10914401,"size":13841707,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:175ce8b8619820c73aaa605a22b88210ae46cee2&amp;dn=The+Great+Prank+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"crisqty","files":1,"time":1409292620,"description":"Help Mordecai, Rigby, Muscle Man, Skips and your other Regular Show favorites take the park back from Gene and his goons with a plethora of prank-related powers!\n\nA NEW SPIN ON REGULAR SHOW!\nWhen Gene, the manager of rival park East Pines, gets his hands on a time machine, he goes back in time so he can win the Great Prank War and take over the park. Now it's up to our heroes to take it back, but it won't be easy! The game also features awesome new Regular Show character designs and animation styles for maximum prankiness.\n\nPLAY OFFENSE AND DEFENSE!\nIn an action-packed hybrid of tower defense, you'll assault enemy towers and take them out so you can build defensive towers of your own, all while battling Gene's endless army of park rangers, animatronic bears, feral hot dogs, dancing cassette tapes, and more!\n\nUNLEASH THE PRANKS!\nChoose to play as Mordecai, Rigby, Muscle Man or Skips. Each one of them has trained in a specialized pranking art and developed unique powers to put the hurt on the bad guys. And in the Great Prank War, even the towers are prank-themed, using eggs, glue, fart cushions and other gimmicks to defend your turf. It's Regular Show at its prankiest!\n\nFOUR SEASONS OF FUN!\nThe Great Prank War is one long-running conflict, with levels that span the fall, winter, spring and summer. Each season brings different level designs packed with challenges that add up to mondo replay value, including four epic boss battles that will test your skills to the max.\n\nFight your way through the silliest battles ever in THE GREAT PRANK WAR!\n\n","torrent":{"xt":"urn:btih:175ce8b8619820c73aaa605a22b88210ae46cee2","amp;dn":"The+Great+Prank+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"175ce8b8619820c73aaa605a22b88210ae46cee2","infoHashBuffer":{"type":"Buffer","data":[23,92,232,184,97,152,32,199,58,170,96,90,34,184,130,16,174,70,206,226]},"announce":[],"urlList":[]}}