{"title":"Earth, Wind &amp; Fire - Now, Then... (2013) HDtracks 24-48-FLAC","uid":11279198,"size":592460437,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:17a924683490f7fb051befb29aa38003cdfa0421&amp;dn=Earth%2C+Wind+%26amp%3B+Fire+-+Now%2C+Then...+%282013%29+HDtracks+24-48-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"hal4000","files":-1,"time":1414194429,"description":"Earth, Wind &amp; Fire is an American band that has spanned the musical genres of R&amp;B, soul, jazz, pop, rock, funk, disco, latin, African and gospel. They are one of the most successful and critically acclaimed bands of the twentieth century. Rolling Stone has described them as &quot;innovative, precise yet sensual, calculated yet galvanizing&quot; and has also declared that the band &quot;changed the sound of black pop&quot;.\n\nDown to a core trio of Philip Bailey, Verdine White, and Ralph Johnson, EWF made their first album since 2005's Illumination with a little help from Larry Dunn and guidance from Maurice White. The Whites, Bailey, and Dunn, along with Al McKay, were inducted into the Songwriting Hall of Fame in 2010, yet Bailey co-wrote only two songs here, while Dunn contributed to one. In addition to Johnson's two co-compositions, a long list of writers was involved, with Bailey's son Philip Doron Bailey given the heaviest load beside the likes of Siedah Garrett and Lee &quot;Son of Leroy&quot; Hutson, Jr. A couple elements of certain songs excepted -- the rigid beat of &quot;Dance Floor,&quot; the hard rhythmic drive of &quot;Night of My Life&quot; -- the Earth, Wind &amp; Fire of Open Our Eyes through Faces seems to have been in the mind of each of the involved. The songs are generally enjoyable and recall that era of the band, filled with an easygoing and positive spirit with soaring vocal arrangements, Verdine's thumping bass, and those beaming horns. &quot;My Promise&quot; and &quot;Guiding Light&quot; especially rise high enough to be slotted between classics without losing listener interest. Now, Then &amp; Forever demonstrates the lasting value of the band's classic sound.\n\nHDtracks 24Bit-48Khz-FLAC","torrent":{"xt":"urn:btih:17a924683490f7fb051befb29aa38003cdfa0421","amp;dn":"Earth%2C+Wind+%26amp%3B+Fire+-+Now%2C+Then...+%282013%29+HDtracks+24-48-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17a924683490f7fb051befb29aa38003cdfa0421","infoHashBuffer":{"type":"Buffer","data":[23,169,36,104,52,144,247,251,5,27,239,178,154,163,128,3,205,250,4,33]},"announce":[],"urlList":[]}}