{"title":"Earcandy - Starzmacker - Swedish House Mafia &amp; Co [Wav] 44/2","uid":9089114,"size":661656911,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1888cdffb3fd062c0b05439ae45094afaede82ed&amp;dn=Earcandy+-+Starzmacker+-+Swedish+House+Mafia+%26amp%3B+Co+%5BWav%5D+44%2F2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DJ_SEVEN","files":-1,"time":1382555784,"description":"\nHi folks!, sharing is caring they say, and i agree, for one thing when its music, movies, games that are rare and allmost\nimpossible to get ahold of, and beeing a deejay for allmost 22 years i know how hard it can be.\n\n1. Earcandy - Starzmacker - Alesso ft. Matthew Koma - Years (Extended Version)\n2. Earcandy - Starzmacker - Cedric Gervais - Molly (Danny Howard Remix)\n3. Earcandy - Starzmacker - Inna - Endless (Cahill Club Mix)\n4. Earcandy - Starzmacker - Justin Beiber ft. Nicki Minaj - Beauty &amp; The Beat (Wideboys Remix)\n5. Earcandy - Starzmacker - Paul Van Dyk ft. Plumb - I Don't Deserve You (WAWA Extended Mix)\n6. Earcandy - Starzmacker - Rihanna - Diamonds (Bimbo Jones Vocal Remix)\n7. Earcandy - Starzmacker - Swedish House Mafia - Don't You Worry Child (feat. John Martin) [extended mix]\n\nwav 44100 24bit Wav &quot;Lossless&quot; - For the love of music!\n\nWhy havent i converted it to MP3 for faster download?\n\nAnd believe me, you dont want this superp record in lossy formats!\n\nWell no real musiclover would ever play mp3, especially when enjoying it 100%, but then again it comes down to one thing, the hardware you have\nand if youre an audiofile like me, youd spend alot on records and amps, cds, speaker and so on.\n\nIve come to the conlusion of many years of listening to different formart that sure, mp3 will you get so far, while Aiff, Wav, and Flac take you a bit further to the true source of a recording.\n\nI taken a final decision, from now on ill only upload in either flac or Wav, nothing is more important then the soundquality\n\nYou as a listner are worth it!\n\nFormat:Wav 44100 /24bit\nCountry:Europe\nReleased:2013\nGenre:Europop / House\nStyle:EM\n\nIf you want anything else, just write something on the wall, and i'll see what i can do ;D\n\nI'll seed this for a while, then its up to you if you want it to die or not!\n\nwww.hulkshare.com/StarZmacker\n\nCheers!","torrent":{"xt":"urn:btih:1888cdffb3fd062c0b05439ae45094afaede82ed","amp;dn":"Earcandy+-+Starzmacker+-+Swedish+House+Mafia+%26amp%3B+Co+%5BWav%5D+44%2F2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1888cdffb3fd062c0b05439ae45094afaede82ed","infoHashBuffer":{"type":"Buffer","data":[24,136,205,255,179,253,6,44,11,5,67,154,228,80,148,175,174,222,130,237]},"announce":[],"urlList":[]}}