{"title":"Virgin Windows XP Pro VLK with SP3 WGA","uid":4180576,"size":637497067,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:18e893db3d4ecee843c1b913c70e994b198a7f6a&amp;dn=Virgin+Windows+XP+Pro+VLK+with+SP3+WGA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mugwump770","files":2,"time":1210375998,"description":"\nThis is Original (virgin) Windows XP Pro VLK with Service Pack 3 slipstreamed.  No other changes have been made.  Service Packs 1 and\n2 were never installed,  and are no longer needed.  It works as an in-place upgrade from Windows,  or as a self-boot CD for &quot;repair&quot; or new\ninstallation.   In &quot;repair&quot; mode,  Media Player and Explorer are left as they previously exist.\n\nAfter installing XP Pro SP3 VLK,  disable any virus protection temporarily then go into the WGA directory on the CD \nand do the following...\n\n1. Open  Windows XP Keygen, to generate a genuine Serial key.   When the Program opens, under Product Famly, click the box and \nchoose &quot;WIndows XP Pro. VLK&quot;. then click the botton &quot;Generate&quot;.  A Serial will appear on the bottom. Leave the program open!\n\n2. Open the Program &quot;keyFinder&quot; which displays your Product key for any WIndows PC and Office Product. \nMake sure the &quot;Microsoft Windows&quot; tab is open. Then Click on the Options Menu, followed by &quot;change Windows Key&quot;\nIn the boxes enter the Serial key, from the Keygen Program and click &quot;Change&quot;.  Exit and re-run the program to verify the key change.\n\nIf you want to upgrade from Media Player 9 to Media Player 10,  run the program MP10setup.exe\n\nReboot and go to Windows Update and install desired updates.   \n\nThe following steps are optional,  only if you have problems with Windows Update,  OR  you need to validate Office 2003:  If you are not\nsure,  try step 4 first...\n\n3. Open the program wga-fix.  Simply click Yes, don&amp;#039;t worry about the unreadable language.\n\n4. Open the program MGADiag (Microsoft Genuine Validtaion Diagnostic Tool.)\n  Click &quot;Continue&quot;  \n  Click RESOLVE while connected to the Internet if needed.\n  Choose &quot;Office&quot; and make sure the code is 100.\n\n","torrent":{"xt":"urn:btih:18e893db3d4ecee843c1b913c70e994b198a7f6a","amp;dn":"Virgin+Windows+XP+Pro+VLK+with+SP3+WGA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18e893db3d4ecee843c1b913c70e994b198a7f6a","infoHashBuffer":{"type":"Buffer","data":[24,232,147,219,61,78,206,232,67,193,185,19,199,14,153,75,25,138,127,106]},"announce":[],"urlList":[]}}