{"title":"Shades Children by Garth Nix PDF &amp; Word Doc. (TtT)","uid":5566042,"size":1260551,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a404eb59192616e060c365829dbbffeab19acce&amp;dn=Shades+Children+by+Garth+Nix+PDF+%26+Word+Doc.+%28TtT%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TwisTtheTwiTcH","files":-1,"time":1273987512,"description":"[Updated on December 11th, 2010]\n\nTwisTtheTwiTcH is proud to deliver for your digital back up pleasure author Garth Nix's book Shade's Children, in both PDF file format and an editable Microsoft Word Document for easy and quick conversion, for other eReader formats.\n\nThe ebooks include the cover art.\n\nShade's Children           ISBN 0-06-027324-0        (Released September 1997)\n\n[Plot Background]\n&quot;Shade's Children takes place in a not-so-distant future where evil Overlords have ruled for fifteen years due to a catastrophic &quot;Change&quot; which caused all people over the age of fourteen to simply disappear. Since then, the children have been rounded up and placed in prison-like dorms. No child may live past their fourteenth birthday (known as a &quot;Sad Birthday&quot;), when they are taken to the Meat Factory and their muscles, brain, and other organs are harvested to create creatures. These creatures are servants of the Overlords, and as such both fight in the Overlords' ceremonial territorial battles and hunt for the rare escapees who have managed to remove the tracer implanted in their wrist. There is only one exception to this rule: some young women are kept for &quot;breeding&quot; to maintain the supply of children, until a suggested maximum age of eighteen.\n\nEscape is rare, based both on courage and ability. These teens are gifted, however, with &quot;Change Talents&quot; - side effects of the Change that are unique to each individual and generally fall into the category of psychic powers (psychokinesis, telepathy, precognition, etc.) These talents are also dependent on Change Radiation, a mysterious field distributed by Change Projectors. This radiation allows the Overlords to control the weather and warp certain physical laws, which is critical for some creatures such as the Wingers, which would otherwise be too heavy to fly. The strength of the field is greatly weakened by water.\n\nThese escapees have one chance to survive. Several teams of escapees recruited by Shade live in a beached submarine, near a sewer pipe that allows access to an extensive sewer system. Shade is the only &quot;adult&quot; to have survived the Change. This, however, is mitigated by the fact that he is merely the uploaded consciousness of a real human scientist - a Dr. Robert Ingman. Shade knows that he is an uploaded consciousness and thus continually questions his humanity.&quot;\n\n\n\nDid you enjoy Shade's Children? I recommend you look at some of his other writings. \n\n- The Seventh Tower [Complete Series]\nhttp://thepiratebay.se/torrent/5674722/The_Seventh_Tower_by_Garth_Nix_Complete_1-6_%28TtT%29\n\n- Keys to the Kingdom [Complete Series]\nhttp://thepiratebay.se/torrent/5674770/The_Keys_to_the_Kingdom_by_Garth_Nix_Complete_PDF_1-7_%28TtT%29\n\n-TwisTtheTwiTcH                      [Updated on December 11th, 2010]","torrent":{"xt":"urn:btih:1a404eb59192616e060c365829dbbffeab19acce","amp;dn":"Shades+Children+by+Garth+Nix+PDF+%26+Word+Doc.+%28TtT%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a404eb59192616e060c365829dbbffeab19acce","infoHashBuffer":{"type":"Buffer","data":[26,64,78,181,145,146,97,110,6,12,54,88,41,219,191,254,171,25,172,206]},"announce":[],"urlList":[]}}