{"title":"Gnomoria v0.8.43.1","uid":8615258,"size":206363862,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1c569849aefdd2dbaf49878659c8de0764ab211d&amp;dn=Gnomoria+v0.8.43.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aedziex23","files":-1,"time":1372236355,"description":"Gnomoria is a sandbox village management game where you help lead a small group of gnomes, who have set out on their own, to thrive into a bustling kingdom! Anything you see can be broken down and rebuilt elsewhere. Craft items, build structures, set traps and dig deep underground in search of precious resources to help your gnomes survive the harsh lands. Build your kingdom and stockpile wealth to attract wandering gnomads to your cause, but be wary of also attracting enemies! \n\nv0.8.43.1\nGeneral\n\n Added bandages to starting supply items\n\nFixed\n\n &quot;Any&quot; material being changed to grape when loading old saves\n\n\nv0.8.43\nGeneral\n\n Livestock now require feed\n Yaks and alpacas eat straw, while emus eat seeds\n Troughs can be crafted at a Stonemason and constructed in a Pasture to store feed\n Livestock eat from a trough if able, otherwise will leave the pasture to find food.  If no food exists they will leave the area\n New Kingdoms start with additional straw\n Increased chance of harvesting a second seed from crops\n Decreased egg production rate of emus\n Increased amount of meat produced from butchering alpacas\n Livestock require more space in pastures\n Increased livestock gestation period\n Increased time to grow fruit and wheat\n Fruit on trees now grow faster than fruit in a Farm\n Decreased the effect of quality on food and drink\n Added grapes and orange trees\n Added orange trees to world generation\n Merchants now offer grape seeds and all tree clippings\n\nFixed\n\n Incorrect value of metal bars crafted from slivers\n Auto-generated jobs for crafting bars using the metal sliver recipe\n\nLots of agriculture changes this patch.  When loading saves, livestock that are over the new pasture capacities will leave the pasture.  If your farms and pastures were just barely big enough to support your gnomes, you'll definitely want to increase their sizes after loading.  Some Kingdoms will be a little out of balance or hectic at first and if you've been thinking about starting a new Kingdom recently, now might be a good time.\n\nWhen starting out, as a benchmark, around 12 farm tiles per gnome will support you with enough left over to last Winter.  Those same farms can support livestock with the extra fruit and straw at around 10 tiles per animal.\n\nI wasn't able to get mushrooms added in this patch, so they'll be in the next one along with some new food recipes.\n\n\nXNA Framework.NET Framework are included in the _CommonRedist Folder. (Install these first.)\n\nYou can help the developer and buy the game on steam here: http://store.steampowered.com/app/224500/\n","torrent":{"xt":"urn:btih:1c569849aefdd2dbaf49878659c8de0764ab211d","amp;dn":"Gnomoria+v0.8.43.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c569849aefdd2dbaf49878659c8de0764ab211d","infoHashBuffer":{"type":"Buffer","data":[28,86,152,73,174,253,210,219,175,73,135,134,89,200,222,7,100,171,33,29]},"announce":[],"urlList":[]}}