{"title":"Dwellings - The Vernacular House Worldwide (Phaidon Art Ebook).p","uid":9849179,"size":95913897,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c6c597baf93c56e72c2541dfc0060560008f690&amp;dn=Dwellings+-+The+Vernacular+House+Worldwide+%28Phaidon+Art+Ebook%29.p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1396126633,"description":"Dwellings: The Vernacular House Worldwide by Paul Oliver\nEnglish | 2003 | ISBN: 0714842028 | 288 pages | PDF | 91 MB\n\nMore than 90 per cent of the world's buildings, including some 800 million homes, constitute architecture of ordinary people. Dwellings is about the vast range of types of vernacular houses around the world. It documents the form of traditional buildings that are self-built by their owner-occupiers or built by members of a community, recording the means of construction and decoration of the house across a spectrum of different cultures. First published by Phaidon in 1987, Dwellings - in its new updated, revised and expanded format - assimilates new scholarship in the field, including the author's own research, and traces theoretical developments in the spheres of cultural geography, gender studies, sociology and anthropology. It is not only a fascinating reference work on domestic buildings, but also a useful survey for understanding how diverse communities cope with issues of climate, migration, mass development and, in turn, how this brings to life symbolic and cultural meaning in architecture.","torrent":{"xt":"urn:btih:1c6c597baf93c56e72c2541dfc0060560008f690","amp;dn":"Dwellings+-+The+Vernacular+House+Worldwide+%28Phaidon+Art+Ebook%29.p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c6c597baf93c56e72c2541dfc0060560008f690","infoHashBuffer":{"type":"Buffer","data":[28,108,89,123,175,147,197,110,114,194,84,29,252,0,96,86,0,8,246,144]},"announce":[],"urlList":[]}}