{"title":"Na Rubu Znanosti - 2013-09-30 - Renesansa konoplje.avi","uid":8983130,"size":418533744,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1da3cab85d945e9081853ad86e8c86e41834409b&amp;dn=Na+Rubu+Znanosti+-+2013-09-30+-+Renesansa+konoplje.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"donatius","files":1,"time":1380609429,"description":"Konoplja je jedna od prvih biljaka na svijetu koju je covjek poceo koristiti i za druge potrebe, osim za prehranu, u Kini prije najmanje 10.000 godina, a u Europi prije 5500 godina. To su bila naznake potencijala koji se danas ponovno otkriva. Ako zelimo reci jednostavnu istinu jednostavnim jezikom, ona bi glasila: iskoristivost konoplje nadmasuje sva okecivanja. Proizvodi nacinjeni od kolopnje visestruko su jeftiniji od onih kojima sada raspolazemo, a proizvodnja i koristenje konoplje ima visestruki pozitivan uticaj na nas okolis. Njezin dugacki i jaki korijen moze prodrijeti i do 150 cm u dubinu pa rahli tvrda, nabijena tla za druge usjeve, ili se, zbog gustog lisca i visine, koristi na stepama kojima prijeti pretvaranje u pustinju. Konoplja je obnovljivi resurs koji se moze proizvesti. Raste brzo, otporna je na biljne bolesti, zahtijeva malo zaljevanja, uspijeva u vecini klima i obogacuje tlo. Osim kao hrana i sirovina za tkanine i papir, danas je jasno da je se moze koristiti i kao gradjevni materijal, za razne plasticne mase, gorivo... Sve sto je neophodno suvremenom svijetu, koji je nekako zaboravio na konoplju. No, konoplja danas dozivljava svoju renesansu.\n\nGosti: Jure Zubak i Zdravko Stanic\n","torrent":{"xt":"urn:btih:1da3cab85d945e9081853ad86e8c86e41834409b","amp;dn":"Na+Rubu+Znanosti+-+2013-09-30+-+Renesansa+konoplje.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1da3cab85d945e9081853ad86e8c86e41834409b","infoHashBuffer":{"type":"Buffer","data":[29,163,202,184,93,148,94,144,129,133,58,216,110,140,134,228,24,52,64,155]},"announce":[],"urlList":[]}}