{"title":"Women of the Far Right: The Mothers' Movement and World War II","uid":11698269,"size":5178809,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1dd8863dfe387c50e00011027a1b01eb1c3a09d7&amp;dn=Women+of+the+Far+Right%3A+The+Mothers%27+Movement+and+World+War+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"HowdyDooDoo","files":1,"time":1423815410,"description":"The majority of American women supported the Allied cause during World War II. and made sacrifices on the home front to benefit the war effort. But U.S. intervention was opposed by a movement led by ultraright women whose professed desire to keep their sons out of combat was mixed with militant Christianity, anticommunism, and anti-Semitism. This book is the first history of the self-styled &quot;mothers' movement,&quot; so called because among its component groups were the National Legion of Mothers of America, the Mothers of Sons Forum, and the National Blue Star Mothers.\n\nUnlike leftist antiwar movements, the mothers' movement was not pacifist; its members opposed the war on Germany because they regarded Hitler as an ally against the spread of atheistic communism. They also differed from leftist women in their endorsement of patriarchy and nationalism. God, they believed, wanted them to fight the New Deal liberalism that imperiled their values and the internationalists, communists, and Jews, whom they saw as subjugating Christian America.\n\nJeansonne examines the motivations of these women, the political and social impact of their movement, and their collaborations with men of the far right and also with mainstream isolationists such as Charles Lindbergh. Drawing on files kept by the FBI and other confidential documents, this book sheds light on the history of the war era and on women's place within the far right","torrent":{"xt":"urn:btih:1dd8863dfe387c50e00011027a1b01eb1c3a09d7","amp;dn":"Women+of+the+Far+Right%3A+The+Mothers%27+Movement+and+World+War+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dd8863dfe387c50e00011027a1b01eb1c3a09d7","infoHashBuffer":{"type":"Buffer","data":[29,216,134,61,254,56,124,80,224,0,17,2,122,27,1,235,28,58,9,215]},"announce":[],"urlList":[]}}