{"title":"Noise 2007.DVDRip.DivX . NVEE","uid":8289884,"size":1370773973,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1fc7a452f714baed01d3b75db8bf3e17c6d39024&amp;dn=Noise+2007.DVDRip.DivX+.+NVEE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":".NVEE","files":3,"time":1364028451,"description":"Plot\n\nThe film is set up amongst the landscape of two potentially related murders: that of an engaged woman in Sunshine, and that of seven passengers on a train in Melbourne's inner west. From there, the film deals primarily with the experiences of Lavinia Smart (Maia Thomas), a young woman who boarded the train shortly after the murders, and police Constable Graham McGahan (Brendan Cowell), who is afflicted with increasingly severe tinnitus. Constable McGahan mans the night shift of a police information van in the inner-western Melbourne suburb of Sunshine, where he encounters the traumatized members of the local community. Furthermore, the film explores the fear Lavinia is in after the horrific events she witnessed.\n\n\nGraham McGahan's tinnitus and his duties in the caravan can be seen as exemplifications of isolation. He is emotionally isolated by his tinnitus and physically isolated by being in the caravan. As the director and write Matthew Saville states in an interview with Margaret Pomeranz for ABC's At the Movies, the film exemplifies the Australian character, especially the isolated nature of it. Centred on the grieving community in the western suburb of Sunshine, Constable McGahan engages with the members and begins to realise his potential as a police officer and as a man. The film deals with the concept of tragedy and the response to this whilst exploring the idea of vulnerability, fear and the realisation of personal strength.\n\nPLEASE SEED !!!\n(Thank You)","torrent":{"xt":"urn:btih:1fc7a452f714baed01d3b75db8bf3e17c6d39024","amp;dn":"Noise+2007.DVDRip.DivX+.+NVEE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fc7a452f714baed01d3b75db8bf3e17c6d39024","infoHashBuffer":{"type":"Buffer","data":[31,199,164,82,247,20,186,237,1,211,183,93,184,191,62,23,198,211,144,36]},"announce":[],"urlList":[]}}