{"title":"Ian Hunter,David Bowie,Mick Ronson&amp;Queen-All The Young Dudes","uid":5473627,"size":166973444,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:209b1381e7e52c9324a2912369dd2d3b1fca4f38&amp;dn=Ian+Hunter%2CDavid+Bowie%2CMick+Ronson%26Queen-All+The+Young+Dudes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1270022200,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n\nIan Hunter feat. David Bowie, Mick Ronson &amp; Queen - All The Young Dudes (2nafish)\n\n\n\n&quot;All the Young Dudes&quot; is a song written by David Bowie, originally recorded and released as a single by Mott the Hoople in 1972. NME editors Roy Carr  and Charles Shaar Murray have described the track as &quot;one of that rare breed: rock songs which hymn the solidarity of the disaffected without distress or sentimentality&quot;. In 2004, Rolling Stone rated &quot;All the Young Dudes&quot; #253 in its list of The 500 Greatest Songs of All Time. It is also one of The Rock and Roll Hall of Fame's 500 Songs that Shaped Rock and Roll.\n\nRegarded as one of glam rock's anthems, the song originated after Bowie came into contact with Mott the Hoople's bassist Peter Watts and learned that the band was ready to split due to continued lack of commercial success. When Mott rejected his first offer of a composition, &quot;Suffragette City&quot; (from The Rise and Fall of Ziggy Stardust and the Spiders from Mars), Bowie wrote &quot;All the Young Dudes&quot; in short order specially for them, allegedly sitting cross-legged on the floor of a room in Regent Street, London, in front of the band's lead singer, Ian Hunter.\n\nWith its dirge-like music, youth suicide references and calls to an imaginary audience, the song bore similarities to Bowie's own &quot;Rock 'n' Roll Suicide&quot;, the final track from Ziggy Stardust. Described as being to glam rock what &quot;All You Need Is Love&quot; was to the hippie era, the lyrics name-checked contemporary star T.Rex and contained references to The Beatles and The Rolling Stones (&quot;My brother's back at home with his Beatles and his Stones/We never got it off on that revolution stuff&quot;) in a &quot;wearied swipe at the previous generation&quot;.\n\nBowie himself once claimed that the song was not intended to be an anthem for glam, instead it carried a darker message of apocalypse. According to an interview Bowie gave to Rolling Stone magazine in 1973, the boys are carrying the same news that the news guy was carrying in the song &quot;Five Years&quot; from Ziggy Stardust, a message that the Earth only had five years left to live: &quot;'All the Young Dudes' is a song about this news. It's no hymn to the youth, as people thought. It is completely the opposite.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:209b1381e7e52c9324a2912369dd2d3b1fca4f38","amp;dn":"Ian+Hunter%2CDavid+Bowie%2CMick+Ronson%26Queen-All+The+Young+Dudes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"209b1381e7e52c9324a2912369dd2d3b1fca4f38","infoHashBuffer":{"type":"Buffer","data":[32,155,19,129,231,229,44,147,36,162,145,35,105,221,45,59,31,202,79,56]},"announce":[],"urlList":[]}}