{"title":"Ty Templeton - Bigg Time (Restored)","uid":10221914,"size":267668993,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2108a80d3236a9e072d61ee477b2eed91fba6629&amp;dn=Ty+Templeton+-+Bigg+Time+%28Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1401054532,"description":"Bigg Time: A Farcical Fable of Fleeting Fame\n\nTy Templeton\n\nVertigo, 2002, 128 pages\n\nLester Biggs wants to become famous before turning 30, but the odds are not in his favor. He is shallow, narcissistic and not too bright. His 30th birthday is only four weeks away, and he's homeless, having lost his acting career, his agent and his fiancee all on the same day several years back. Luckily for him, a close encounter with a third rail enables him to see and communicate with a guardian angel, Stavros. Unluckily for him, Stavros has been actively sabotaging Lester's life for kicks. (Stavros, pictured as part buzzing insect, part paunchy, middle-aged man, has been a guardian angel about a thousand years too long to get attached to every &quot;breather&quot; he's responsible for helping.) Lester devises a plan to blackmail Stavros into helping him become famous, and a partnership is born. Clearly intended as broad satire, Templeton's results are as mixed as Lester's adventures are numerous. Lester is more than just unlucky; he's a lout. Even Stavros can hardly bear to put up with him. In the absence of a sympathetic character, episode reigns supreme, and Lester's path to glory is littered with aliens performing anal probes, celebrity stalkers, hair prostheses and game show sadism. As with all such scattershot approaches, the book's jokes tend to hit or miss. A much lauded cult favorite among comics aficionados in the 1980s, Templeton (Stig's World) opts for cruder, sloppier humor here. His gray and black drawings recall the bland goofiness of a Mad magazine parody, but this work only occasionally reaches a comparable level of wit. ","torrent":{"xt":"urn:btih:2108a80d3236a9e072d61ee477b2eed91fba6629","amp;dn":"Ty+Templeton+-+Bigg+Time+%28Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2108a80d3236a9e072d61ee477b2eed91fba6629","infoHashBuffer":{"type":"Buffer","data":[33,8,168,13,50,54,169,224,114,214,30,228,119,178,238,217,31,186,102,41]},"announce":[],"urlList":[]}}