{"title":"William Shakespeare - 5 - Romeo &amp; Juliet, Caedmon 1961","uid":10179683,"size":778062437,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:214948b7c7dabb948aba66152420250ddf49e72c&amp;dn=William+Shakespeare+-+5+-+Romeo+%26amp%3B+Juliet%2C+Caedmon+1961&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wordcity","files":116,"time":1400510898,"description":"\n\nO, then, I see Queen Mab hath been with you.\nShe is the fairies' midwife, and she comes\nIn shape no bigger than an agate-stone\nOn the fore-finger of an alderman,\nDrawn with a team of little atomies\nAthwart men's noses as they lie asleep;\nHer wagon-spokes made of long spiders' legs,\nThe cover of the wings of grasshoppers,\nThe traces of the smallest spider's web,\nThe collars of the moonshine's watery beams,\nHer whip of cricket's bone, the lash of film,\nHer wagoner a small grey-coated gnat,\nNot so big as a round little worm\nPrick'd from the lazy finger of a maid;\nHer chariot is an empty hazel-nut\nMade by the joiner squirrel or old grub,\nTime out o' mind the fairies' coachmakers.\nAnd in this state she gallops night by night\nThrough lovers' brains, and then they dream of love;\nO'er courtiers' knees, that dream on court'sies straight,\nO'er lawyers' fingers, who straight dream on fees,\nO'er ladies ' lips, who straight on kisses dream,\nWhich oft the angry Mab with blisters plagues,\nBecause their breaths with sweetmeats tainted are:\nSometime she gallops o'er a courtier's nose,\nAnd then dreams he of smelling out a suit;\nAnd sometime comes she with a tithe-pig's tail\nTickling a parson's nose as a' lies asleep,\nThen dreams, he of another benefice:\nSometime she driveth o'er a soldier's neck,\nAnd then dreams he of cutting foreign throats,\nOf breaches, ambuscadoes, Spanish blades,\nOf healths five-fathom deep; and then anon\nDrums in his ear, at which he starts and wakes,\nAnd being thus frighted swears a prayer or two\nAnd sleeps again. This is that very Mab\nThat plats the manes of horses in the night,\nAnd bakes the elflocks in foul sluttish hairs,\nWhich once untangled, much misfortune bodes:\nThis is the hag, when maids lie on their backs,\nThat presses them and learns them first to bear,\nMaking them women of good carriage:\nThis is she-- \n\nR&amp;J is one of the first flushes of Shakespeare's genius. To quote Spurgeon 'In Romeo and Juliet the dominating image is light, every form and manifestation of it'\n\nThis is the Caedmon recording with Albert Finney and Claire Bloom as the principals. A somewhat old fashioned romantic feel to it that no contemporary production would or could attempt. And occasionally it verges on a rather stiff Victorian dramaturgy. But both the acting and the handling of Shakespeare's verse are so good you won't mind.\n\n(Kindly seed, and if you can't find a seed for any previous poetry torrent go to the folder 'Current Poetry Torrents' and follow the instructions on the pdf.)","torrent":{"xt":"urn:btih:214948b7c7dabb948aba66152420250ddf49e72c","amp;dn":"William+Shakespeare+-+5+-+Romeo+%26amp%3B+Juliet%2C+Caedmon+1961","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"214948b7c7dabb948aba66152420250ddf49e72c","infoHashBuffer":{"type":"Buffer","data":[33,73,72,183,199,218,187,148,138,186,102,21,36,32,37,13,223,73,231,44]},"announce":[],"urlList":[]}}