{"title":"Machinarium v1.0 Android","uid":7269470,"size":8956916,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:217ad887095276cf56baacb9564bc4a974abc085&amp;dn=Machinarium+v1.0+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".BONE.","files":-1,"time":1337005936,"description":"Machinarium v1.0\nRequirements: Android 2.2+\nOverview: An award winning adventure game set in a world of robots, challenges and puzzles\n\n\nNOTE ON COMPATIBLE DEVICES: Version 1.0 is designed to give the best experience on devices such as tablets with 1024x600 or 1280x800 and higher screens. While the newest phones with larger screens and 1280x720+ resolution are capable of playing the game, some users have found some puzzles more difficult than they were designed to be due to small touch zones. We will look to improve this issue with future updates. Thank you for your support. \n\nDiscover the award-winning, steam punk world of Machinarium, navigating a clever little robot called Josef from the scrapheap into the city to save his robot girlfriend.\n\nSolve puzzles, quests, brain-rs and mini-games to rid the city of the wicked Black Cap Brotherhood robots. Gorgeous hand-drawn graphics and animations bring the robot's story to life, using unique comic bubbles and symbols to convey the plot.\n\nThe Machinarium world is populated only by robots of various forms and functions. One of the most interesting places in this world is old, rusty and legendary city of Machinarium where the game takes place.\n\nBackgrounds and characters are 2D hand-drawn represented through carefully crafted animations.\n\nAn award winning and original soundtrack compliments the game play throughout.\n\nBest Indie Game of the Year - DIY Gamer, Gamasutra,\n\nExcellence in Visual Art (Independent Games Festival)\n\n\n\n\n\nNOTE ON COMPATIBLE DEVICES: Version 1.0 is designed to give the best experience on devices such as tablets with 1024x600 or 1280x800 and higher screens. While the newest phones with larger screens and 1280x720+ resolution are capable of playing the game, some users have found some puzzles more difficult than they were designed to be due to small touch zones","torrent":{"xt":"urn:btih:217ad887095276cf56baacb9564bc4a974abc085","amp;dn":"Machinarium+v1.0+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"217ad887095276cf56baacb9564bc4a974abc085","infoHashBuffer":{"type":"Buffer","data":[33,122,216,135,9,82,118,207,86,186,172,185,86,75,196,169,116,171,192,133]},"announce":[],"urlList":[]}}