{"title":"Frank Zappa - QuAUDIOPHILIAc - DVD-A Rip","uid":3999323,"size":2494215164,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2283f60d47e557777a1f634bca7355f0c1002285&amp;dn=Frank+Zappa+-+QuAUDIOPHILIAc+-+DVD-A+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"HyperPete","files":21,"time":1201470078,"description":"                       -----------------------------------\n                       Formerly posted to Demonoid (RIP)\n                      -----------------------------------\n\nFrank Zappa - QuAUDIOPHILIAc (2004)\n\nBarking Pumpkin Records - September 14, 2004\n\nFile Size - 2.32G Sound Formats -  dts Surround &amp; Stereo (Audio w/ Still Menus) Tracker - Demonoid Ripper - Clone DVD Test Burn - Nero 7 Ultra: Recode\n\n1. &quot;Naval Aviation in Art?&quot;\n2. &quot;Lumpy Gravy&quot;\n3. &quot;Rollo&quot;\n4. &quot;Drooling Midrange Accountants on Easter Hay&quot;\n5. &quot;Wild Love&quot;\n6. &quot;Ship Ahoy&quot;\n7. &quot;Chunga Basement&quot;\n8. &quot;Venusian Time Bandits&quot;\n9. &quot;Waka/Jawaka&quot;\n10. &quot;Basement Music #2&quot;\n\nFrank Zappa: Guitar &amp; Vocals Arranger/Conductor\nAdrian Belew: Guitar\nTerry Bozzio: Drums &amp; Vocals\nMike Altschul: Bass Clarinet, Bass Flute, Piccolo, Bass Saxophone &amp; Tenor Saxophone\nNapoleon Murphy Brock: Vocals\nMax Bennett: Bass Guitar\nBilly Byers: Trombone &amp; Baritone Horn\nAlex Dmochowski: Bass Guitar\nGeorge Duke: Keyboards\nAynsley Dunbar: Drums\nRoy Estrada: Bass Guitar\nTom Fowler: Bass Guitar\nAndre Lewis: Keyboards\nEd Mann: Percussion\nSal Marquez: Trumpet &amp; Flugelhorn\nTommy Mars: Keyboards &amp; Vocals\nPatrick O&amp;#039;Hearn: Bass Guitar\nKenny Shroyer: Trombone &amp; Baritone Horn\nChester Thompson: Drums\nIan Underwood: Keyboards\n\nFrank Zappa: Producer, Engineer &amp; Mixing\nDweezil Zappa: Producer &amp; Engineer\nGail Zappa: Executive Producer &amp; Art direction\nStephen Marcussen: Mastering\nArt Kelm: Technical Support\n\nMy Notes: Music - This is one awesome showcase for Zappa&amp;#039;s techinical achievements. The songs are great, that&amp;#039;s a given but to record and mix them in quadrophic sound\nwith the calrity and presicion of these recordings represent is astounding. Especially in context of the timframe.\n\nPlayback - The stereo track should play on any computer. I use onboard sound and it plays perfectly.\n\nThe dts surround track however will only be heard on a comps with a high end sound card. You need to burn this onto a DVD and load it into a home theater system. I did\na test burn and it played just fine. Keep in mind dts is where it&amp;#039;s at. If you are a home theater enthusiast you already know what I&amp;#039;m talking about ;-) This is a very\nwarm sounding album and the dts really drives that home. Excellent channel separation and very, very clear. Decent bass but not too much puch.\n\nEnjoy!\n\nNotes from Music Tap:\n\n*****\n\nWOW!\n\nThat?s really all that can be said about this one. In fact, this release is so inspired; it will be my first 5-star review. This is essential music.\n\nQuaudiophiliac  is a compilation of recordings, some previously unreleased, that were created in  Quad  or 4-way sound.  Quadraphonic audio  never garnered the sort of\nattention that modern day 5.1 surround has but Frank Zappa, always the trailblazer, began recording in the medium as early as 1970.\n\nIt is amazing to listen to the breath and scope of these pieces, from the symphonic grandeur of  Naval Aviation In Art?  to the basement jam (literally) of  Chunga\nBasement . In the case of the latter, it was recorded in the basement of Zappa?s legendary studio, the Utility Muffin Resource Kitchen live to 4 tracks. Yes, live. Fans\nof jam bands take note; this is the real deal.\n\nIf you are a dedicated Zappa guitar freak, this album is most certainly for you as you can bathe yourself in the light of Frank?s intoxicating solos. What a thrill it\nis to hear Frank go for the throat on  Rollo  while sitting in the middle of it! In the case of  Chunga Basement , it is almost like listening in on a band rehearsal.\n Venusian Time Bandits  features outlandish lead guitar sounds that sound like they are coming from, well, Venus! Check out Zappa playing some jazzy sounding rhythm\nguitar on Waka/Jawaka before launching into an ultra hip solo.\n\nThe sound quality of this album, while coming from differing sources is remarkable. Considering that the recording dates span the years of 1970 to 1978, the overall\nconsistency of the album is notable. While Frank Zappa himself mixed the original ?quad? recording, Dweezil Zappa is to be commended for selecting, sequencing and\nmixing this material to 5.1; it is a job well done! And I must say that I wholeheartedly agree with his liner notes; the track  Rollo  IS bitchin?!\n\n I cannot praise this album enough; it truly is an example of pure genius at work. Let?s hope the Zappa Family Trust and DTS, keep pulling things out of THAT vault!\n &lt;a href=&quot;\nhttp://www.musictap.net/Reviews/ZappaFrankQuaudiophiliacDVDA.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.musictap.net/Reviews/ZappaFrankQuaudiophiliacDVDA.html&lt;/a&gt;\n\nNotes from Wikipedia:\n\nQuAUDIOPHILIAc is a compilation album featuring music by Frank Zappa, released on DVD-Audio format in 2004 by the Zappa Family Trust. It compiles recordings he made\nwhile experimenting with &quot;quadraphonic&quot;, or four-channel, sound in the 1970s. Produced by Zappa, and completed by his son, Dweezil Zappa, it is his first foray into\nsurround sound formatted music. Zappa prepared quadraphonic mixes of a number of his 1970s albums, which were left unreleased without a suitable format available on\nwhich to realize them, and QuAUDIOPHILIAc was billed as the first in a series of releases to feature this material.\n\nSeveral of the tracks present on QuAUDIOPHILIAc were previously unreleased, or were only available in edited form. The recordings date from as early as 1970, with\n&quot;Chunga&amp;#039;s Basement&quot;, a version of the title track from Chunga&amp;#039;s Revenge (1970). Also included are three tracks from the 1975 Royce Hall, UCLA concerts with the\nAbnuceals Emuukha Electric Orchestra which would become Orchestral Favorites (1979).\n\nMore Notes: http://www.jambase.com/headsup.asp?storyID=5543\n &lt;a href=&quot;\nhttp://www.zappa.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.zappa.com&lt;/a&gt;\n\n----------------------- \nEnjoy!\n&amp;#039;Ima&amp;#039; (aka Hyper_Pete)\n-----------------------","torrent":{"xt":"urn:btih:2283f60d47e557777a1f634bca7355f0c1002285","amp;dn":"Frank+Zappa+-+QuAUDIOPHILIAc+-+DVD-A+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2283f60d47e557777a1f634bca7355f0c1002285","infoHashBuffer":{"type":"Buffer","data":[34,131,246,13,71,229,87,119,122,31,99,75,202,115,85,240,193,0,34,133]},"announce":[],"urlList":[]}}