{"title":"William Shakespeare - 7 - As You Like It - Caedmon 1963","uid":10803807,"size":635062943,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22bfb887b0efec53f0618c5ec66da053cad539d0&amp;dn=William+Shakespeare+-+7+-+As+You+Like+It+-+Caedmon+1963&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"wordcity","files":148,"time":1408372066,"description":"\nNow, my co-mates and brothers in exile,Â \nHath not old customs make this life more sweetÂ \nThan that of painted pomp? Are not these woodsÂ \nMore free from peril than the envious court!Â \nHere feel we not the penalty of Adam,Â \nThe seasons difference; as the icy fangÂ \nAnd churlish chiding of the winters wind,Â \nWhich when it bites and blows upon my body,Â \nEven till I shrink with cold, I smile and sayÂ \nThis is no flattery; these are counsellorsÂ \nThat feelingly persuade me what I am.Â \nSweet are the uses of adversity;Â \nWhich, like the toad, ugly and venomous,Â \nWears yet a precious jewel in his head;Â \nAnd this our life, exempt from public haunt,Â \nFinds tongues in trees, books in the running brooks,Â \nSermons in stones, and good in everything.Â \nI would not change it.Â  \n\nCD rip of a delightful play with a delightful performance of Rosalind by Vanessa Redgrave. Bernard Shaw wrote of Rosalind that 'she is simply an extension into five acts of the most affectionate, fortunate, delightful five minutes in the life of a fortunate woman.' - she is not a character so much as the characterization of a mood, an exquisite poetic essence. Other major players in this excellent performance are Keith Michell and Max Adrian.\n\n(Kindly seed, and if you can't find a seed for any previous poetry torrent go to the folder 'Current Poetry Torrents' and follow the instructions on the pdf.)\n\n\n","torrent":{"xt":"urn:btih:22bfb887b0efec53f0618c5ec66da053cad539d0","amp;dn":"William+Shakespeare+-+7+-+As+You+Like+It+-+Caedmon+1963","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22bfb887b0efec53f0618c5ec66da053cad539d0","infoHashBuffer":{"type":"Buffer","data":[34,191,184,135,176,239,236,83,240,97,140,94,198,109,160,83,202,213,57,208]},"announce":[],"urlList":[]}}