{"title":"Paolini - Eragon","uid":4342114,"size":236022918,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:243434ff355960f13b82e5a8a04a5e503faddd90&amp;dn=Paolini+-+Eragon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mykdee","files":2,"time":1218662116,"description":"Full Audiobook\nEragon, book 1\nInheritance Cycle\n\nthis is a great book by a great author, if you like this (i am certain you will, unless you can't stand to be read to) please buy the authors material. He has worked incredibly hard!!\n\n&quot;Eldest&quot; follows Eragon in the Inheritance Cycle. I'm sure you wont want the adventure to stop at Eragon, so i recommend you buy the second volume!\n\nalso look forward to Brisingr's, the third book, release on Sept 20, 2008\n\nPLEASE SEED!! atleast allow a little upload, don't just leach ppls. \n\n\nthanks,\nmykdee\n\n\n\n\n\n\n\nAbout Christopher Paolini\n\nChristopher Paolini was born on November 17, 1983 in Southern California. He has lived most of his life in Paradise Valley, Montana with his parents and younger sister, Angela. The tall, jagged Beartooth Mountains rise on one side of Paradise Valley. Snowcapped most of the year, they inspired the fantastic scenery in Eragon. \n\nChristopher was homeschooled by his parents. As a child, he often wrote short stories and poems, made frequent trips to the library, and read widely. Some of his favorite books were Bruce Coville's Jeremy Thatcher, Dragon Hatcher, Frank Herbert's Dune, and Raymond E. Feist's Magician, as well as books by Anne McCaffrey, Jane Yolen, Brian Jacques, E.R. Eddison, David Eddings, and Ursula K. Le Guin.\n\nThe idea of Eragon began as the daydreams of a teen. Christopher's love for the magic of stories led him to craft a novel that he would enjoy reading. The project began as a hobby, a personal challenge; he never intended it to be published. All the characters in Eragon are from Christopher's imagination except Angela the herbalist, who is loosely based on his sister.\n\nChristopher was fifteen when he wrote the first draft of Eragon. He took a second year to revise the book and then gave it to his parents to read. The family decided to self-publish the book and spent a third year preparing the manuscript for publication: copyediting, proofreading, designing a cover, typesetting the manuscript, and creating marketing materials. During this time Christopher drew the map for Eragon, as well as the dragon eye for the book cover (that now appears inside the Knopf hardcover edition). The manuscript was sent to press and the first books arrived in November 2001. The Paolini family spent the next year promoting the book at libraries, bookstores, and schools in 2002 and early 2003. \n\nIn summer 2002, author Carl Hiaasen, whose stepson read a copy of the self-published book while on vacation in Montana, brought Eragon to the attention of his publisher, Alfred A. Knopf, which is part of Random House. Michelle Frey, executive editor at Knopf Books for Young Readers, contacted Christopher and his family to ask if they might be interested in having Knopf publish Eragon. The answer was yes, and after another round of editing, Knopf published Eragon in August 2003. \n\nAfter an extensive United States and United Kingdom book tour for Eragon that lasted into 2004, Christopher returned to writing his second book, Eldest, which continues the adventures of Eragon and the dragon Saphira. Eldest was published in August 2005, and was followed by Christopher's book tour throughout the United States, Canada, United Kingdom, Spain, Germany, France, and Italy. \n\nIn December 2006, Fox 2000 released their movie adaptation of Eragon in theaters around the world.\n\nChristopher is currently writing Book Three, which will be published on September 23, 2008. Early in 2007 he realized that the plot and characters demanded more space than could fit in one volume and that a fourth book would be necessary to give each story element the attention it deserved. What began as the Inheritance trilogy became the Inheritance cycle. Book Four will complete the story that Christopher envisioned years ago when he first outlined the adventure.\n\nChristopher is grateful to all his readers. He is especially heartened to hear that his books have inspired young people to read and to write stories of their own.\n\nOnce the Inheritance cycle is finished, Christopher plans to take a long vacation and ponder which of his many story ideas he will write next.\n\n\n","torrent":{"xt":"urn:btih:243434ff355960f13b82e5a8a04a5e503faddd90","amp;dn":"Paolini+-+Eragon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"243434ff355960f13b82e5a8a04a5e503faddd90","infoHashBuffer":{"type":"Buffer","data":[36,52,52,255,53,89,96,241,59,130,229,168,160,74,94,80,63,173,221,144]},"announce":[],"urlList":[]}}