{"title":"Verve Jazz Masters 09 - Astru Gilberto (1994) [Jazz][mp3 160][h3","uid":4972894,"size":60134247,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:25b7b095d8770535d13a114e71a4185fdf0f84bf&amp;dn=Verve+Jazz+Masters+09+-+Astru+Gilberto+%281994%29+%5BJazz%5D%5Bmp3+160%5D%5Bh3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":23,"time":1245861244,"description":"Verve Jazz Masters 09 - Astru Gilberto \nAudio CD March 22, 1994 \nOriginal Release Date: March 22, 1994 \nLabel: Polygram Records\nBitrate: 160 kbps \n\nThe songs on this on this album range from festive felicidad to somber and fatalistic Quiet night of Quiet Stars.  It's a good collection that showcases Gilberto's unique brazilian voice.  One major disapointment for me was the live recording of her major hit, Stan Getz's &quot;Girl from Ipanema&quot;.  There is a microphone glitch at the beginning of the song that really annoys me.  Other than that, the rest of the stuff is pretty good ~ A Customer, Amazon\n\nAs a devotee of classic rock where the major deities were The Beatles, The Rolling Stones, The Who, The Beach Boys, Dylan, The Greatful Dead, Frank Zappa, Jimi Hendrix, The Jefferson Airplane, Traffic, and Cream, Astrud Giberto sounded, to me, like 'Musak', elevator soundtrack, audio wallpaper about as distinctive as Martha Stewart Everyday products at K-Mart.  Part of my problem may be that I was never able to appreciate what set Jazz vocals apart from popular vocalist, expecially female vocalists. \n\nOne abberation in my very parochial rock tastes was that I happen to be very fond of Barbra Streisand's singing, based on her truly imaginative interpretations of some pedestrian standards, most famously the 'Happy Days are Here Again' on her first album. \n\nAnd, listening to Gilberto, when her recordings were first released, I heard none of either the militant power of Grace Slick or the great interpretations of Streisand. \n\nBut then, I listened to this album with a much more mature ear, and I hear things which I really enjoy listening to many times over.  In fact, I probably listen to this album more often than I listen to Streisand nowadays. \n\nI leave the opinions on how this album compares to other Gilberto releases to other reviewers who know her full work better, but to those who visit Jazz now and then, I recommend this selection as a worthy addition to the other names which appear in this Verve jazz masters series. ~ B. Marold\n\n\nVerve Jazz Masters 09 - Astru Gilberto Tracks:\n01  Dreamer 2:05 \n02  The Girl From Ipanema 6:35 \n03  Once Upon A Summertime 3:06 \n04  Felicidade 2:48 \n05  A Certain Sadness 3:10 \n06  Agua De Beber 2:19 \n07  Frevo 2:28 \n08  Quiet Nights Of Quiet Stars 5:38 \n09  Dindi 2:43 \n10  Look To The Rainbow 3:29 \n11  Day By Day 2:07 \n12  The Shadow Of Your Smile 2:31 \n13  Aruanda Take Me To Aruanda 2:31 \n14  The Gentle Rain 2:26 \n15  Goodbye Sadness 3:35 \n16  Berimbau 2:23","torrent":{"xt":"urn:btih:25b7b095d8770535d13a114e71a4185fdf0f84bf","amp;dn":"Verve+Jazz+Masters+09+-+Astru+Gilberto+%281994%29+%5BJazz%5D%5Bmp3+160%5D%5Bh3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25b7b095d8770535d13a114e71a4185fdf0f84bf","infoHashBuffer":{"type":"Buffer","data":[37,183,176,149,216,119,5,53,209,58,17,78,113,164,24,95,223,15,132,191]},"announce":[],"urlList":[]}}