{"title":"Megadeth 24 Bit Vinyl Pack","uid":9626463,"size":11173964708,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:266316a987a6d8fc96d33530b5148328127a0869&amp;dn=Megadeth+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"politux","files":-1,"time":1392599199,"description":"\n  Megadeth 24 Bit Vinyl Pack\n  \n  Genre: Pop/Rock\n  Styles: Heavy Metal, Speed Metal, Thrash Metal, Progressive Metal\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 2,900 - 5,600 kbps\n  Bit Depth: 24\n  Sampling Rate: 96 KHz, 192 KHz\n\n  24.96\n\n  1986 Peace Sells...But Who's Buying? Capitol Records EMI (UK)\n  1989 No More Mr. Nice Guy - SBK Records 12 SBK P 4 (US)\n  1990 Rust in Peace - Capitol C1-91935 (US) - PBTHAL\n  1990 Rust in Peace - Capitol (UK)\n  1990 Rust in Peace - Capitol Records EST 2132 Limited 180 gram \n  1990 Rust in Peace - Limited Edition 180g (US)\n  1992 Symphony of Destruction - Capitol Records 12CLS 662 (UK)\n  1992 Countdown to Extinction - Mobile Fidelity Sound Lab\n  2007 United Abominations - Road Runner Records\n  2013 Super Collider - Universal Music Group (EU)\n\n  24.192\n\n  1992 Countdown to Extinction - Capitol C1-98531 (Korea)\n  \n\n  After he left Metallica in 1983, guitarist/vocalist Dave Mustaine formed the thrash metal quartet Megadeth. Though Megadeth followed the basic blueprint of Metallica's relentless attack, Mustaine's group distinguished themselves from his earlier band by lessening the progressive rock influences, adding an emphasis on instrumental skills, speeding up the tempo slightly, and making the instrumental attack harsher. By streamlining the classic thrash metal approach and making the music more threatening, as well as making the lyrics more nihilistic, Megadeth became one of the leading bands of the genre during the mid- and late '80s. Each album they released went at least gold, and they continually sold out arenas across America, in addition to developing a strong following overseas. By the early '90s, they had toned their music down slightly, yet that simply increased their following; all of their proper '90s albums debuted in the Top Ten.\n\n  Throughout Megadeth's many lineup changes, the two core members were bassist Dave Ellefson and guitarist/vocalist Dave Mustaine (born September 13, 1961), who was the band's official leader. Mustaine grew up in the suburbs of Southern California, where he was raised by his mother in a broken home; frequently, his mother left him to be raised by aunts and uncles, who never encouraged his musical inclinations and often belittled him for his fondness for heavy metal. In 1981, he formed Metallica with James Hetfield and Lars Ulrich. Mustaine spent two years with Metallica, developing a strong cult following in California's underground metal scene, before he was kicked out of the group in 1983, allegedly over his substance abuse. Immediately following his firing, he formed Megadeth with Ellefson, Slayer guitarist Kerry King, and drummer Lee Rauch. This lineup was extremely short-lived, and Mustaine and Ellefson soon recruited guitarist Chris Poland and drummer Gar Samuelson.\n\n  For the next few years, Megadeth toured and gained a following, signing with the independent label Combat in late 1984. The following year, the group released its debut, Killing Is My Business...And Business Is Good!, which received strong reviews, not only in metal-oriented publications, but also in mainstream music magazines. The album sold very well for an independent release, which attracted the attention of major record labels. By the end of the year, the group had signed with Capitol. Megadeth's first major-label album, Peace Sells...But Who's Buying?, was released in the fall of 1986. Like its predecessor, Peace Sells was greeted by strong reviews and sales; it eventually went platinum.\n\n  Although the band's fortunes were on the upswing, Mustaine was beginning to sink deeper into drug abuse, specifically heroin. Soon, his addictions began to affect his work. Many stories concerning his erratic behavior were circulating within the metal community, and they seemed to be proven correct when he fired both Poland and Samuelson before the recording of the band's third album; they were replaced by Jeff Young and Chuck Behler, respectively. The new lineup debuted on So Far, So Good...So What!, released early in 1988. So Far, So Good peaked at number 28 on the charts and also eventually went platinum (despite less enthusiastic reviews); it also featured a notorious cover of the Sex Pistols' &quot;Anarchy in the UK&quot; with incorrect lyrics.\n\n  In the years immediately following the release of So Far, So Good...So What!, Mustaine was impaired by his drug addictions. In early 1990, he was arrested for driving under the influence and entered a rehabilitation program. By the end of the year, he was not only sober, but he had reconvened the band, firing Young and Behler and replacing them with guitarist Marty Friedman and drummer Nick Menza. This lineup recorded Megadeth's fourth and most progressive album, Rust in Peace. The record peaked at number 23 on the American charts and went platinum. Metallica broke through to the mainstream in 1991, and sensing the possibility for similar success, Mustaine followed suit in stripping down Megadeth's sound, though it remained as technically perfectionist as Rust in Peace. The result, Countdown to Extinction, was released in 1992, entering the charts at number two; the record went double platinum and became the band's biggest hit, confirming that they had retained their audience in the wake of grunge.\n\n  Now one of the most popular metal bands in the world, Megadeth moved further toward the mainstream with Youthanasia in 1994, which entered the charts at number four and, like its predecessor, went platinum. The following year, the group released Hidden Treasures, a rarities collection that featured some of the soundtrack tunes that had helped expand the group's MTV audience in the early '90s. Released in 1997, Cryptic Writings found Megadeth fully embraced by album rock radio, which formerly would never have touched the band. Ex-Suicidal Tendencies drummer Jimmy DeGrasso signed on in 1998, in time for the following year's Risk. In 2000, following the release of the best-of Capitol Punishment, Marty Friedman followed Nick Menza out the door; he was replaced by former Savatage and Alice Cooper guitarist Al Pitrelli. After signing with the BMG subsidiary Sanctuary, Megadeth debuted their new lineup on 2001's The World Needs a Hero.\n\n  While on break from touring, Mustaine suffered a serious injury in January 2002 while staying in Texas. He was diagnosed with having radial neuropathy shortly thereafter, a condition that prevented him from playing guitar. The compressed radial nerves in his left arm and hand were strained, leaving Megadeth little recourse but to disband in April 2002, after almost 20 years in the music industry. During his time off, Mustaine prepared an elaborate reissue campaign, remastering each album and reissuing them all with bonus material. This campaign set the stage for a Megadeth revival, which came in 2004-2005 with a surprising comeback album, The System Has Failed, and some heavy touring. Capitol released a new best-of, simply titled Greatest Hits, just as Megadeth hit the summer concert circuit, headlining Mustaine's own Gigantour festival. In 2007, Megadeth released the politically charged United Abominations, followed by the similarly apocalyptic Endgame in 2009. Released in 2011, Th1rt3en was the first Megadeth album since 2001's The World Needs a Hero to feature the bass playing of founding member Dave Ellefson, and was produced by Johnny K (Staind, Disturbed). Containing some of the band's darkest and heaviest material in years, it combined new songs with older ones written years ago but never recorded. In 2012, the band embarked on a tour playing its fifth album, Countdown to Extinction (now 20 years old), in its entirety. The tour resulted in the release of concert album Countdown to Extinction: Live, which arrived the following year. Super Collider, the group's 14th studio outing, was also released in 2013.","torrent":{"xt":"urn:btih:266316a987a6d8fc96d33530b5148328127a0869","amp;dn":"Megadeth+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"266316a987a6d8fc96d33530b5148328127a0869","infoHashBuffer":{"type":"Buffer","data":[38,99,22,169,135,166,216,252,150,211,53,48,181,20,131,40,18,122,8,105]},"announce":[],"urlList":[]}}