{"title":"Esparta  [Mareas De Guerra] [documental][dvdrip][spanish][","uid":5735515,"size":691650390,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:269adedadef2f0d60e983c0c4d5a3384f9c35e86&amp;dn=Esparta++%5BMareas+De+Guerra%5D+%5Bdocumental%5D%5Bdvdrip%5D%5Bspanish%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1280795801,"description":"Capitulo 2: Mareas de guerra\n\nEn Mareas de guerra, se pretende dar a conocer a los hombres que forjaron la leyenda en el paso de las TermÃƒÂ³pilas. Desde el siglo VIII hasta el siglo V a. C., los espartanos fueron conocidos por su valor y coraje como guerreros. Enfrentados permanentemente con Atenas, con la que mantuvo reiteradas y cruentas batallas, los espartanos fueron capaces de imponer un estilo de vida que ha perdurado hasta nuestros dÃƒÂ­as. Para conocer los principales logros y desaciertos de esta civilizaciÃƒÂ³n, el espacio cuenta con el testimonio de Donald Kagan, profesor de Ciencias ClÃƒÂ¡sicas e Historia en la Universidad de Yale; Stewart Flory, de la Facultad Gustavus Adolphus; Victor Hansen, profesor de Ciencias ClÃƒÂ¡sicas de la Universidad de California y Jennifer Roberts, de la Universidad de Nueva York, entre otros.\n\nA travÃƒÂ©s de sus declaraciones, conoceremos los enfrentamientos militares mÃƒÂ¡s destacados en los que se vieron implicados los espartanos, esto es, las dos guerras del Peloponeso, la invasiÃƒÂ³n de Persia, las luchas internas con los ilotas y con el resto de las ciudades-estado griegas, asÃƒÂ­ como la derrota definitiva de Esparta en Leuctra. Mareas de Guerra rescata a destacados personajes de la ÃƒÂ©poca desde Pericles a AlcibÃƒÂ­ades, asÃƒÂ­ como los modelos de Estado que preconizaban. La eterna rivalidad entre Atenas y Esparta y su impresionante maquinaria bÃƒÂ©lica, que marcaron la existencia del pueblo espartano, que conociÃƒÂ³ su mayor esplendor cuando logrÃƒÂ³ doblegar a su eterno enemigo.","torrent":{"xt":"urn:btih:269adedadef2f0d60e983c0c4d5a3384f9c35e86","amp;dn":"Esparta++%5BMareas+De+Guerra%5D+%5Bdocumental%5D%5Bdvdrip%5D%5Bspanish%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"269adedadef2f0d60e983c0c4d5a3384f9c35e86","infoHashBuffer":{"type":"Buffer","data":[38,154,222,218,222,242,240,214,14,152,60,12,77,90,51,132,249,195,94,134]},"announce":[],"urlList":[]}}