{"title":"Now What? by Ashley C. Andersen Zantop","uid":15573598,"size":5502056,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27e2e0890d6abbeea63611f21f376890250608a6&amp;dn=Now+What%3F+by+Ashley+C.+Andersen+Zantop&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"steve-kon","files":4,"time":1471294690,"description":"Title: Now What?: The Creative Writer's Guide to Success After the MFA by Ashley C. Andersen Zantop\r\n\r\nFormat: EPUB, AZW3\r\n\r\nNow What? is an effective primer crafted by a writing community on how to build your own writing community, and other fundamental elements of success as a writer.&quot; -Wally Lamb, New York Times bestselling author of The Hour I First Believed and I Know This Much Is True. &quot;Packed with practical advice. . . good information and inspiration in one convenient package&quot; -The Writer Master the fine art of success as a writer with the first multi-genre writer's guide authored and edited entirely by writers for writers. This comprehensive resource created by writers of fiction, nonfiction and poetry helps new creative writing program graduates and aspiring authors of all types survive as writers and continue pursuing their craft. The alumni, faculty and students of Fairfield University's MFA in Creative Writing program share their experiences, advice and hard-learned lessons on surviving and thriving as writers. A unique blend of practicality and inspiration, this guide features personal essays, editorials, poetry, articles, instruction, checklists, glossaries of key industry and legal terms and other resources authored by more than 40 writers who have faced the challenges and demands of finding their places and voices as authors","torrent":{"xt":"urn:btih:27e2e0890d6abbeea63611f21f376890250608a6","amp;dn":"Now+What%3F+by+Ashley+C.+Andersen+Zantop","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27e2e0890d6abbeea63611f21f376890250608a6","infoHashBuffer":{"type":"Buffer","data":[39,226,224,137,13,106,187,238,166,54,17,242,31,55,104,144,37,6,8,166]},"announce":[],"urlList":[]}}