{"title":"Obsidian","uid":7947871,"size":2910709893,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:27ec3d8c1e4d532680dd88fc34e794a6b52e71e5&amp;dn=Obsidian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"esharoth","files":-1,"time":1356185166,"description":"Title: Obsidian\nGenre: adventure / sci-fi / 1st-person\nReleased: 31st December 1996\nDeveloper: Rocket Science Games\nPublisher: SegaSoft\nDescription:\nThe year is 2066. You, as biochemical engineer Lilah Kerlin and your partner Max Powers, an environmental engineer, have created the Ceres Project, an orbiting satellite that releases nanobots into Earth's atmosphere in order to counteract air pollution and the depletion of the ozone layer. After successfully engineering and launching Ceres, the project is left to operate under its own control. With the job complete, Lilah and Max decide to go on a long overdue vacation. Danger looms when the satellite unexpectedly develops a mind of its own, then builds a strange structure near the couple's vacation campsite and lures Max into it. Hearing his scream, Lilah runs to the place and is sucked into a vortex that leads her into her own nightmare.\n\nHow to play:\n1) Mount or burn disc image OBSIDIAN.iso;\n2) Run Setup.exe and install the game (it will start automatically if you have autorun enabled);\n3) Uninstall any version of QuickTime you have on your PC, then run qt32.exe and install QuickTime 2.1.2;\n4) Play the game with the disc inserted (also read the warning below).\n\n! Warning\nI couldn't get the game to work in Windows 7, but I was able to play it using Windows XP. Before running the game, do the following:\n- open the Display Properties dialog, switch to the Settings tab and set Color quality to Medium (16 bit);\n- open the Properties dialog for the game's main executable Obsidian.exe, switch to the Compatibility tab and check Run in 640 x 480 screen resolution.","torrent":{"xt":"urn:btih:27ec3d8c1e4d532680dd88fc34e794a6b52e71e5","amp;dn":"Obsidian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27ec3d8c1e4d532680dd88fc34e794a6b52e71e5","infoHashBuffer":{"type":"Buffer","data":[39,236,61,140,30,77,83,38,128,221,136,252,52,231,148,166,181,46,113,229]},"announce":[],"urlList":[]}}