{"title":"La Bonita- MellowHype [2013 Single]","uid":7466585,"size":4702474,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:28c1087f15d4a5d0e2225e0750cf57473bb404d6&amp;dn=La+Bonita-+MellowHype+%5B2013+Single%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"adaz5","files":-1,"time":1343015305,"description":"MellowHype- La Bonita\n\n320 KB/s\n\n2013 Single\n\n\n\n\nLyrics:\n\nDamn! How'd you get your ass in those?\nI love it when she bends over, touch her calves and toes\nA few cents in my amusement park, don't abuse \nwith your loose friends never catch her with some loose pants\nI'm too in - tooting as she beep beeps\nAnd I ain't playing with physique, chick Higashi beats cheeks\nI skeet skeet a mountain, but not while she bouncin'\nOn my vertical jaw ride, dead neck, sore thighs\n\nIf your Dominican, I love hispanics\nMy Puetro Rico mama speakin' me Spanish\nThey cook me them steak tacos, side of rice and beans\nI bought it, you take the offer, give you the finer things\nIt's ridiculous, how promiscuous\nShe looks delicious put her name on my hit it list\nGet it bitch, if you ain't got no hoes dawg, \nyou should get a hitch I'll call it quits and take \nit hype across this cits hey bitch\n\nGirl why you pullin' on my shirt, you a flirt huh?\nCame through cause your man done did you dirt huh?\nAnd I fuck you good, I make you squirt uh\nJust keep talkin' that lala as I observe huh\nSomethings been wrong with me, lately, chasin' these \nladies I'm crazy full of la bonita. I freak-a-lika and he go see my\nTo kick it like a sneaker that's cheaper than that punchline\nLa bonita bitter sweet, punchline!\n\nI be rolling through, coming through, holdin' \nyou and pullin' off all of your clothes, get it three times in a row\nI be rollin 2 blunts, and smokin' you out and \nyour friends, cause they know I fuck them too, cause they hoes\nI be rolling through, coming through, holdin' \nyou and pullin' off all of your clothes, oh oh\nI be rollin 2 blunts, and smokin' you out and \nyour friends, cause they know toe to toe, whatever goes","torrent":{"xt":"urn:btih:28c1087f15d4a5d0e2225e0750cf57473bb404d6","amp;dn":"La+Bonita-+MellowHype+%5B2013+Single%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28c1087f15d4a5d0e2225e0750cf57473bb404d6","infoHashBuffer":{"type":"Buffer","data":[40,193,8,127,21,212,165,208,226,34,94,7,80,207,87,71,59,180,4,214]},"announce":[],"urlList":[]}}