{"title":"PAYDAY.2.Beta.Update.3-FTS","uid":8783451,"size":39063769,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:28e387aa1e6fd3d9428a4eb64f769bb98ee623b8&amp;dn=PAYDAY.2.Beta.Update.3-FTS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":11,"time":1375766958,"description":"YOU NEED UPDATE 1 AND 2 INSTALLED\n\n [WILL NOT RESET STATS]\n\nBack up saves prior to applying update and put them back when updating is done.\n\nInstructions:\n\n1. Extract/install to main PAYDAY 2 Beta folder (DON'T APPLY CRACK IN CRACK DIRECTORY)\n2. Extract PAYDAY.2.Beta.MP.v2 (included) to main PAYDAY 2 Beta folder\n\n--------------------------\n\nChangelog:\n\nOwners of the CCE version of the game will have pre-order items from now on, gifted players will not get these items anymore\nCharacters should no longer walk in the middle of the air close to objects\nWhile the player is in casing mode, civilians, guards and police will look at the player(s)\nTechnical fixes on levels, fixed several graph issues, characters should generally move better now\nUpdated localized text based on community feedback\nUpdated several text strings\nFixed issues related to animations depending on the FOV\nFixed other FOV related issues\nFixed a disappearing monitor in the safe house\nFixed spots where the player could get stuck\nAdded orange text on DLC items - distinguishing them from others, just like an infamous item would\nFixed an issue where bags could be thrown out of the world\nFixed a bug where the game would crash if the player would view a corpse through a camera\nFixed a bug so that team AI now properly follows the player in missions\nFixed a bug where a converted enemy would stop to follow the player who converted it\nFixed a bug in the safe house where the player could throw the bag into a place where he couldn't reach it again\nFixed an issue where police officers would be &quot;popping&quot; on top of cars\nAdded minor tweaks to level details\nReduced the drop chance of the &quot;money&quot; card during a PAYDAY\n\nQ: Does this mean that my progress in the beta will reset yet again?\nA: No, it will not reset unless something strange happens or you somehow have altered your save file.\n","torrent":{"xt":"urn:btih:28e387aa1e6fd3d9428a4eb64f769bb98ee623b8","amp;dn":"PAYDAY.2.Beta.Update.3-FTS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28e387aa1e6fd3d9428a4eb64f769bb98ee623b8","infoHashBuffer":{"type":"Buffer","data":[40,227,135,170,30,111,211,217,66,138,78,182,79,118,155,185,142,230,35,184]},"announce":[],"urlList":[]}}