{"title":"Jim Crace - Quarantine (pdf)","uid":8650594,"size":2009020,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2948c85d08b91b656fdb2378a3a7838c0c0650e7&amp;dn=Jim+Crace+-+Quarantine+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373087785,"description":"Jim Crace - Quarantine (Picador, 1998). 243 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. \n\n\ndescription:\n\nWinner of the Whitbread Novel of the Year and a Booker finalist: a controversial novel of faith and mystery about a group of desert travellers and their encounter with Jesus\n\nQuarantine is Jim Crace's imaginative and powerful retelling of Christ's fabled 40-day fast in the desert. In Crace's account, Jesus travels to a cluster of arid caves where he crosses paths with a small group of exiles who are on a pilgrimage to find redemption. One wealthy and manipulative quarantiner recognizes characteristics in Christ that he believes are divine. Evoking the strangeness and beauty of the desert landscape, Crace provocatively interprets one of our most important stories.\n\nReview\n\nThe story of Jesus's 40 days in the wilderness is surely among the most celebrated and widely diffused narratives in Western culture. Why, then, would Jim Crace choose to retell it in strictly naturalistic, non-miraculous terms? The obvious answer would be that the godless novelist is trying to debunk divinity--to take the entire New Testament down a notch. And at first, this does seem to be the case. Crace's Jesus first got religion as an adolescent, and &quot;was transformed by god like other boys his age were changed by girls.&quot; His peers view his spiritual fervor as a youthful eccentricity. Even now, as the thirtysomething Jesus heads out to the Judean desert for his 40-day retreat, he's perceived by his fellow anchorites as a flighty and impractical Galilean. They even call him &quot;Gally&quot; for short--and what sort of deity answers to a nickname?\n\nYet Crace is hardly the jeering materialist we might expect. As Jesus takes to his cliff-top cave, the author renders his religious transports without a hint of irony, and with a linguistic elegance that can hardly be called disrespectful: &quot;The prayers were in command of him. He shouted out across the valley, happy with the noise he made. The common words lost hold of sound. The consonants collapsed. He called on god to join him in the cave with all the noises that his lips could make. He called with all the voices in his throat.&quot; And while most of the temptations of Christ are visited upon him by humans--by the motley crew of his cave-dwelling neighbors--he resists them with what we can only call superhuman will. Quarantine does, of course, operate on a fairly realistic plane. Jesus dies of starvation long before his 40-day fast is complete, and his fellow retreatants, who take center stage throughout much of the novel, are much too confused and brutal ever to figure in any Sunday school pageant. Still, Crace leaves at least the possibility of resurrection intact at the end, which should ensure that his brilliant book will rattle both believers and non-believers alike.\n\nFrom Publishers Weekly\n\nThis extraordinary novel, a sometimes realistic, sometimes hallucinatory account of the 40 days Jesus spent in the wilderness, is the latest by England's Crace, a writer of great gifts (The Gift of Stones, Continent), and was reportedly the runner-up to The God of Small Things for the Booker prize. It is a remarkably successful attempt to put a story known by everyone into a convincing physical and historical context. The beauty and precision of Crace's writing, as well as his store of knowledge about such arcane matters as weaving two millennia ago and the fauna of the Judean desert, give what could have been a fey experiment an air of overwhelming authority. For a start, Jesus, portrayed as a rather callow youth befuddled by prayer, is not at the center of the canvas. That spot belongs to Musa, a stout, lecherous, bullying merchant with a beguiling tongue, whose skinny and long-suffering wife, Miri, has left him for dead in his tent as the story begins. Then, Jesus is not the only pilgrim essaying a fast in the desert. Setting about their vigils in their very different ways are Shim, a handsome, self-absorbed ascetic; Marta, a prosperous but barren woman who yearns to conceive; Aphas, an elderly Jew with cancer; and a dumb, wiry peasant. After Jesus seems to bring Musa back to life (he is obsessed with the idea of being a healer), the merchant comes to dominate the group, using his salesman's skills to convince them that he is their landlord and they owe him tribute. Only the thought of Jesus, who hides from the rest in his inaccessible cave, gives him pause. As for Jesus himself, can Musa be the devil sent to tempt him? The ways in which Crace has the six desert dwellers interrelate with each other and with Jesus are spellbinding; the book is a superbly crafted combination of historical and inspirational fiction that is genuinely unique.","torrent":{"xt":"urn:btih:2948c85d08b91b656fdb2378a3a7838c0c0650e7","amp;dn":"Jim+Crace+-+Quarantine+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2948c85d08b91b656fdb2378a3a7838c0c0650e7","infoHashBuffer":{"type":"Buffer","data":[41,72,200,93,8,185,27,101,111,219,35,120,163,167,131,140,12,6,80,231]},"announce":[],"urlList":[]}}