{"title":"Providence 1977 DVDRip Sonata Premiere","uid":7862365,"size":746842678,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:296251450a0833ef4d1162892cf813a1804eb1d2&amp;dn=Providence+1977+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":2,"time":1353965865,"description":"The first English-language film from Alain Resnais, this drama about a spiteful, alcoholic novelist contains the French director's typically playful surrealist touches and recurring use of characters shackled by memory. John Gielgud stars as Clive Langham, a drunken author in failing health who spends an increasingly intoxicated evening at his Rhode Island estate working on his new novel. Clive bases the characters in the melodramatic story on his own family, including his two sons, Claude (Dirk Bogarde) and the illegitimate Kevin (David Warner), as well as Claude's wife Sonia (Ellen Burstyn). Imagining a bitter love triangle full of spite between the three protagonists of his tale, Clive uses generous doses of imagination and symbolism, including a discordant soccer player (Denis Lawson) related to Kevin and werewolves. When his real-life family appears for a meal with Clive, however, they are not quite the embittered, devious players in the author's booze-fueled fiction. Although dividing critics between those delighted with Resnais' comic flourishes and others annoyed by his arty pretensions, Providence (1977) swept the Cesar Awards, France's Oscar equivalent, winning seven including Best Director for Resnais. ~ Karl Williams, Rovi","torrent":{"xt":"urn:btih:296251450a0833ef4d1162892cf813a1804eb1d2","amp;dn":"Providence+1977+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"296251450a0833ef4d1162892cf813a1804eb1d2","infoHashBuffer":{"type":"Buffer","data":[41,98,81,69,10,8,51,239,77,17,98,137,44,248,19,161,128,78,177,210]},"announce":[],"urlList":[]}}