{"title":"Dennis-Coming American Fascism-Crisis of Capitalism(1936)","uid":4577377,"size":592495,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ac9cbce296b874d3ea8964128d6d9e5a43bbc3d&amp;dn=Dennis-Coming+American+Fascism-Crisis+of+Capitalism%281936%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1229284839,"description":"This Lawrence Dennis's shocking book The Coming American Fascism - The Crisis of Capitalism (1936) where this enigmatic and forgotten writer offers an unique understanding of politics and economics for a world faced with the crisis of war. Lawrence Dennis (1893-1977) was one of the most insigtful men and political thinkers during the 20th century. He clearly diagnosed the economic problems of the Great Depression and announced that the &quot;old rules&quot; simply did not work any longer. He also accurately predicted that the Americans would soon adopt fascism and fascist economic policies to restore something close to full imployment. Dennis stated that the Great Depession was due to overproduction or underconsumption and clearly saw the problem of the collapse of credit expanion which began during World War I and continued through most of the 1920s. However, installment purchases and high interest rates could not be absorbed forever, and when the &quot;inflation bubble&quot; exploded, it covered a much wider number of people than any previous economic depression in U.S. history. Dennis' suggestion was that there had to be a planned economic program to prevent expansive credit. He stated that consumers could not and would not pay interest payments forever and the previous economic expansion had to be halted. He also made clear that increased savings would not necessarily lead to increased investment in a stagnent economy with high umployment. Dennis was often smeared as &quot;Nazi&quot; and Fascist when he was neither. He clearly argued against antisemitism as useless and counter productive. Although Dennis did not use the term, his politics may be thought of as populist, the unique American political tradition which offered resistance to the excesses of capitalism and the evils of communism, a nationalist and not an internationalist foreign policy, and opposition to the New World Order schemes of the elite. Populism and the thinking of Dennis may be understand as a &quot;middle way&quot; between those of socialism and unrestrained capitalism. On the eve of war, Dennis who opposed the entry of the United States into the Second World War, asks several disturbing questions about the nature of capitalism. In particular, he questions whether the current system of liberalism plus democracy can handle depression and adequately deal with the problems of underconsumption and unemployment. With the current system, it becomes necessary to get rid of excess production, either by adopting socialism or through war. With the loss of the frontier and with the current system of debt, Dennis believed that planning became a necessity. The form of planning Dennis offered as an alternative to socialism is that of fascism. Dennis devotes a good deal of space to arguing against the current debt system and the practice of usury. Dennis also points to the distinction between an absolute state as understood by liberalism and an absolute state as understood by fascism. Those who believe in liberalism fail to understand that even in the current system the power of the state is alsolute. In addition, Dennis proposes a nationalist foreign policy as opposed to an internationalist policy. Dennis strongly objected to the involvement of the United States in the Second World War and was subsequently put on trial for treason. He also offers some remarks about the formation of the fascist party, which he believed likely to come to power in America, either overtly or covertly. While the arguments presented by Dennis remain sound, his thinking came to change slightly after the subsequent entry of the United States into the war. For example, he came to recognize the role of foreign aid as a means for ridding the system of excess production by the capitalists. He also came to realize the real danger that war posed for the survival of mankind, especially in the light of the atomic bomb. His thinking remains important today as a warning to those who continue to enmesh the United States in foreign wars that have no direct bearing on national interest. While this book lies outside of the familiar Left versus Right spectrum, it provides a unique contribution to political thought, even if its prophecy must be somewhat revised in the light of modern developments. Nevertheless, its fundamental insights into the immorality of a system which results in modern war and crippling national debts remain sound. While Dennis has largely been consigned to the &quot;Orwellian Memory Hole,&quot; he deserves to be read for his insight and incredibly accurate prophetic predictions. 220 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:2ac9cbce296b874d3ea8964128d6d9e5a43bbc3d","amp;dn":"Dennis-Coming+American+Fascism-Crisis+of+Capitalism%281936%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ac9cbce296b874d3ea8964128d6d9e5a43bbc3d","infoHashBuffer":{"type":"Buffer","data":[42,201,203,206,41,107,135,77,62,168,150,65,40,214,217,229,164,59,188,61]},"announce":[],"urlList":[]}}