{"title":"CameraBag2 version 2.0.5 pre[K]racked","uid":8200539,"size":27950844,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:2b2632687dd0f566d488f1ddd0752b9a89c2fb1d&amp;dn=CameraBag2+version+2.0.5+pre%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1362004676,"description":"Â \nOfficial Web Site:  &lt;a href=&quot; http://nevercenter.com/camerabag/desktop/?section=in_depth&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://nevercenter.com/camerabag/desktop/?section=in_depth&lt;/a&gt;\n\nFreedom To Play\n\nYou don't have to know what look you want to get started. CameraBag 2 lets you see all the possibilities at once: old-school instant film or modern high-contrast portrait, subtle color adjustment or complete artistic overhaul. Choose from side-by-side comparisons with fullscreen Quicklooks, or get large, instant previews on mouseover; the emphasis is on creative exploration. Once you've chosen a filter, its components are all in the tray to tweak and adjust non-destructively with interactive sliders. The Remix slider in particular brings back the &quot;happy accidents&quot; of analog film, smoothly transitioning between infinite natural variations for each style.\n\nAdvanced Control\n\nThe new CameraBag features a full suite of photographic tools, from simple exposure and cropping to advanced vignetting, color correction, and curves. The built-in styles also have full control over their strength and variation. Since every adjustment appears as a tile in the tray, it's easy to see everything affecting the image at once, as well as rearrange tiles or edit amounts without compromising image quality. Adjustments and styles are freely layered to create new looks, which can be saved right into the interface as new filters. You can batch process a folder, or use arrow keys to browse with the current look.\n\nThe Analog Engine\n\nAt CameraBag 2's core is the brand new Analog Engine: high-fidelity, 32 bits-per-channel, non-destructive, multi-threaded image processing. In other words, it's fast and smooth. CameraBag 2 matches the power of high-priced software, yet it's light on its feet and starts up instantly. Its old-school looks are particularly high tech: recreating the natural blemishes and random variations of the analog world is one of the hardest digital challenges, and that's where we've devoted much of our research. Even the most heavily-modified photos retain smooth, film-like colors (especially with the extra color information in RAW files).\n\nKey Features\n\n* 100+ built-in styles and filters (and create and share your own!)\n\n* Full suite of 25+ photographic tools including advanced curve editors\n\n* Stunning new interface\n\n* Fast image processing via the all-new Analog Engine\n\n* Add any look to the toolset as a fully-adjustable filter\n\n* 32-bits-per-component color depth\n\n* Non-destructive editing (active history)\n\n* Easy layering of styles and adjustments.\n\n* Quicklooks and previews for visual decision-making.\n\n* Large, precise controls\n\n* Laptop- and touch-friendly design\n\n* Batch saving\n\n* The Remix slider, which smoothly transitions between endless \n  variations\n\n*  RAW format and metadata support\n\nSystem Requirements:\n\nIntel Mac, OS X.5 or later\n64 Bit CPU\nRAM minimum: 1GB\n\n--- PLEASE SEED ---\n","torrent":{"xt":"urn:btih:2b2632687dd0f566d488f1ddd0752b9a89c2fb1d","amp;dn":"CameraBag2+version+2.0.5+pre%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b2632687dd0f566d488f1ddd0752b9a89c2fb1d","infoHashBuffer":{"type":"Buffer","data":[43,38,50,104,125,208,245,102,212,136,241,221,208,117,43,154,137,194,251,29]},"announce":[],"urlList":[]}}