{"title":"EVA - (Siri for Android) v3.18","uid":9087074,"size":8941012,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:2b387de754dc0b238cfa090738d29c4db3bebfa2&amp;dn=EVA+-+%28Siri+for+Android%29+v3.18&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1382513424,"description":"\nEVA absolutely blows away Google Now, Siri and every other assistant when it comes to useful features.\n\nIt's the only assistant that has a dedicated car mode and literally over a hundred more features than the rest.\n\nBrowse through the command list and you will see that it's no lie that EVA is the leader when it comes to useful features: http://www.eva4android.com/quickstart\nEVA is a must have app if you want to use voice to increase your productivity.\n\nIt's like Siri but with so many truly useful functions you will wonder why it doesn't come standard with Android. It includes a dedicated Car Mode that is extremely useful if you want to use your phone while driving. It is the one application that makes your smart phone so much smarter. \n\nIt includes a powerful Profiles feature that allows you to change loads of settings on your phone in one instant simply by changing the Profile. There are over 30 videos on YouTube (link below) that walk you though every aspect of the application. Take advantage of the free 28 day trial as you cannot possibly try it in a few hours let alone a week. Read the reviews to see what other people are saying and if you like it please tell your family, friends and co-workers.\n\nWho should use EVA? If you are looking for an application that provides hands-free operation of your phone then EVA is right for you. If you are just looking for an electronic friend to chat with then please go with one of the Siri clones. On the other hand if you want a real virtual assistant that has extremely useful functions that will make your life easier then please give EVA a try.\n\nEVA has all the functions you'd expect your assistant to perform plus some that you probably never knew were possible. Here is a list of some of the functions that you wont find in most of the competition:\n\n- Voice messaging, emails, memos and journals using your own voice\n- Reading and replying to incoming text (including Google Voice) and email (including Microsoft Exchange)\n- Reading and replying to incoming instant messages via Google Talk\n- Integration with Google+\n- Integration with Evernote\n- Integration with Tasker\n- Home Automation with INSTEON. Turn on the lights and appliances, open the garage door and a whole lot more, all with voice commands or scheduled or based on your location.\n- Time based reminders. Remind you to do something on a day and/or time.\n- Location based reminders. Remind you to do something based on your location.\n- Location based actions. Perform any function that EVA can do based on your current location. Have EVA automatically text your wife when you leave the office.\n- Time based actions. Perform any function that EVA can do on a set day and time\n- In-Car mode including wake up phrase and fully customizable function buttons\n- Custom voice shortcuts to your phone applications. Give your apps any name you want and open them using that name.\n- Voice bookmarks to your favorite web sites. \n- Activate just by shaking your phone\n- Works with all Bluetooth Headsets and most In-Car Bluetooth devices\n- Read and write NFC tags on compatible devices\n- Remote control your phone over Google Talk\n- Too many other features to list\n\nWhat's New:\n\nVideo Channel:\nCommand List:  www.eva4android.com/quickstart\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.bulletproof.voicerec&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.bulletproof.voicerec&lt;/a&gt;\n","torrent":{"xt":"urn:btih:2b387de754dc0b238cfa090738d29c4db3bebfa2","amp;dn":"EVA+-+%28Siri+for+Android%29+v3.18","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b387de754dc0b238cfa090738d29c4db3bebfa2","infoHashBuffer":{"type":"Buffer","data":[43,56,125,231,84,220,11,35,140,250,9,7,56,210,156,77,179,190,191,162]},"announce":[],"urlList":[]}}