{"title":"PSP GTA Pack","uid":6818402,"size":2056198933,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:2b83ae2460889a31ac010854b7312a855f2f4d7b&amp;dn=PSP+GTA+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":3,"time":1321306090,"description":"GTA pack for PSP\n\nGrand Theft Auto: Chinatown Wars\n    Visit the version of Liberty City featured in Grand Theft Auto IV on PSP.\n    Explore Dukes, Broker, Bohan and Algonquin.\n    View the action from a new overhead perspective.\n    Play as Triad member Huang Lee\n\nGrand Theft Auto: Vice City Stories\n    Return to Vice City and fight through an all new storyline featuring new missions and new vehicles\n    Set in 1984, two years prior to GTA: Vice City\n    Take control of Victor Vance and work with your brother Lance to take control of the city's criminal underworld\n    Try a whole host of new vehicles, some which are new to the series like Jet Skis and some which are new to PSP, such as helicopters\n    More advanced mission structure includes new missions which require more than one task to be performed to complete.\n    New weather effects\n    Finally see what's underneath Vice City's waters and swim freely around the islands\n    Familiar radio stations but a brand new soundtrack\n    New engine populates the city with more cars, pedestrians and objects than ever before\n    Much faster load times than Liberty City Stories and better graphics to boot!\n    PSP EXCLUSIVE FEATURE: Got friends? Invite up to six of them to play wirelessly within a local area - 10 multiplayer game types included.\n    PS2 version features enhanced graphics, draw distance and framerate.\n\nGrand Theft Auto: Liberty City Stories\n    Return to Liberty City and fight through an all new storyline featuring new missions and new vehicles.\n    For the first time in Liberty City, ride motorbikes through the streets and explore different areas with this mode of transport.\n    You'll play as Toni Cipriani, who's just returned to Liberty City after a while laying low following his killing of a made man as a favour to Mafia boss Salvatore Leone.\n    Set three years prior to GTAIII, you'll begin to appriciate the city's evolution, with different businesses and buildings present this time.\n    New weather effects (like snow) take the environment past the precedents it set back in 2001.\n    For the first time in the city, change your outfit to match the situation.\n    Amazing 3D visuals and improved effects, reflection mapping and shading models make this a totally immersive handheld experience.\n    Full multiplayer mode - up to six players battle it out simultaneously.\n\nDownloaded from zamunda","torrent":{"xt":"urn:btih:2b83ae2460889a31ac010854b7312a855f2f4d7b","amp;dn":"PSP+GTA+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b83ae2460889a31ac010854b7312a855f2f4d7b","infoHashBuffer":{"type":"Buffer","data":[43,131,174,36,96,136,154,49,172,1,8,84,183,49,42,133,95,47,77,123]},"announce":[],"urlList":[]}}