{"title":"Garmin US TOPO 24K National Parks v3 - No Unlock Needed","uid":3500130,"size":982245850,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2bbaa51c1798c300ce627db1df1b3a9c48dc1e95&amp;dn=Garmin+US+TOPO+24K+National+Parks+v3+-+No+Unlock+Needed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SunyJim","files":1,"time":1151791652,"description":"All 3 disks in the TOPO 24K version 3 series are included East West and Central.\nJust unRAR and burn. AND AS ALWAYS WITH THE GARMIN STUFF I UPLOAD THERE IS NO SERIAL NEEDED!!!\nThe TOPO 24K is not a replacement for the US TOPO maps, where the US TOPO covers the entire country. The Topo 24K only covers the national parks, and some state parks, but does so in twice the detail.\n\n----------------------------------------------------------------------------------\n\nThe MapSource US TOPO 24K National Parks v3, includes extremely detailed topographic maps of U.S National Parks. These CDs are ideal for hunters, hikers, campers and outdoor enthusiasts of all kind. Plan your outing on your PC, then download maps and data to your compatible Garmin GPS to guide you on your next trek. 3 Disks are included Eastern Region, Western Region and Central Region.\n\nAs with all Garmin MapSource software, you can pre-plan daily adventures from the comfort of your own home, using the MapSource on the PC. You can then download waypoints, routes, and tracks to your compatible Garmin GPS, including units that don&amp;#039;t accept map data!\n\nThe new cartography will provide recreational backpackers, experienced and novice hikers alike, and general outdoor enthusiasts with terrific topographic detail needed for their journeys. The topographic data is comparable to the 1:24,000 scale paper maps provided by the United States Geological Survey, which is the most detailed topographic data available.\n\n? Vertical profiling allows you to see ground elevations in a 3D image\n? Digital topographic maps covering national parks, national forests, and some state parks (see list on inside flap) in the U.S., based on the 1:24,000 scale USGS maps\n? Searchable points of interest, by name or nearest\n? Park amenities include visitors centers, camping and picnic areas, wilderness campsites, ranger stations, restaurants and lodges\n? User selectable coverage by quad, including quad name for easy correlated reference\n? Object-oriented cartography?cursor movements reveal descriptions and other map data\n? Trail names\n? Routable trails\n? Summit elevations and peaks\n? Some roads &amp; hiking trails\n? Trip and waypoint management function lets you transfer waypoints, routes and tracks between your GPS and your PC**\n\n** These functions of this product work with nearly all Garmin GPS units, excluding the GPS 100 family and panel mount aviation units.","torrent":{"xt":"urn:btih:2bbaa51c1798c300ce627db1df1b3a9c48dc1e95","amp;dn":"Garmin+US+TOPO+24K+National+Parks+v3+-+No+Unlock+Needed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bbaa51c1798c300ce627db1df1b3a9c48dc1e95","infoHashBuffer":{"type":"Buffer","data":[43,186,165,28,23,152,195,0,206,98,125,177,223,27,58,156,72,220,30,149]},"announce":[],"urlList":[]}}