{"title":"Florence, A Delicate Case by David Leavitt (retail) {dwg}","uid":11044444,"size":6056342,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d5fc6828236f346571cfc7351d89424e3c7ab2d&amp;dn=Florence%2C+A+Delicate+Case+by+David+Leavitt+%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1410929866,"description":"David Leavitt brings the wonders and mysteries of Florence alive, illuminating why it is, and always has been, one of the most popular tourist destinations in the world.\n\nThe third in the critically-acclaimed Writer and the City Series-in which some of the world's finest novelists reveal the secrets of the cities they know best-Florence is a lively account of expatriate life in the 'city of the lily'. \n\nWhy has Florence always drawn so many English and American visitors? (At the turn of the century, the Anglo-American population numbered more than thirty thousand.) Why have men and women fleeing sex scandals traditionally settled here? What is it about Florence that has made it so fascinating-and so repellent-to artists and writers over the years?\n\nMoving fleetly between present and past and exploring characters both real and fictional, Leavitt's narrative limns the history of the foreign colony from its origins in the middle of the nineteenth century until its demise under Mussolini, and considers the appeal of Florence to figures as diverse as Tchaikovsky, E.M. Forster, Ronald Firbank, and Mary McCarthy. Lesser-known episodes in Florentine history-the moving of Michelangelo's David, and the construction of temporary bridges by black American soldiers in the wake of the Second World War-are contrasted with images of Florence today (its vast pizza parlors and tourist culture). Leavitt also examines the city's portrayal in such novels and films as A Room with a View, The Portrait of a Lady and Tea with Mussolini.","torrent":{"xt":"urn:btih:2d5fc6828236f346571cfc7351d89424e3c7ab2d","amp;dn":"Florence%2C+A+Delicate+Case+by+David+Leavitt+%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d5fc6828236f346571cfc7351d89424e3c7ab2d","infoHashBuffer":{"type":"Buffer","data":[45,95,198,130,130,54,243,70,87,28,252,115,81,216,148,36,227,199,171,45]},"announce":[],"urlList":[]}}