{"title":"Sexually Broken---Brutal Face Fucking Nasty Pile Driver Ash Holl","uid":7635299,"size":782806459,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:2e2970a566f91601c403b48a5da373d88942eee1&amp;dn=Sexually+Broken---Brutal+Face+Fucking+Nasty+Pile+Driver+Ash+Holl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"merzedes","files":-1,"time":1347583905,"description":"Brutal Face Fucking and a Nasty Pile Driver Sends Ash to Subspace! | Ash Hollywood | Matt Williams \n\nSeptember 10, 2012 \n \n   \nMP4 only.  \n    \n \nAsh Hollywood is back. This sexy blond is as smart as she is beautiful. An innocent midwestern girl that moved to California, we are defiantly helping in her total corruption, although to be fair, she was already pretty corrupt when she got here.\n\nThis first scene was our Meet and Greet with Ash. She starts dressed, gets severely bound, with her elbows and wrist tightly tied behind her. Then she is stripped, manhandled and face fucked. We do all the bondage on screen and the bondage morphs before your eyes.\n\nWe play our favorite skull fucking game with Ash: See how long you can go with a big cock jammed down your throat with out breathing. We play it over and over, until Ash is dazed and confused. We fuck her throat until Ash can't sit straight or even think right. After we get her all loopy and deep into subspace with the brutal skull fucking, we advance the bondage.\n\nQuickly and before your eyes Ash is bound into a strict pile driver position. This is the most humiliating and helpless position a girl can be in. Her holes are positioned directly over her face so she can see every depraved thing that happens to her close up and can do nothing to stop it. \n\nWe vibrate Ash to several devastating orgasm, then mount and fuck her hard. She has no choice but to take a catastrophic fucking that makes her cum over and over. Her screaming orgasm echo through the studio as the cock fucks her hard and deep. We love midwestern girls so much! Join Sexually Broken today. All the bondage done on screen and no phony fake porn star Dom's pretending to know what their doing. You have found the most authentic BDSM sex site in the world. \n \nScreens     &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/09_10ash/SexuallyBroken-Ash-Hollywood-Matt-Williams-Brutal-Face-Fucking-and-a-nasty-Pile-Driver-Dends-Ash-to-Subspace.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/09_10ash/SexuallyBroken-Ash-Hollywood-Matt-Williams-Brutal-Face-Fucking-and-a-nasty-Pile-Driver-Dends-Ash-to-Subspace.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n\nCheers  :-) \n\n","torrent":{"xt":"urn:btih:2e2970a566f91601c403b48a5da373d88942eee1","amp;dn":"Sexually+Broken---Brutal+Face+Fucking+Nasty+Pile+Driver+Ash+Holl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e2970a566f91601c403b48a5da373d88942eee1","infoHashBuffer":{"type":"Buffer","data":[46,41,112,165,102,249,22,1,196,3,180,138,93,163,115,216,137,66,238,225]},"announce":[],"urlList":[]}}