{"title":"Crysis 3 RiP [Eng|Multi8] v1.39(Nikk0)","uid":8816483,"size":6736117760,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2efa9c0a73d0af50b211cef3acbd37bf0c9da914&amp;dn=Crysis+3+RiP+%5BEng%7CMulti8%5D+v1.39%28Nikk0%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nikkk0","files":2,"time":1376598536,"description":"[img]http://s001.youpic.su/pictures/1375128000/1495036f47a1713921d87bc5943f94e4.jpg[/img]\n\n\n\nThe hunted becomes the hunter in the CryEngine-powered open-world shooter Crysis 3! Players take on the role of 'Prophet' as he returns to New York in the year in 2047, only to discover that the city has been encased in a Nanodome created by the corrupt Cell Corporation. The New York City Liberty Dome is a veritable urban rainforest teeming with overgrown trees, dense swamplands and raging rivers. Within the Liberty Dome, seven distinct and treacherous environments become known as the Seven Wonders. This dangerous new world demands advanced weapons and tactics. Prophet will utilize a lethal composite bow, an enhanced Nanosuit and devastating alien tech to become the deadliest hunter on the planet. \n\nProphet is on a revenge mission after uncovering the truth behind Cell Corporation's motives for building the quarantined Nanodomes. The citizens were told that the giant citywide structures were resurrected to protect the population and to cleanse these metropolises of the remnants of Ceph forces. In reality, the Nanodomes are CELL's covert attempt at a land and technology grab in their quest for global domination. With Alien Ceph lurking around every corner and human enemies on the attack, nobody is safe in the path of vengeance. Everyone is a target in Prophet's quest for retribution. .\n\n\nRipped- Multiplayer Level files, Non-English language files \nSize 6.27 GB \nSize after install ~19.5GB \n","torrent":{"xt":"urn:btih:2efa9c0a73d0af50b211cef3acbd37bf0c9da914","amp;dn":"Crysis+3+RiP+%5BEng%7CMulti8%5D+v1.39%28Nikk0%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2efa9c0a73d0af50b211cef3acbd37bf0c9da914","infoHashBuffer":{"type":"Buffer","data":[46,250,156,10,115,208,175,80,178,17,206,243,172,189,55,191,12,157,169,20]},"announce":[],"urlList":[]}}