{"title":"K.Reichs -Kosci Zaginionych [PL]","uid":12734558,"size":688737312,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2f8802d9e5699fc3e54af2ca719aed1ae4457698&amp;dn=K.Reichs+-Kosci+Zaginionych+%5BPL%5D+MP3%40128&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"everdarksoul","files":45,"time":1447161414,"description":"Audiobook PL - 43 części /   \r\nrozmiar: 656 MB / czas: 11:55:26\r\nczyta: Marta Grzywacz\r\n\r\nSzesnasta już powieść z cyklu KOŚCI, autorstwa Kathy Reichs, którego główną bohaterką jest Temperance Brennan - antropolog kliniczna i sądowa. Tym razem na Tempe wpada na trop międzynarodowego gangu handlarzy ludźmi.\r\n\r\nZarys fabuły:\r\nNa poboczu dwupasmówki w Charlotte, policja znajduje ciało latynoskiej nastolatki. Temperance przypuszcza, że nie zginęła w wypadku samochodowym, lecz padła ofiarą przestępstwa. Strój, makijaż i zawartość torebki sugerują, że dziewczyna mogła być prostytutką. Przy ciele znaleziono także kartę klubu linii lotniczych, należącą do prominentnego lokalnego biznesmena - który zginął w pożarze kilka miesięcy wcześniej. Czy ofiary się znały..?\r\n\r\nTempe bada także zawiniątko ze zmumifikowanymi szczątkami peruwiańskich piesków, znalezionych przez celników podczas kontroli na lotnisku.\r\nDominick Rockett - weteran operacji Pustynna Burza - zostaje oskarżony o przemyt owych mumii do kraju.\r\nCzy jest jakiś jest związek, pomiędzy tymi sprawami..?\r\n\r\nKathy Reichs jest autorką wielu książek z dziedziny antropologii i medycyny sądowej. Oprócz pozycji naukowych, jest także autorką wielu książek sensacyjnych, które w ciągu dziesięciu lat od pojawienia się pierwszej z nich, przetłumaczone zostały na ponad 30 języków. Autorka debiutowała w 1997 książką &quot;Déjà Dead&quot;, za którą otrzymała prestiżową nagrodę Arthur Ellis Award.\r\nBohaterka serii - Temperance Brennan - podobnie jak autorka, jest antropologiem klinicznym i pomaga policji w rozwiązywaniu zagadkowych morderstw. Wiele z tych książek wzorowanych jest na prawdziwym życiu i jego realiach.\r\nOd 2005 roku amerykańska telewizja FOX produkuje serial &quot;KOŚCI&quot; (BONES), który bazuje na życiu Temperance &quot;Bones&quot; Brennan. Przy tworzeniu serialu pomagała sama autorka. Już kilka odcinków po pierwszej emisji, &quot;KOŚCI&quot; stały się jedną z najchętniej oglądanych pozycji w amerykańskiej telewizji.\r\n\r\n\r\ncykl KOŚCI (lub: Temperance Brennan)\r\n\r\n01 - Déjà Dead (inna wersja Zapach Śmierci; tytuł oryg. Déjà Dead, 1997)\r\n02 - Śmierć Za Dnia (inna wersja Dzień Śmierci; tytuł oryg. Death Du Jour, 1999)\r\n03 - Śmiertelne Decyzje (tytuł oryg. Deadly Decisions, 2000)\r\n04 - Zabójcza Podróż (tytuł oryg. Fatal Voyage, 2001)\r\n05 - Pogrzebane Tajemnice (tytuł oryg. Grave Secrets, 2002)\r\n06 - Nagie Kości (tytuł oryg. Bare Bones, 2003)\r\n07 - Poniedziałkowa Żałoba (tytuł oryg. Monday Mourning)\r\n08 - Starożytne Kości (tytuł oryg. Cross Bones)\r\n09 - Okruchy Śmierci (tytuł oryg. Break No Bones)\r\n10 - Kości W Proch (tytuł oryg. Bones to Ashes)\r\n11 - Diabelskie Kości (tytuł oryg. Devil Bones)\r\n12 - 206 Kości (tytuł oryg. 206 Bones (2009))\r\n13 - Kości Pająka (tytuł oryg. Spider Bones; inne wydanie Mortal Remains, 2010)\r\n14 - Z Krwi I Kości (tytuł oryg. Flash and Bones)\r\n15 - Kości Są Wieczne (tytuł oryg. Bones are Forever, 2013)\r\n16 - Kości Zaginionych (tytuł oryg. Bones of the Lost, 2013)\r\n\r\n17 - Bones In Her Pocket (2013)\r\n18 - Bones Never Lie (2014)\r\n19 - Swamp Bones (2014)\r\n20 - Speaking In Bones (2015)\r\n(tytuł oryg. Bones on Ice, 2015)","torrent":{"xt":"urn:btih:2f8802d9e5699fc3e54af2ca719aed1ae4457698","amp;dn":"K.Reichs+-Kosci+Zaginionych+%5BPL%5D+MP3%40128","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f8802d9e5699fc3e54af2ca719aed1ae4457698","infoHashBuffer":{"type":"Buffer","data":[47,136,2,217,229,105,159,195,229,74,242,202,113,154,237,26,228,69,118,152]},"announce":[],"urlList":[]}}