{"title":"Johnny Cash and Willie Nelson - Ring Of Fire (2nafish)","uid":5710940,"size":88039428,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:301069af823a60ebebeb1cbba4b7413724c95ad7&amp;dn=Johnny+Cash+and+Willie+Nelson+-+Ring+Of+Fire+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1279893551,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Ring of Fire&quot; or &quot;The Ring of Fire&quot; is a country music song popularized by Johnny Cash and co-written by June Carter (wife of Johnny Cash) and Merle Kilgore. The single appears on Cash's 1963 compilation album, Ring of Fire: The Best of Johnny Cash.\n\nThe song was recorded on March 25, 1963 and became the biggest hit of his career, staying at number one on the charts for seven weeks.\n\nNumerous cover versions of &quot;Ring of Fire&quot; have been produced, the most commercially successful version being by Social Distortion, who released their punk rock version on the album, Social Distortion (1990). The single reached #25 on the Billboard Modern Rock Tracks, 27 years after the single was first recorded by Cash.\n\nThe song has also been covered by singer and satirist, Frank Zappa. Zappa's version is a deconstructed, reggae rendition which appears on his album, The Best Band You Never Heard in Your Life (1991). The arrangement was concocted in anticipation of a guest appearance by Cash in Europe which was canceled at the last minute.\n\n&quot;Ring of Fire&quot; ranked #4 on CMT's 100 Greatest Songs in Country Music in 2003 and #87 on Rolling Stone's list of The 500 Greatest Songs of All Time.\n\nThe Eric Burdon &amp; The Animals version who was recorded in the end of 1968, charted in 1969 in the following countries: UK: #25, GER: #19, AUS: #10, AU: #8, NL: #4, it failed to chart in the US. In late 1974, The Eric Burdon Band released a heavier version. In 2006, Burdon performed the song sometimes at his concerts.\n\nRing of Fire: The Best of Johnny Cash is a compilations album by country singer Johnny Cash, released on Columbia Records in 1963. This album collects tracks from singles and an EP released between 1959 and 1963, Cash's first years on the Columbia label. &quot;Ring of Fire&quot;, one of Cash's most famous tracks, made its first LP appearance here. Ring of Fire was the first #1 album when Billboard debuted their Country Album Chart on Jan. 11, 1964.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:301069af823a60ebebeb1cbba4b7413724c95ad7","amp;dn":"Johnny+Cash+and+Willie+Nelson+-+Ring+Of+Fire+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"301069af823a60ebebeb1cbba4b7413724c95ad7","infoHashBuffer":{"type":"Buffer","data":[48,16,105,175,130,58,96,235,235,235,28,187,164,183,65,55,36,201,90,215]},"announce":[],"urlList":[]}}