{"title":"En Alas de la Seduccion - Gloria Casas [Epub][Spanish][+","uid":6819163,"size":625982,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3057534d194d19f6b301de55004e8ab6bcde02f1&amp;dn=En+Alas+de+la+Seduccion+-+Gloria+Casas+%5BEpub%5D%5BSpanish%5D%5B%2B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1321349492,"description":"\nEn alas de la seducciÃƒÂ³n, Gloria V. CasaÃƒÂ±as\n\nUna pasiÃƒÂ³n bajo el cielo de la Patagonia...\n\nEn un rincÃƒÂ³n remoto de la Patagonia argentina un hombre se oculta del mundo y, sobre todo, de su pasado. Newen Cayuki, por cuyas venas corre la sangre de los bravos indios tehuelche, sabe que los dioses le han negado todo, incluido el amor. Pero lo que nunca imaginÃƒÂ³ es que la maldiciÃƒÂ³n tomarÃƒÂ­a la forma de una hermosa mujer blanca, ni que su encarnizada lucha contra ella acabarÃƒÂ­a en la derrota mÃƒÂ¡s dulce, la de la rendiciÃƒÂ³n por amor. Cordelia no tiene otro propÃƒÂ³sito, al negar a ese lugar en el fin del mundo, que ayudar a su querido hermano gemelo. Llevada por su audacia, pensÃƒÂ³ que la misiÃƒÂ³n serÃƒÂ­a fÃƒÂ¡cil, pero no contaba con la presencia imponente de aquel bÃƒÂ¡rbaro que la intimida, la repudia y parece odiarla por alguna oscura razÃƒÂ³n.\nCordelia y Newen pertenecen a dos culturas totalmente distintas, sus mundos no comulgan en esta tierra. Sin embargo, nada podrÃƒÂ¡ romper el lazo invisible que se crea entre ellos. Y como una bendiciÃƒÂ³n, la magia ancestral de los antiguos, bajo la sombra de las alas del cÃƒÂ³ndor de los Andes, los ayudarÃƒÂ¡ a desenredar la maraÃƒÂ±a de sentimientos que ata sus vidas.","torrent":{"xt":"urn:btih:3057534d194d19f6b301de55004e8ab6bcde02f1","amp;dn":"En+Alas+de+la+Seduccion+-+Gloria+Casas+%5BEpub%5D%5BSpanish%5D%5B%2B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3057534d194d19f6b301de55004e8ab6bcde02f1","infoHashBuffer":{"type":"Buffer","data":[48,87,83,77,25,77,25,246,179,1,222,85,0,78,138,182,188,222,2,241]},"announce":[],"urlList":[]}}