{"title":"Lockie Leonard (Season 1) TVRip (SiRiUs sHaRe)","uid":4027234,"size":6355095308,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:306653f2f9cdb5900fa9d04f47f71764c1ae7678&amp;dn=Lockie+Leonard+%28Season+1%29+TVRip+%28SiRiUs+sHaRe%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"tvreaper","files":32,"time":1202984180,"description":"Twelve and 3/4 year old Lockie Leonard is a surf rat and when his family move to the most remote town on Earth, Angelus, Lockie&amp;#039;s convinced that this is a total disaster - no friends, a new school and a house that is truly in danger of disappearing into a swamp. But then Lockie spots the one thing that makes it all okay. This weird little town has the best surf he has ever seen. Based upon the novels by Western Australian, Booker nominated author, Tim Winton. Filmed on the West Australian coast in the town of Albany.\n\n...................................................................................................\n\n What chance have you got when your dad&amp;#039;s a cop, your mum?s a frighteningly understanding parent, your brother wets the bed, your best friend?s a heavy metal devotee and then you fall in love at 12 and three quarters years old? It can only mean trouble, worry, mega-embarrassment and some wild, wild times.\n\nLockie Leonard, hot surf-rat, and his family have just moved to the most remote town on earth, Angelus. For Lockie this is a TOTAL LIFE DISASTER: no friends, new school and a house that is truly in danger of disappearing into a swamp? but then Lockie spots the one thing that makes it all okay, this weird little town has the best surf he has ever seen.\n\nThrough the eyes of Lockie Leonard we view the truly mixed-up, yet very normal life of Lockie, his family and friends.\n","torrent":{"xt":"urn:btih:306653f2f9cdb5900fa9d04f47f71764c1ae7678","amp;dn":"Lockie+Leonard+%28Season+1%29+TVRip+%28SiRiUs+sHaRe%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"306653f2f9cdb5900fa9d04f47f71764c1ae7678","infoHashBuffer":{"type":"Buffer","data":[48,102,83,242,249,205,181,144,15,169,208,79,71,247,23,100,193,174,118,120]},"announce":[],"urlList":[]}}