{"title":"The Physics of Coronary Blood Flow","uid":12659551,"size":5789024,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:336e5071b3223eb447de7beab2ca69652c9cd32a&amp;dn=The+Physics+of+Coronary+Blood+Flow&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1446283633,"description":"The Physics of Coronary Blood Flow (Biological and Medical Physics, Biomedical Engineering)(Springer, 2005).pdf\r\n\r\nISBN 9780387252971\r\n\r\nThe fields of biological and medical physics and biomedical engineering are broad, multidisciplinary and dyanmic. They lie at the crossroads of frontier - search in physics, biology, chemistry, and medicine. The Biological &amp; Me- cal Physics/Biomedical Engineering Series is intended to be comprehensive, covering a broad range of topics important to the study of the physical, che- cal and biological sciences. Its goal is to provide scientists and engineers with textbooks, monographs, and reference works to address the growing need for information. Books in the series emphasize established and emergent areas of science - cluding molecular, membrane, and mathematical biophysics; photosynthetic - ergy harvesting and conversion; information processing; physical principles of genetics; sensory communications; automata networks, neural networks, and cellular automata. Equally important will be coverage of applied aspects of b- logical and medical physics and biomedical engineering such as molecular el- tronic components and devices, biosensors, medicine, imaging, physical prin- ples of renewable energy production, advanced prostheses, and environmental control and engineering","torrent":{"xt":"urn:btih:336e5071b3223eb447de7beab2ca69652c9cd32a","amp;dn":"The+Physics+of+Coronary+Blood+Flow","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"336e5071b3223eb447de7beab2ca69652c9cd32a","infoHashBuffer":{"type":"Buffer","data":[51,110,80,113,179,34,62,180,71,222,123,234,178,202,105,101,44,156,211,42]},"announce":[],"urlList":[]}}