{"title":"From Dust [English][FIX][SKIDROW][PC][sneak_shot][ArShAd]","uid":6627419,"size":1555360239,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:33745452391e6771737b599ba92db8a13820bfa4&amp;dn=From+Dust+%5BEnglish%5D%5BFIX%5D%5BSKIDROW%5D%5BPC%5D%5Bsneak_shot%5D%5BArShAd%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sneak_shot","files":37,"time":1314201170,"description":"presenting s n e a k _ s h o t\n\n\n\nrelease date:24-08-2011\n\ncover link:http://www.postimg.com/image/46000/photo-45152.jpg\n\ndescription:\n\n\nFrom Dust is a video game, designed by Eric Chahi and developed by Ubisoft Montpellier. Ubisoft described it as a 'spiritual heir' to Populous, a British game developed by Peter Molyneux and Bullfrog in 1989.[4][5] Announced on 14 June 2010 at the Electronic Entertainment Expo (E3), Ubisoft published the game on Xbox 360, 27 July 2011 as a part of XBLA Summer of Arcade event. The PC version was originally scheduled to be released at the same time but was delayed to August 17 due to undisclosed reasons.[6][7][8] From Dust will be distributed online via Steam, OnLive, GamersGate, and XBLA .\n\n\n\n\nIn From Dust, players assume a god-like first-person perspective from which they manipulate an archipelago environment in an effort to save, and enlighten, a nomadic tribe.[10] With a spherical cursor, the user controls certain types of matter - namely soil, lava and water - in real time. Lava cools to form solid rock, vegetation propagates in soil and spreads naturally once a village is built, and moving water quickly erodes terrain. Physical changes to the world occur extremely rapidly, allowing players to restructure islands within minutes.\n\n\n\n\nCampaigns in From Dust are structured as a sequence of missions, whereby completing certain objectives expedites the tribe's progress and bestows additional powers, such as the capacity to jellify water.[10] Tribal shamans alert the player to natural disasters, notably tsunamis and volcanic eruptions, shortly before they occur. These disasters can be inhibited through creative, physical manipulation of the environment: a tsunami can be jellified, wildfires extinguished, and lava flows diverted.[4][13][14][15][16] Although there is no 'explicit sandbox' mode, Chahi stated that each mission features a distinct map, which the player can return to and manipulate further.\n\n\ndevolopment:\n\n\n\nOn 14 June 2010, Ubisoft announced the development of From Dust at E3, and the appointment of Eric Chahi as the Creative Designer. Following the announcement, the company released cinematic, in-game footage featuring a variety of characters, terrains, and user interactions, with a vocal narration of some of the story.[17] On 16 August 2010, during Gamescom and the European Game Developers Conference in Cologne, Ubisoft unveiled technical footage, showing the game's physics engine in detail. In the technical sequence, a narrator explains the user's interactions with the environment, and the effects of each physical element upon the other.[11] During the conference, Chahi presented a lecture, entitled 'Creating a High-Performance Simulation: A Dynamic Natural World to Play With', demonstrating the world editor that underlies the environment simulation.[18][19][20] On 6 May 2011, Ubisoft released footage detailing the various influences on, and artistic direction of, From Dust.\n\n\n\n\n\nUbisoft's decision to release the game via the Internet was taken partly to reduce costs, but also to enable creative options for the team and allow for future features, such as a world editor or multiplayer.[21] Guillaume Bunier, Ubisoft's producer, acknowledged that 'some people will not be able to play it', but argued that the majority of individuals interested in the game would be using PSN, XBLA, and Steam.[15] In the event of From Dust being a 'huge success', Bunier suggested that the company could do another, disc-based version.[15] When questioned about the suitability of the game to the console market, he responded by observing that other atypical games were successful on such platforms, notably Flower on the PlayStation 3 (PS3). The OnLive game system, the PS3 and the Xbox 360 were 'powerful machines', and From Dust would utilise their greater capacity to operate the simulation.[15] On 7 July 2011, Ubisoft announced that From Dust will be released on PC and Xbox 360 on 27 July 2011.[22][23][24] However when pre-ordered on the Ubisoft Store, the release date order is listed as &quot;pre-ordered release date: Wed Aug 17 00:00:00 CDT 2011&quot;. The Ubi Store was updated to show the PC release as August 17 a day before the previously announced July 27.\n\n\n\nScreens:\n  &lt;a href=&quot;\nhttp://leetleech.org/images/87915862443651965699.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://leetleech.org/images/87915862443651965699.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://leetleech.org/images/88064005269337950368.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://leetleech.org/images/88064005269337950368.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://leetleech.org/images/16155457451056653335.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://leetleech.org/images/16155457451056653335.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://leetleech.org/images/94419559690924181373.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://leetleech.org/images/94419559690924181373.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://leetleech.org/images/08967170339869998765.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://leetleech.org/images/08967170339869998765.jpg&lt;/a&gt;\n\nAlternative:\n  &lt;a href=&quot;\nhttp://www.postimg.com/image/45000/photo-44561.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.postimg.com/image/45000/photo-44561.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.postimg.com/image/45000/photo-44562.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.postimg.com/image/45000/photo-44562.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.postimg.com/image/45000/photo-44563.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.postimg.com/image/45000/photo-44563.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.postimg.com/image/45000/photo-44564.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.postimg.com/image/45000/photo-44564.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.postimg.com/image/45000/photo-44565.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.postimg.com/image/45000/photo-44565.jpg&lt;/a&gt;\n\n\n\n\n1. Mount iso file and run the setup.exe\n2. Choose your language and follow the instructions on screen\n3. Close the Ubisoft website that will open when you are done installing the game\n4. Go to the your gamefolder and run From_Dust.exe\n5. If it shows the game is updating go to step 8, if you get an error message go to step 6\n6. Go to C:\\Windows\\System32\\drivers\\etc and move your Hosts file somewhere else\n7. Go to your game folder and run From_Dust.exe again, it will now show you the game is patching\n8. When the game is done patching close the window\n9. Go to CRACKONLY folder and move UbisoftGameLauncher.exe to C:\\Program Files (x86)\\Ubisoft\\Ubisoft Game Launcher\n10. Run From_Dust.exe and create a UPlay account\n11. When the game asks you for a serial, enter any number you like\n12. Press PLAY\n13. Enjoy the game and don't forget to place the Hosts file back!\n\n\n\n\n\nthanks to:ArShAd\n\n\n\n\n\nseed comment n enjoy...!!!\n","torrent":{"xt":"urn:btih:33745452391e6771737b599ba92db8a13820bfa4","amp;dn":"From+Dust+%5BEnglish%5D%5BFIX%5D%5BSKIDROW%5D%5BPC%5D%5Bsneak_shot%5D%5BArShAd%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33745452391e6771737b599ba92db8a13820bfa4","infoHashBuffer":{"type":"Buffer","data":[51,116,84,82,57,30,103,113,115,123,89,155,169,45,184,161,56,32,191,164]},"announce":[],"urlList":[]}}