{"title":"Mud - Mud Rock &amp; Mud Rock Vol II","uid":4887900,"size":184278362,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:348b66c15d29edac08c729642243d511ba7cd50d&amp;dn=Mud+-+Mud+Rock+%26+Mud+Rock+Vol+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":24,"time":1241814307,"description":"Mud - Mud Rock &amp; Mud Rock Vol II (1974-1975)\nCD (2000) To Mp3 320 mbit/s\nIncluded: CD Covers and this Info\n\nReview\tby Bruce Eder  allmusic.com\nThe two albums represented on this one CD slot in so perfectly alongside one another, that -- but for the silly narration -- it's hard to tell where one ends and the other begins. The 20 songs, either vintage tunes (&quot;The End of the World,&quot; &quot;Let's Have a Party,&quot; &quot;Tobacco Road,&quot; &quot;Diana,&quot; &quot;Tallahassee Lassie,&quot; &quot;Living Doll&quot;) or numbers done in a retro style, are all attractively done, not in a burlesque manner or in a slavish, deadening authentic style. &quot;The Secrets That You Keep&quot; was a huge hit for the group, but it's such a beautiful song that the authors could probably have brought it to Elvis himself -- though by 1975, it's unlikely he would've done as much with it as Les Gray and Mud did. All of the group's major RAK hits are present in one form or another, the sound is excellent, and the notes are reasonably extensive and informative. \n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Mud_(band)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Mud_(band)&lt;/a&gt;\nMud were an English glam rock band, formed in 1968, best remembered for their single &quot;Tiger Feet&quot; which was the UK's best-selling single of 1974. After joining RAK and teaming up with writers / producers Nicky Chinn and Mike Chapman, this good-time British band had a noteworthy run of hits, including three number ones.\n\nHistory\nMud first appeared on the Basil Brush show on BBC TV, and toured as support for Jack Jones. After years of unsuccessful singles, they were signed to Mickie Most's RAK label, and immediately had a Top 20 success with &quot;Crazy&quot;.\n\nAt the peak of their career they also enjoyed British number one singles with &quot;Tiger Feet&quot;; and &quot;Lonely This Christmas&quot; (1974), an affectionate Elvis Presley pastiche; plus &quot;Oh Boy&quot; (1975), a virtual a cappella cover of the Buddy Holly hit. &quot;Tiger Feet&quot; sold over 500,000 copies in the UK alone, and amassed a million sales globally.\n\nLike contemporaries Sweet, their most successful period came when their records were written and produced by Nicky Chinn and Mike Chapman, and in 1975 they had no fewer than seven singles on the UK Top 40. &quot;Oh Boy&quot; was the only number one single produced by Chinn and Chapman that they did not also write.\n\n&quot;Lonely This Christmas&quot; has become something of an annual fixture on British radio and television, (along with Slade's &quot;Merry Xmas Everybody&quot; and John Lennon's &quot;Happy Xmas&quot;). Mud also released another single under a different name - after &quot;The Cat Crept In&quot; they released a track from their album Mud Rock, a cover of &quot;In the Mood&quot;. This was released under the name of Dum (Mud spelt backwards), but failed to chart. Their last single was &quot;Rico&quot; released in 1980.\n\nThe last performance by the four original members was on 3 March 1990 at Dave Mount's wedding, a video recording of which was made by Mount.\n\nGray later toured as Les Gray's Mud in various line-ups, initially with members of the Bristol based Cherie Beck Band, later with Tim Fish (guitar), Mark Hatwood (Drums) and Kevin Fairburn (Bass), and ultimately with John Berry (bass), Syd Twynham (guitar) and Phil Wilson (drums). Twyham and Wilson still tour the 1970s circuit with Chris Savage (keyboards) and Marc Michalski (bass) as 'Mud II'.\n\nRay Stiles joined the Hollies; whilst Davis went on to co-write several highly successful dance hits for artists such as Kylie Minogue and Spiller featuring Sophie Ellis Bextor. Drummer Dave Mount went into the insurance business.\n\nLes Gray died on 21 February 2004 in Portugal, of a heart attack, as a result of throat cancer. \n\nLineup:\nLead guitarist Rob Davis (born Robert Davis, 1 October 1947, Carshalton, Surrey)\nLead vocalist Les Gray (born Thomas Leslie Gray, 9 April 1946, Carshalton, Surrey. He died of a heart attack on 21 February 2004, Lagos, Portugal)\nDrummer Dave Mount (born David George Mount, 3 March 1947, Carshalton. He died on 2 December 2006, at St Helier's Hospital, Carshalton)\nBass guitarist Ray Stiles (born Raymond John Stiles, 20 November 1946, Guildford, Surrey)\n\n\nTracklist:\nMud Rock  (1974)\n01. Rocket\n02. (a) Do You Love Me (b) Sha La La La Lee\n03. Runing Bear\n04. The Hippy Hippy Shake\n05. Shake,Rattle And Roll,See You Later Aligator\n06. Medley-Dyna-mite,The Cat Crept,Tiger Feet\n07. The End Of The World\n08. Blue Moon\n09. In The Mood\n10. Bye Bye Johnny\nMud Rock Vol II  (1975)\n11. The Secrets That You Keep\n12. Living Doll\n13. One Night\n14. Tallahassee Lassie\n15. Let's Have A Party\n16. Tobacco Road\n17. Oh Boy\n18. I Love How You Love Me\n19. Hula Love\n20. Diana","torrent":{"xt":"urn:btih:348b66c15d29edac08c729642243d511ba7cd50d","amp;dn":"Mud+-+Mud+Rock+%26+Mud+Rock+Vol+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"348b66c15d29edac08c729642243d511ba7cd50d","infoHashBuffer":{"type":"Buffer","data":[52,139,102,193,93,41,237,172,8,199,41,100,34,67,213,17,186,124,213,13]},"announce":[],"urlList":[]}}