{"title":"Shadowcrypt v1.3","uid":11049314,"size":24830928,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:349be623dc4278dd1fefa4e515a4f7a6fd79b842&amp;dn=Shadowcrypt+v1.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lamasu","files":-1,"time":1410997344,"description":"Shadowcrypt is a challenging combat-platformer that pays tribute to NES classics such as Zelda II and Castlevania. Engage in tactical sword &amp; shield combat where quick reflexes, timing, and observation are key to survive the deadly catacomb! You play as a hero who is the last of an ancient order sworn to battle corrupted sorcerers. Pick up weapon upgrades along the way, find the Necromancer and defeat his horde of undead warriors through a series of labyrinthine rooms and torch-lit corridors.\n\nFeatures:\n- Engaging and visceral melee combat that keeps you on your toes.\n- Authentic hand-drawn pixels and animation.\n- 70+ non-linear rooms.\n- Weapon upgrades and elemental enchantments.\n- 20 unlockable achievements.\n\nv1.3 changelog:\n- Added 20 unlockable achievements, available for both Steam and DRM-free version.\n- Added a timer feature for those who enjoy doing speedruns.\n- Defender Shield now stuns more often, making it much more viable to use.\n- Stun indicator on enemies after being hit by the Defender Shield is now more prominent under various lighting conditions.\n- Pressing certain key combinations on the keyboard when moving between room transitions should no longer cause the character to glide.\n- The volume of opening/closing portcullis is now more consistent from room-to-room.\n- Added customisable control bindings for both keyboard and gamepad (to make this feature work properly, you need to run Windows as an administrator before launching the game).\n- Left analog joystick control is now working.\n- Added on-the-fly adjustable brightness up to 4 levels (default, 1x, 2x, and 3x) to cater for video streamers as well as a wider variety of monitors.\n- Input for navigating in-game menus are now standardised. This is to retain a consistent input experience regardless of how the controls have been configured by players. Gamepads now uses A or START button for accept, and B or BACK button for cancel. Keyboards now uses ARROW keys for navigation, ENTER key for accept, and ESC key for cancel.\n- Some tweaks to images (cleaned up the pixels on doorways, a simpler game loader image, adjustments on the prologue, ending and credits, improved pause screen, ceiling/platform depth shadows, shields dimmed correctly under low-lighting conditions).\n- Fixed a bug where moving platforms are not paused properly.\n- Fixed a rare bug where the dead character can still pick up a heart during a specific moment, which can cause the game to get stuck and unable to advance.\n- Fixed a bug where the character can enter past through a closed portcullis moments after destroying the last enemy in the room.\n\nIf you like the game, support the developer, buy it! &lt;a href=&quot;\nhttp://www.shadowcrypt.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shadowcrypt.net&lt;/a&gt;","torrent":{"xt":"urn:btih:349be623dc4278dd1fefa4e515a4f7a6fd79b842","amp;dn":"Shadowcrypt+v1.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"349be623dc4278dd1fefa4e515a4f7a6fd79b842","infoHashBuffer":{"type":"Buffer","data":[52,155,230,35,220,66,120,221,31,239,164,229,21,164,247,166,253,121,184,66]},"announce":[],"urlList":[]}}