{"title":"ManCandy FAQ DVD (blender)","uid":4113246,"size":6356577391,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:34be5a2bd4428831fca259809323188ad4674df2&amp;dn=ManCandy+FAQ+DVD+%28blender%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"timitim","files":211,"time":1207170328,"description":"The Blender Foundation\\\\\\&amp;#039;s Mancandy FAQ.\n(released under CC Licence =&gt; Sharing allowed)\n\nPlease donate to blender.org\nor buy a DVD from the upcoming Peach movie (peach.blender.org) or\nthe Apricot Game (apricot.blender.org)\nThanks!\n\n\nThe ManCandy FAQ is a collection of animations and video tutorials for rigging and animating with ManCandy. The animations are in question and answer format (hence the title) and are intended to be a fun way of documenting the rig.\n\nThe video tutorials are a little more serious, and are divided into animation and rigging topics. Animation tutorials cover setting up files and linking, animating an arm motion in FK, doing a cartoony take and walkcycles. Rigging topics are arranged according to the parts of ManCandy&amp;#039;s body - there are sections for the hands, torso, face, legs, etc.\n\nWhile this is not a basic rigging tutorial (viewers should have a basic knowledge of the Blender interface and the bare minimum of armatures and animation ) there is a basics/primer tutorial that quickly goes through blender rigging and animation features, such as lattices, armatures, weight painting, etc.\n\nThere is also a short bonus rigging breakdown tutorial on a simple surprise character (not ManCandy.)\n\nThe information presented overall captures most of the Elephants Dream production rigs with many improvements that were aimed at assisting the Plumiferos project.\n\nThe DVD includes an HTML interface that itself contains some written tutorial/reference material, a collection of videos (Animations in 640x480 resolution, Tutorials in 1024x768 resolution), the ManCandy 2.0 blend file, the mystery character blend file, all the blend files for the animations on the DVDs, and of course some helper blend files for the tutorials.\n\nLicensing details: Video and animation content is Creative Commons licensed (similar to Elephants Dream) while ManCandy himself is public domain (but treat him with respect!)\n\nVersioning details: The tutorials (and ManCandy) are designed to work with Blender 2.44 / 2.45 (the current stable version of blender). ManCandy is constantly updated to work with future versions of Blender (and take advantage of new features) and the concepts and techniques taught here should remain valid for the foreseeable future.\n\nAbout the author: Bassam Kurdali - living in Amherst, Massachusettes, USA - was director and lead rigger/animator of Elephants Dream, the first 3D Open Movie project by the Blender Foundation. Bassam is currently working as freelancer on various animation\n\nwww.blender3d.org/e-shop/product_info.php?products_id=99","torrent":{"xt":"urn:btih:34be5a2bd4428831fca259809323188ad4674df2","amp;dn":"ManCandy+FAQ+DVD+%28blender%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34be5a2bd4428831fca259809323188ad4674df2","infoHashBuffer":{"type":"Buffer","data":[52,190,90,43,212,66,136,49,252,162,89,128,147,35,24,138,212,103,77,242]},"announce":[],"urlList":[]}}