{"title":"Democracy Now - 27 jul 2010","uid":5719898,"size":452903195,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:35181a946855f55c08225a626c2afacd57519abb&amp;dn=Democracy+Now+-+27+jul+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Roys","files":1,"time":1280250615,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for July 27, 2010\n\n- Karzai Orders Probe into Deadly NATO Air Strike\n- Missing US Soldier Found Dead in Afghanistan\n- As BP Reports $17B Loss, Hayward to Step Down as CEO\n- Greenpeace Activists Shut Down BP Stations in London\n- Iran Says It Is Open to Nuclear Talks &quot;Without Any Conditions&quot;\n- Environmental Ministers Criticize US Stance on Climate Change\n- WFP: 8 Million Need Food Aid in Niger Due to Severe Drought\n- SEIU and UNITE HERE Reach Settlement Ending Dispute\n- Tennessee GOP Candidate Questions Whether Islam Is a Religion\n- Probe Urged into Murdered Honduran Journalists\n- 20th Anniversary of Americans with Disabilities Act Marked\n- Puerto Rican Independentista Freed After 30 Years\n\n\nSpecial reports\n\n\n- WikiLeaks Founder Says Afghan War Logs Show &quot;Evidence of War Crimes,&quot; White House Downplays Leak Claiming &quot;No Broad New Revelations&quot;\n\nThe disclosure of a massive trove of classified military records documenting the Afghanistan war has ignited a firestorm and increased pressure on the White House to defend its military strategy. We play highlights of the White House press conference in Washington and Julian Assange's press conference in London.\n\n\n- Guardian Editor on Coverage of Afghan War Logs: European Audience &quot;Troubled More...By The Toll This War is Taking on Innocent People&quot;\n\nWe speak with David Leigh the investigations editor at the Guardian, one of the three newspapers, along with The New York Times and Der Spiegel WikiLeaks gave the Afghanistan war documents to. &quot;Broadly we see a similar picture in three media. What we do see is quite a different political perspective. From the New York Times' point of view...it was interesting to see the relationship with Pakistan was a priority,&quot; Leigh says. &quot;With us, we're more concernced about the casualites, I think. We're troubled more, a European audience, by the toll this war is taking on innocent people.&quot;\n\n\n- &quot;WikiLeaks is Not One Person...We Are All the Threat&quot;-Hacker Magazine Editor Says WikiLeaks is Bigger Than Julian Assange\n\nWe speak to Emmanuel Goldstein, a well-known figure in the hacker community and the editor of the magazine &quot;2600: The Hacker Quarterly.&quot; He is also the organizer of the HOPE conference. WikiLeaks founder Julian Assange had been slated to be the keynote speaker at the most recent conference. Federal agents were there waiting for him but Assange didn't show.\n\n(Thanks ;-)) &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:35181a946855f55c08225a626c2afacd57519abb","amp;dn":"Democracy+Now+-+27+jul+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35181a946855f55c08225a626c2afacd57519abb","infoHashBuffer":{"type":"Buffer","data":[53,24,26,148,104,85,245,92,8,34,90,98,108,42,250,205,87,81,154,187]},"announce":[],"urlList":[]}}