{"title":"Introduction to Environmental Forensics,2nd edition{BBS}","uid":6727777,"size":24643316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36b323972397645de9f7d13173a5c85dc1720daa&amp;dn=Introduction+to+Environmental+Forensics%2C2nd+edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1318006735,"description":"Introduction to Environmental Forensics helps readers unravel the complexities of environmental pollution cases. It outlines techniques for identifying the source of a contaminant release, when the release occurred, and the extent of human exposure. Written by leading experts in environmental investigations, the text provides detailed information on chemical &quot;fingerprinting&quot; techniques applicable to ground water, soils, sediments, and air, plus an in-depth look at petroleum hydrocarbons.\n\nIt gives the environmental scientist, engineer, and legal specialist a complete toolbox for conducting forensic investigations. It demonstrates the range of scientific analyses that are available to answer questions of environmental liability and support a legal argument, and provides several examples and case studies to illustrate how these methods are applied.\n\nThis is a textbook that would prove useful to a range of disciplines, including environmental scientists involved in water and air pollution, contaminated land and geographical information systems; and archaeologists, hydrochemists and geochemists interested in dating sources of pollution.\n\n* Co-edited by one of the experts from the Civil Action case in Woburn, MA\n* Provides essential information about identifying environmental contaminants responsible for millions of deaths per year\n* Contains the latest information and coverage of issues crucial to both forensics investigators and environmental scientists\nProduct Details\n\n    * Hardcover: 776 pages\n    * Publisher: Academic Press; 2 edition (April 4, 2007)\n    * Language: English\n    * ISBN-10: 0123695228\n    * ISBN-13: 978-0123695222","torrent":{"xt":"urn:btih:36b323972397645de9f7d13173a5c85dc1720daa","amp;dn":"Introduction+to+Environmental+Forensics%2C2nd+edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36b323972397645de9f7d13173a5c85dc1720daa","infoHashBuffer":{"type":"Buffer","data":[54,179,35,151,35,151,100,93,233,247,209,49,115,165,200,93,193,114,13,170]},"announce":[],"urlList":[]}}