{"title":"W.E. Johns - Biggles en de Kroonjuwelen (E-Book)NLT-Release","uid":6426462,"size":251988,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3786d2ff72b2934b2809ada5715e4f832612a819&amp;dn=W.E.+Johns+-+Biggles+en+de+Kroonjuwelen+%28E-Book%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"linday1","files":-1,"time":1306494127,"description":"\n\nBiggles is de bijnaam van Captain James Bigglesworth (Distinguished Service Medal en Distinguished Service Order).\n\nBiggles is een kinderboekenheld in een boekenreeks die door de Britse schrijver William Earl Johns is bedacht.\n\nBiggles wordt in 1899 in India geboren, maar wegens ziekte wordt hij door zijn vader naar een kostschool in Engeland gezonden. Hij leert vliegen in de begindagen van de Eerste Wereldoorlog. Nadat deze is afgelopen maakt hij reizen over de hele wereld, waar hij met zijn vast terugkerende vrienden: Commodore Raymond, the Honourable Algernon Lacey (Algy), Ginger Hebblethwaite, Lord Bertram Lissie (Bertie) de meest spannende avonturen beleeft. Hij is in die tijd onder andere geheim agent bij Scotland Yard. Daarnaast heeft hij ook een eigen luchtvaartmaatschappij genaamd Biggles &amp; Co.\n\nOok komt hij steevast zijn oude aartsrivaal Erich von Stalhein in zijn avonturen tegen.\n\nIn de Tweede Wereldoorlog treedt hij weer op als piloot voor de Royal Air Force (RAF). Na deze oorlog beleeft hij nog verschillende spannende avonturen en sluit zelfs vrede met zijn aartsvijand von Stalhein, die hij al sinds de Eerste Wereldoorlog tegenkomt. De laatste avonturen spelen zich af in de jaren '50 van vorige eeuw.\n\nEr zijn vele boeken geschreven, waarvan er 96 in het Nederlands zijn vertaald. De recentste vertaling is Biggles trekt ten strijde. Dit boek is uitgegeven door de I.B.A. en verscheen in oktober 2010.\n\nDaarnaast zijn er in de jaren negentig twaalf korte verhalen van Johns verschenen bij de I.B.A.. Deze korte verhalen waren toen nog niet in boekvorm verschenen en waren nog niet in het Nederlands vertaald. Deze korte verhalen waren tweetalig. De ene helft van het boek bevatte het Engelstalige originele verhaal en de andere helft de Nederlandse vertaling. In deze reeks verschenen 9 Biggles-verhalen, 2 Worrals-verhalen en 1 langer Steeley-verhaal. Deze laatste 3 verhalen hebben betrekking op andere series van Johns die in Nederland minder bekend zijn, al zijn de Steeley-verhalen in de jaren vijftig wel alle vijf in het Nederlands vertaald.\n\nIn 1986 werd onder de naam Biggles zelfs een speelfilm uitgebracht; deze heeft het succes van de boekenreeks echter niet geÃƒÂ«venaard.\n\nToen in de jaren zestig de rechten vrijkwamen om stripverhalen te maken rond het personage Biggles, ging de Studio Vandersteen (bekend van onder andere Suske en Wiske en De Rode Ridder) daar op in. Willy Vandersteens medewerker Karel Verschuere maakte een twintig delen tellende reeks die geen groot succes was, hoewel de kwaliteit van een zeer degelijk niveau was. De strips, herkenbaar aan de groene kaft en witte letters, zijn nu onder verzamelaars zeer begeerd.\n\nLater werd er een andere stripreeks van Biggles opgezet die in feite los stond van de reeks gemaakt door Studio Vandersteen.\n\nVoor de nieuwste films en muziek ga je naar:\n &lt;a href=&quot;\nhttp://www.movierecensies.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.movierecensies.nl&lt;/a&gt;\n\nHashcode:\n3786D2FF72B2934B2809ADA5715E4F832612A819\n\n\nVeel leesplezier!\n\nBy Linday","torrent":{"xt":"urn:btih:3786d2ff72b2934b2809ada5715e4f832612a819","amp;dn":"W.E.+Johns+-+Biggles+en+de+Kroonjuwelen+%28E-Book%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3786d2ff72b2934b2809ada5715e4f832612a819","infoHashBuffer":{"type":"Buffer","data":[55,134,210,255,114,178,147,75,40,9,173,165,113,94,79,131,38,18,168,25]},"announce":[],"urlList":[]}}