{"title":"Clarice Lispector Todos os Contos 2016 Ebook Word Makalakato","uid":15693408,"size":4065394,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3848e604e5db8157d295e601a56c181b00838f40&amp;dn=Clarice+Lispector+Todos+os+Contos+2016+Ebook+Word+Makalakato&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"makalakat","files":1,"time":1472426450,"description":"Autora de romances e contos que figuram entre os mais emblemáticos da literatura brasileira, Clarice Lispector é considerada uma das mais importantes escritoras do século XX. Sua popularidade alcançou níveis surpreendentes nas últimas décadas, especialmente após o fenômeno da internet, mas sua figura e sua obra seguem exercendo sobre leitores o mesmo e fascinante estranhamento que causaram desde sua estreia literária, em 1943. \r\n\r\nNesta coletânea, que reúne pela primeira vez todos os contos da autora num único volume, organizado pelo biógrafo Benjamin Moser, é possível conhecer Clarice por inteiro, desde os primeiros escritos, ainda na adolescência, até as últimas linhas. Essencial para estudantes e pesquisadores, para fãs de Clarice Lispector e iniciantes na obra da escritora, Todos os contos foi lançado nos Estados Unidos em 2015, figurando na lista de livros mais importantes do ano do jornal The New York Times e ganhou importantes prêmios, como o Pen Translation Prize, de melhor tradução. Agora é a vez de os leitores brasileiros (re) descobrirem por completo esta contista prolífica e singular","torrent":{"xt":"urn:btih:3848e604e5db8157d295e601a56c181b00838f40","amp;dn":"Clarice+Lispector+Todos+os+Contos+2016+Ebook+Word+Makalakato","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3848e604e5db8157d295e601a56c181b00838f40","infoHashBuffer":{"type":"Buffer","data":[56,72,230,4,229,219,129,87,210,149,230,1,165,108,24,27,0,131,143,64]},"announce":[],"urlList":[]}}