{"title":"Aayirathil Oruvan (1965) Tamil Xvid 2cd - Eng Subs - MGR, Jayala","uid":10704994,"size":1645350568,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:39146e213e4cfa806feb7de8e2e8090420469468&amp;dn=Aayirathil+Oruvan+%281965%29+Tamil+Xvid+2cd+-+Eng+Subs+-+MGR%2C+Jayala&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SaM","files":-1,"time":1407271107,"description":"Aayirathil Oruvan (1965) Tamil Xvid 2cd - Eng Subs - MGR, Jayalalitha [DDR]\n\nAayirathil Oruvan (English: One man in a Thousand), also spelt as Ayirathil Oruvan, is a 1965 Indian swashbuckling action-adventure film in Tamil language, directed by B.R. Panthulu. \nStarring M. G. Ramachandran and Jayalalitha in the lead roles, the film further stars other widely known actors such as M. N. Nambiar, R. S. Manohar, Nagesh and Madhavi Krishnan. \nIt ran more than 100 days in Chennai in all the theatres released and other major cities. \nThe Director B.R. Panthulu was suffering from debts in view of the losses incurred by Kappalotiya Thamilan and Karnan produced with huge cost, and this film made him to pay all the debts and became free from debts. \nThis film made M.G.R. - Jayalalitha pair the best one and they acted together in 28 films. Even now it fetches good collection wherever re-released.\n\n    CAST:-\n    M. G. Ramachandran as Manimaran, a doctor living in Neidhal Naadu\n    Jayalalithaa as Poongodi, the princess of Kanni Theevu\n    M. N. Nambiar as the Pirate Leader\n    Nagesh as Azhaga, Manimaran's sidekick\n    R. S. Manohar as the Dictator of Neidhal Naadu\n    Madhavi Krishnan as Thenmozhi, Azhaga's love interest\n\nProduced and Directed by B.R. Panthulu\nMusic by Viswanathan Ramamoorthy\nLyrics by Vaali\nPlayback Singers:- P. Susheela, T.M. Soundararajan\nRunning time 167 minutes\n\nSongs are included in MP3s\nAayirathil Oruvan (1965) 00. Title Music and Screen Credits,  Viswanathan Ramamoorthy\nAayirathil Oruvan (1965) 01. Paruvam Enathu Paadal, P. Susheela, Vaali, Viswanathan Ramamoorthy\nAayirathil Oruvan (1965) 02. Yaen Indra Kaelvi, T.M. Soundararajan, Vaali, Viswanathan Ramamoorthy\nAayirathil Oruvan (1965) 03. Odum Maegangalae, T.M. Soundararajan, Kannadasan, Viswanathan Ramamoorthy\nAayirathil Oruvan (1965) 04. Unnai Naan Santhithaen, P. Susheela, Vaali, Viswanathan Ramamoorthy\nAayirathil Oruvan (1965) 05. Adamal Adukiran, P. Susheela, Vaali, Viswanathan Ramamoorthy\nAayirathil Oruvan (1965) 06. Short Songo, T.M. Soundararajan, P. Susheela, Vaali, Viswanathan Ramamoorthy\nAayirathil Oruvan (1965) 07. Naanamo Innum Naanamo, T.M. Soundararajan, P. Susheela, Vaali, Viswanathan Ramamoorthy\nAayirathil Oruvan (1965) 08. Adho Andha Paravai Pola, T.M. Soundararajan, Kannadasan, Viswanathan Ramamoorthy\nAayirathil Oruvan (1965) 09. END SONG, T.M. Soundararajan, Kannadasan, Viswanathan Ramamoorthy\nAayirathil Oruvan (1965) 10. All Songs\n\n\nSYNOPSIS:- Aayirthil Oruvan (1965) Tamil\nThe story is based on the story of sea-pirates and independence achieved against a cruel tyrant. Manimaran (MGR), is a Maruththuvar (Doctor) living in Neidhal Naadu with his sidekick Azhaga (Nagesh). He helps cure the illness of one of the rebels against the dictator (Manohar) of Neidhal Naadu. The ruler's guards arrest the rebels, along with Manimaran for helping them. Manimaran and the rebels are sold as slaves by the ruler to the nearby island called Kanni Theevu (Tamil for Virgin Islands), ruled by Sengappan. Manimaran leads the slaves, and fights for their rights.\n\nPoongodi , The pricess of Kanni theevu (Jayalalitha), niece of Sengappan who is the guardian of the orphaned pricess , falls in love with Manimaran at the first sight. Simultaneously, her servant Thenmozhi (Madhavi Krishnan) falls for Azhagan, after initial arguments. Despite the differences between Poongodi and Manimaran, Poongodi tries to woo him on many occasions. She even offers freedom from slavery only to him, who rejects the offer demanding freedom for all of the slaves. Meanwhile, the island is attacked by pirates headed by a leader (Nambiar). As Sengappan's troops are out of the island on another assignment, Sengappan pleads with Manimaran and the other slaves to help him. Manimaran demands freedom slavery in return for fighting the pirates, only to be betrayed later.\n\nThe slaves make an escape plan of their own and successfully take over the pirate ship, with whom they fought earlier. Manimaran explains to the pirate captain/leader, about their plight and asks him to help them reach Neidhal Naadu. The captain, apparently agrees, while actually taking them to his pirate island and holds them captive. He coerces them to work for him as pirates or Manimaran will see all of his other men die before him. With no option in place, Manimaran agrees to work as a pirate to escape the situation. In one of his pirate hunts, he finds Sengappan and Poongodi. He brings Poongodi to the pirate island, and tries to hide her from the pirate leader. Nanjappan, the right hand of the pirate leader, finds out tells the leader about Poongodi. As per the policy of the island, any treasure pirated must be auctioned and so Poongodi is also auctioned. After a tight bidding, Manimaran bids the highest, buys her and keeps her with him.\n\nAfter few dramatic events, Manimaran gets married to Poongodi and as per the pirate island's laws the pirate leader cannot attempt to separate a married couple. The pirate leader attempts to take Poongodi by force, gets defeated by Manimaran in a sword fight and reforms into a good man. He accompanies the slaves led by Manimaran, to achieve their goal of freeing their motherland Neidhal Naadu from the clutches of its cruel dictator. In the ensuing war, the dictator is defeated but tricks into arresting them instead. However, in his court the dictator begs Manimaran to take over the throne. Everyone else also supports the idea. However, Manimaran politely rejects the offer and further states that he wants to continue his noble work as a doctor, serving the people. He then takes leave from the royal court and walks away with his wife and his med kit.\n\n\nPRODUCTION NOTES:-\nAayirathil Oruvan was launched in 1962, and was M. G. Ramachandran's first film with director B. R. Panthulu. It was also the first film which featured him alongside the-then 14-year old newcomer Jayalalithaa, who was previously seen in her debut film Vennira Aadai. The duo subsequently starred together frequently in later films. Panthulu, who faced losses from his previous Karnan, compensated for it through this film.\nAayirathil Oruvan is said to be inspired from the 1935 swashbuckling Errol Flynn starrer, Captain Blood, and also from Burt Lancaster's The Crimson Pirate, which itself was inspired by the 1926 film The Black Pirate.\nSoundtrack\n\nMOVIE RECEPTION:-\nAayirathil Oruvan was very well received by critics. M. G. Ramachandran's performance as a kind, noble, and brave leader later helped him build a massive reputation in his political career. IndiaGlitz stated that, &quot;Revolutionary Leader MGR's flawless performance, Nambiar's odious crimes, Jaylalitha's lovable attitude, Nagesh's tummy tickling fun and M.S.Viswanathan's Music made the movie a unforgettable one and paved way for MGR's Political career.&quot;\nRe-release\n\nRE-RELEASE NOTES:-\nForty-nine years after the original theatrical release, the film was digitally enhanced for a planned re-release in January 2014. Apart from scope conversion from 35mm to digital scope, the film also had a completely re-recorded background music played out by an assistant of M. S. Viswananthan. The digital conversion was done by Prasad EFX, Chennai, who had previously restored Karnan and Paasa Malar. Since the negatives were entirely damaged, the entire running length was converted. The film was distributed by Divya Films which had earlier released Karnan in digital format. The digitised version of Aayirathil Oruvan was release on 14 March 2014 to an average opening, earning INR26.9 lakh (US$45,000) in the first weekend at Chennai.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Bitrate: 1295 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: Tamil\nRunTime: 2:45:28\nSubtitles: English\nRipped by: Trinidad [DDR]   \nDuration: 2:45:28","torrent":{"xt":"urn:btih:39146e213e4cfa806feb7de8e2e8090420469468","amp;dn":"Aayirathil+Oruvan+%281965%29+Tamil+Xvid+2cd+-+Eng+Subs+-+MGR%2C+Jayala","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39146e213e4cfa806feb7de8e2e8090420469468","infoHashBuffer":{"type":"Buffer","data":[57,20,110,33,62,76,250,128,111,235,125,232,226,232,9,4,32,70,148,104]},"announce":[],"urlList":[]}}