{"title":"Michael J. Totten - The Road to Fatima Gate (mobi, epub)","uid":6941533,"size":1076708,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:392cdd21986c7a24636a206a18470295dcc6c2d1&amp;dn=Michael+J.+Totten+-+The+Road+to+Fatima+Gate+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1326056495,"description":"The Road to Fatima Gate: The Beirut Spring, the Rise of Hezbollah, and the Iranian War Against Israel\n\nThe Road to Fatima Gate is a first-person narrative account of revolution, terrorism, and war during history's violent return to Lebanon after fifteen years of quiet. Michael J. Totten's version of events in one of the most volatile countries in the world's most volatile region is one part war correspondence, one part memoir, and one part road movie.\n\nHe sets up camp in a tent city built in downtown Beirut by anti-Syrian dissidents, is bullied and menaced by Hezbollah's supposedly friendly &quot;media relations&quot; department, crouches under fire on the Lebanese-Israeli border during the six-week war in 2006, witnesses an Israeli ground invasion from behind a line of Merkava tanks, sneaks into Hezbollah's post-war rubblescape without authorization, and is attacked in Beirut by militiamen who enforce obedience to the &quot;resistance&quot; at the point of a gun.\n\nFrom the &quot;Cedar Revolution&quot; that ousted the occupying Syrian military regime in 2005, to the devastating war between Israel and Hezbollah in 2006, and to Hezbollah's slow-motion but violent assault on Lebanon's elected government and capital, Totten's account is both personal and comprehensive. He simplifies the bewildering complexity of the Middle East, has access to major regional players as well as to the man on the street, and personally witnesses most of the events he describes. The Road to Fatima Gate should be indispensable reading for anyone interested in the Middle East, Iran's expansionist foreign policy, the Arab-Israeli conflict, asymmetric warfare, and terrorism in the aftermath of September 11.\n\n&quot;It is extremely rare to read such an accurate account of anything to which one was oneself a witness.&quot;--Christopher Hitchens, author of god is Not Great\n\nAuthor: Michael J. Totten\nPublisher: Encounter Books\nPublication Date: April 5, 2011\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:392cdd21986c7a24636a206a18470295dcc6c2d1","amp;dn":"Michael+J.+Totten+-+The+Road+to+Fatima+Gate+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"392cdd21986c7a24636a206a18470295dcc6c2d1","infoHashBuffer":{"type":"Buffer","data":[57,44,221,33,152,108,122,36,99,106,32,106,24,71,2,149,220,198,194,209]},"announce":[],"urlList":[]}}