{"title":"Ch4.Escape.from.Colditz.3of3.Eureka.XviD.AC3.MVGroup.Forum.avi","uid":7334241,"size":1008283648,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3960f32048ef30d3b59abbd79e6f8a9ebe227ab8&amp;dn=Ch4.Escape.from.Colditz.3of3.Eureka.XviD.AC3.MVGroup.Forum.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MVGroup","files":-1,"time":1339018736,"description":"War Documentary hosted by Paul Brightwell, published by Channel 4 in 2000 - English narration\n\n\nInformation\n------------------------------\n\n\nOn a cliff top above a small town in eastern Germany stands one of the most potent symbols of the Second World War. This grim l6th Century castle is Colditz, the most notorious prisoner of war camp in history. With its imposing walls and rigorous policing, Colditz was seen as the ultimate prison.\n\nThe Germans believed escape from Colditz was aIl but impossible. However, over five extraordinary years, they were proved wrong time and again, defeated by achievements of boundless bravery, planning and ingenuity.\n\nUsing archive material, dramatic reconstruction, and the personal testimony of Colditz veterans, this intriguing three part series from Channel 4 Television documents the creative and often spectacular attempt to go over, under or through the walls.\n\nFor the first time the Allied Officers of three nations return to Colditz to reopen the tunnels and retrace the routes of their legendary escapes.\nWith as many guards as prisoners, Colditz was considered escape-proof. But it wasn't long before the officers pooled their talents to create the greatest escape academy of the war. Often for the first time, the English, French, Dutch and Polish officers and their guards describe their experiences.\n\nTwelve years in the making, the film uses over 50 original interviews to capture the true stories behind the castle's infamous walls.\n\nA Production by Windfall Films for Channel 4\nChannel Four Television Corporation MM\nRunnlng Time: 150 mine approx\n\n\n\nEpisode 3 : Eureka\n\nIn the most audacious escape attempt at all, a group of British prisoners designed and built a glider to fly from the roof of the castle - but events conspired to prevent its launch. The Spirit of Colditz has since attained legendary status as the greatest escape attempt never to happen.\nSome 55 years later, the glider has been rebuilt almost precisely. With two of the veterans who originally designed her looking on, this programme investigates if the Spirit of Colditz really would have flown.\nIt also reveals how the prisoners combated the boredom of daily life, what happened to the Colditz spy, and how a syphilitic camel came to one man's rescue as he attempted to escape from Colditz.\n\n\n\nTechnical Specs\n------------------------------\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2090 kbps\nVideo Resolution: 704x408\nVideo Aspect Ratio: 1.725:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 256kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 50:22.000\nNumber Of Parts: 3\nPart Size: 782 MB - 961 MB\nRipped by: DocFreak08 \t","torrent":{"xt":"urn:btih:3960f32048ef30d3b59abbd79e6f8a9ebe227ab8","amp;dn":"Ch4.Escape.from.Colditz.3of3.Eureka.XviD.AC3.MVGroup.Forum.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3960f32048ef30d3b59abbd79e6f8a9ebe227ab8","infoHashBuffer":{"type":"Buffer","data":[57,96,243,32,72,239,48,211,181,154,187,215,158,111,138,158,190,34,122,184]},"announce":[],"urlList":[]}}