{"title":"Cold and Hot Forging - Fundamentals and Applications","uid":5800026,"size":11533844,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:396c329cb828196d79729ed8900425331a2662f8&amp;dn=Cold+and+Hot+Forging+-+Fundamentals+and+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"philmccrevice","files":1,"time":1283230709,"description":"\nAmong all manufacturing processes, forging technology has a special place because it can be used to produce parts of superior mechanical properties with minimum waste of material. Process selection and optimization are important because of the ever-increasing costs of material, energy, and labor. This reference book reviews the fundamentals of forging technology, the principal variables of the forging process and their interactions, and computer-aided techniques such as finite element analysis (FEA) for forging process and tooling design.\n\nTopics addressed include the flow behavior of the forged material under processing conditions; die geometry and die materials; friction and lubrication; the mechanics of deformation (strains and stresses); the characteristics of forging equipment; the geometry, tolerances, surface finish and mechanical properties of forgings; and the effects of the process on the environment. A major emphasis is on the latest developments in the design of forging operations and dies, and process modeling using FEA is discussed in all of the relevant chapters. \n\nSeveral chapters of the book have appendices that consist of computer animations showing the results of FEA simulations for various forging operations. The appendices are provided in Microsoft PowerPoint format on the CD-ROM that is included with the book. \n\nContents: \n\nMetal Forming Processes in Manufacturing \nForging Process-Variables and Descriptions \nPlastic Deformation: Strain and Strain Rate \nFlow Stress and Forgeability \nDeformation: Complex State of Stress and Flow Rules \nTemperatures and Heat Transfer \nFriction and Lubrication \nSimultaneous Determination of Flow Stress and Friction \nMethods of Analysis for Forging Operations \nPrinciples of Forging Machines \nPresses and Hammers for Forging \nSpecial Machines for Forging \nBillet Separation \nProcess Design in Impression Die Forging \nA Simplified Method to Estimate Forging Load in Impression Die Forging \nProcess Modeling in Impression Die Forging using FEA \nCold and Warm Forging \nProcess Modeling in Cold Forging using FEA \nMicrostructure Modeling in Forging \nIsothermal and Hot Die Forging \nDie Materials and Die Manufacturing \nDie Failures in Cold and Hot Forging \nNear Net Shape Forging and New Developments \nIndex \n","torrent":{"xt":"urn:btih:396c329cb828196d79729ed8900425331a2662f8","amp;dn":"Cold+and+Hot+Forging+-+Fundamentals+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"396c329cb828196d79729ed8900425331a2662f8","infoHashBuffer":{"type":"Buffer","data":[57,108,50,156,184,40,25,109,121,114,158,216,144,4,37,51,26,38,98,248]},"announce":[],"urlList":[]}}