{"title":"VA-The_Real_Sound_Of_Chicago-2CD-2010-OMA","uid":6337117,"size":205590306,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3ba9172d784c93a98c127b8a8a5c9e526bf7e5ba&amp;dn=VA-The_Real_Sound_Of_Chicago-2CD-2010-OMA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MAFIAA.","files":27,"time":1303512779,"description":"ARTiST.. Various\nTiTLE... The Real Sound Of Chicago\nGENRE... Disco                  GRABBER. EAC\nLABEL... BBE                    ENCODER. Lame 3.98.4\nYEAR.... 2010                    QUALiTY. vbr 216kbps\nSOURCE.. CDDA                    MODE.... Joint-Stereo\nPLAYTIME 126:35 min              REL.DATE 04.22.2011\nTRACKS.. 24                      RiPPER.. TEAM OMA\nSiZE.... 195,10 MB              SUPPLiER TEAM OMA\n\n.. T R A C K  L i S T ..\n\nNR. TRACK.                                            TiME.\n\nCD1\n\n01  Premonition - Your Love Is In The Pocket          04:23\n02  Loveship - Love So New                            05:57\n03  Larry Houston - Promise (Instrumental Version)    06:12\n04  Lajohn &amp; Sheela - Too Far Gone                    05:32\n05  Yohon - B.T. (Boogie Terrestrial)                07:10\n06  Billy Hinton - A Challenge                        03:48\n07  Maxx Traxx - Don't Touch it                      04:44\n08  On Stage - Hooked On Your Love                    05:18\n09  Sidney Thomas - Look, Let's Make Love            03:53\n(And See If You Like It)\n10  Bilalian Express Feat. Paula &amp; Larry Henderson -  03:24\nDisco Nights\n11  Martin L. Dumas, Jr. - Attitude, Belief &amp;        09:47\nDetermination\n12  Ghalib Ghallab - School Days (Mr. Peabody's Edit) 07:09\n\nCD2\n\n01  Expo feat. J. Eliot Robinson - Road To Sunshine  04:37\n02  Gregory James - Happy Baby                        04:01\n03  Carmen Amez - Never Gonna Fall In Love Again      07:02\n(Like I Fell In Love With You)\n04  Tomorrow's People - Open Soul                    05:05\n05  The Moore Brothers - Bass Come Back              05:04\n06  Lonnie Givens - Runnin' To A Disco                06:22\n07  The Esquires - What Is Good Music                03:37\n08  Synergy feat. Jimmy Tillman - Can You Feel It    04:07\n09  Brighter Side Of Darkness - Disco Ball            04:30\n10  Fantasie - The Composer (Mr. Peabody's Edit)      05:54\n11  Cheryl Berdell - Fall In Love                    03:50\n12  Cold T - Funky Preacher (Mr. Peabody's Edit)      05:09\n\nTOTAL:126:35\n\n.. R E L E A S E  N O T E S ..\n\nChicago, A place known for its talent of\nmusicians across many genres of music. Soul,\nFunk, Rock, Jazz, Blues, etc. In modern times,\nChicagos dance floors have a worldwide\nreputation for House Music. Its a sound that\nhas pretty much reached to areas all across\nthe globe. In the Early developmental stages\nof the Chicago dance era (mid-late 1970s to\nearly 1980s), there were scores of musicians\nrecording dance music hoping to be the next\nmainstream success story. Well, for the\nartists on this compilation it didnt quit\nturn out that way. Instead, budget problems,\npolitics, being told, I dont like it, or\nsimply having the door slammed in their face,\nis what many of these artists were faced with\ninstead. Nevertheless, the musicianship those\nartists possessed by far equaled or defined\ninfinite status of what todays market call\nGood Music. Weve been distributing rare\ndance gems across the globe together now for a\nlittle over a decade. Being the music\nenthusiasts, that we are, 4 years ago, we\nopted to bring the art of record collecting to\na higher level. So, while walking down the\nstreet, we decided to open a record store. Mr.\nPeabody Records was the name we decided on.\nNow, The name doesnt quite fit 2 black guys\nfrom the South side of Chicago but according\nto our math, it worked, which it did. Weve\nspent many years traveling various\ndestinations, home and abroad in an effort to\nsnare every possible unique vinyl gem we came\nacross. We supported our massive record\ncollecting habit by selling a wide genre of\ncollectible vinyl globally to people of the\nsame passion. As far as us being dance floor\nDJs, our selections gravitates towards rare\nand unplaced dance material from the past,\nwith of course a few modern day exceptions. We\nare pretty strict in our programming so expect\nnothing but the best. Since the opening of our\nstore, weve acquired so much more. So much\nso, we decided to do a specialized compilation\nfor BBE. The first of its kind, highlighting\ndance floor material exclusively from the\nChicago area, mid 70s to early 80s. This\ncompilation is a musical insight to the black\nunderground dance material made in Chicago\nbefore house music kicked in. We call it, The\nReal Sound Of Chicago.\n\nPremonition  Definitely in a class of its\nown, this groovy, soulful, cosmic dance oddity\nby premonition has the sound that gains all\nthe attention on the dance floor. A perfect\nintroduction setting the tone for whats to\ncome on the rest of this compilation. Only a\nhandful of tracks from this release are\nbelieved to exist and ironically, it walked\nright through our doors on a summer day a few\nyears ago.\n\nLoveship  Hailing from the Southside of\nChicagos Cash Ear record label, this modern\nstyle dancer masterpiece by Loveship has it\nall. From an uplifting chorus with added\nseasoning from Angie Ditto on vocals, to the\ndeep rippling bassline from the band section.\nThis one seems to never end. The band\nconsisted of 3 guys and some females, a proper\nblend of talent put together to turn out a\nfantastic dance floor cut such as this one.\nRetrieved from a box of dusty albums sitting\nnext to furnace in a basement on the east side\nand finally reaching a proper home to the ears\nof deserving listeners.\n\nLarry Houston  We found our first copies of\nthis record 12years ago sitting in the bins of\na local record store on the north side amongst\na bunch of 80s commercial dance\ntwelve-inches. In those days, gems like this\nwould go undiscovered for months until we came\nalong. This stomping crossover disco record\nhas the word classic written all over it.\nBut, in the days of low budgets for promotion,\nit remained underground till years later.\n\nLajohn &amp; Sheela  We were surveying a few\nstorage units in the west suburbs of the city,\nwhich contained the remains of a popular large\nWestside bar that was popping from the late\n60s to early 80s. Amongst it we found,\nposters, bar stools, cooking equipment,\nspeakers, a Bozak mixer and more. After moving\nalong to the next unit, we found about 10,000\nrecords and in the 3rd storage unit and an\nadditional 3000 records. Buried within lied\nthis nice mellow boogie tune. Years later\nafter tracking down Lajohn, who is now a\npolice officer, we obtained other copies. An\nextraordinary tune of its time and definitely\na dance floor hit in our eyes.\n\nYohon - At the height of the E.T. phenomenon,\nthere many tracks made with the theme. A\nlittle after we met and teamed up, we visited\na good friend and now deceased dealer here in\nChicago named Art Morales. He was very well\nknown amongst 45 collectors. This day he had\nfound a load of 70s &amp; 80s dance singles.\nBeing that we were probably the only guys in\nthe city buying large loads of dance twelves\nat the time he turned them over to us.\nAmongst many rare gems on this skid was this\nmarvelous warm early 80s dance track.\nListening to it literally puts you into a\ncosmic dream. Most people back then would have\nplayed it and said Naaa, we said yeahhh.\nThis was a time when hardly anyone would\nappreciate the sound a record like this had to\noffer. Luckily, it made it into the right\nhands.\n\nBilly Hinton  This group of talented musician\nat the time headed by 25yo Billy Hinton, and\nconsisting two younger siblings 19yo Curtis\nand 17yo Beverly, combined to form the group\nBeige in the 70s to 80s. They bought aboard\nMaxine Gardner (introduced to them by Terry\nMarshall Of Maxx Traxx) to lay down the\nvocals. A fine job they did with this Chicago\nsoulful dance groove with the primary\narrangment being done by Keith Henderson Also\nOf Maxx Traxx. Billy did a fine job putting\neveryone together on this production. We\nobtained the first copies of this record from\na now long gone distributor from the South\nEast Side.\n\nMaxx Traxx  Formally known as the 70s Soul\ngroup Third Rail, this artist re-invented\nthemselves to roll out a dance tune with a\ncutting edge sound. Sharp, cutting, and\nscreaming synths throughout along with a\nblanket of joyous male vocals. We have many\nmemories of getting together down in Mikes\nbasement where we would jam it on regularly.\nIts a true Peabody anthem of sorts. Amazing\nhow in todays time, a record that wouldnt\neven sell at 7 would weigh in current times\nat over 300 Dollars. But with todays global\ninterest, its to be expected from a record of\nthis caliber.\n\nSidney Thomas  This release was Obtained from\na former musician Larry of a Chicago based\nrecord label. While sitting down having a\nchat, he said musicians would literally swap\neach others material and pass it along as a\nprimitive style of networking to get a buzz\ngoing amongst the Chicago natives. Look,\nLets Make Love is a really feel good track\nthat was released on the Chicago based east\nside independent label, Parallel Records. Its\na galloping disco tune with female vocals that\nwill seduce and gain all mens attention on\nthe dance floor. See if you like it.\n\nBillilian Express  Yet another discovery\namongst a rodent infested basement on the West\nside. Ever played a 45 that was off center a\nlittle bit? Well this one sounds similar but\nthe track was designed that way. It defines\nthe raw soulful experimentation where\nmusicians totally went against the grain to\ntry something new. Disco Nights is a really\ngroovy ride with strong blaring horn\nre-enforcement. A real dance floor blaster\nbrought to you by Likes Of Larry Henderson, a\nfigurehead and key producer on Chicagos\nunderground soul scene.\n\nMartin Dumas  This one is yet another rare\nfind amongst the more obvious of records\ncoming thru the shop. Attitude, belief, and\ndetermination give new definition to the term\nSpiritual with plenty of groove power packed\nbehind it. This track definitely is a down\ntempo soulful track that will have you assured\nthat good things are bound to happen, and it\nhas Anthem written all over it as well. Get\nready for 10 minutes of pure bliss.\n\nGhalib Ghallab - This selection was recorded\nat the Chicago Bulls Jazz Club In The Citys\nLincoln Park Area On The North side. The club\nwas literally underground in a basement with a\nsmoky dark culture with paintings along the\nwall. Ghallab was a Southside native attending\nChicagos Harlan High School. He had a natural\nknack for keyboards and played with ambient\nenergy. His style spanned across many genres\nof music, from soul to classical. Recorded in\n1981, this rare groove by Ghallab has a theme\nwe all can relate to. A really good summer\nsong with a fantastic sax solo from Dr. Edwin\nDaugherty.\n\nExpo  While checking out a record collection\nat a home in the Southsides Pullman district,\nthis guy brings out a few boxes of Lps that\nhad obviously been picked through. We asked\nhim, Do you have any other records that have\nnot been seen? He returns from a guest\nbedroom and replies, I found these while\ncleaning up a couple months ago. Turns out,\nthe records belong to his brother from New\nYork who had stayed with him for a short time\nin the 80s. The very odd thing is that the\n45s were all in sleeves and in immaculate\nshape, much different than the Lps he had\njust previously showed us. Amongst the\nselection of mostly independent 45s was this\nunique spin. Another independent early 80s\nboogie bomb tune from a Local group named\nExpo. A very bright and moving track with the\nvocals being laid down by J. Elliot Robinson.\nThis inspirational track quickly became one of\nour dance floor favorites.\n\nGregory James  This oddity on the Kelli-Arts\nlabel later fell along the way side to the\nlabels more popular group, Magnum Force. This\ngroup was a collaboration between 2 Guys,\nGregory Bibb and James Norris. A very smooth\nand sophisticated disco release with warm\nhorns, nice keys, and excellent complimentary\nfemale vocals. The break goes into a groove\nthat has a soulful trance like element to it.\nWe had this record in the shop from time to\ntime, and it fell on the deaf ears and went\nneglected for the most part. Maybe it wasnt\nplayed loud enough. However, we always loved\nit. Now if anyone goes to retrieve this tune\nother than this compilation, they're most\nlikely going to have to pay from this point\non.\n\nCarmen Amez  Classic soap opera disco but\narranged right Heres the story -We were in a\nwarehouse in the Midwest around 11 years ago.\nWe were in separate areas going through skids\nof vinyl, Mike yells out from the other side\nI Bet This Ones Tight. He broke out the\nportable player and dropped the needle on the\ndisc. We both started laughing. A very common\nreaction when we found what we called a Cut.\nThis one turned out to be a fantastic disco\ntrack with a break that will leave you mouth\nhanging open to the floor.\n\nTomorrows People  This maximum disco/funk\nhead nodder from the Stage Productions label\nis very sought after on the collectors scene\nat this moment. Our gift to you The band\nconsisting of 6 brothers got together to\nconceive this awesome masterpiece Open Soul.\nSeven minutes of deep funky basslines,\nscreaming vocals, and fantastic instrument\nsolos will leave you mesmerized. The original\ntrack on the Rare 6 Track Lp is timed at\naround 20 Minutes (One Entire Side Only).\nWeve shortened it here to save space on this\ncomp, and of course to give the collectors\nsomething to dig for. Dont worry this 7min\nversion will do more than wet your whistle.\n\nThe Moore Brothers (Debut 1st Release)  One\nday all is going as normal in the shop. Then,\nan elderly lady shows up with a box of Gospel\nLPs, mostly Savoy label stuff and some\nvarious others. Literally, right in the middle\nof the box we were going through, there was a\nsolid white cardboard sleeve. We immediately\npulled it out and inside turned out to be\nacetate titled, The Moore Brothers. Being\nthat Chicago had many Moores we really\ndidnt have the confidence in finding the\nmakers of the material. So by initiating some\nhard work and bouncing from person to person,\nwe found Mr. Moore right here in Chicago. He\ninformed us that the acetate in our possession\nwas the only existing copy of the recording,\nwhich originally belonged to their former\nmanager. He stated again We did some 45s but\nthis one was never made it to press, the\noriginal tape was destroyed by accident after\nwe recorded it. After playing the track for\nhim, he added, Wow, I never heard this after\nwe recorded it. Hes positive that this\nacetate we possess is the only existing copy\nin the world. So there you have it, from the\nPeabody Archives To You Ears. Weve restored\nthe disc to the best of our abilities. Enjoy\n\nPick Of The Liter  Over repetition is\nsomething most music lovers agree is a pet\npeeve. This selection is most likely the\nexception to the rule, and on the dance floor,\nit will bring a phenomenal response. This\nintense rare 70s disco treasure under the\nproduction of Lonnie Givens is definitely one\nthat sends you runnin though a wall, to get to\nthe disco, to hear it Plenty of percussion,\nsynthesizers, keys, and screaming voices make\nup this track. A Fairly simple make-up, but it\ndefinitely has a mind blowing sound.\n\nEsquires  The make-up of this northern\nChicago region release by the esquires is the\nanswer to the title, What is good music. A\nPercussive drum section, with smooth warm\nlayovers of synths and harmony amongst the\nvocals, which is reminiscent of the doo-wop\nera sound. A grossly underrated track for the\ngreat sound that it consumes. Success was\nhalted after marketing and promotion came to\nan unexpected stop. We still find copies of\nthis from time to time but in todays growing\npopularity of collecting independent media, it\nwont last for long.\n\nSynergy  While going through the basement of\na former record store some 8 years ago, we\nobtained our first copies of this disco-funk\nrarity made by a husband and wife team. This\nsouth-side couple along with some musicians\nconceived this pumping disco track. It\nliterally winds up at the beginning then its\noff to the party. An overly amplified\nsynthesizer is heard busting in and out of the\ntrack, which adds more definition. This title\nis pretty much to the point of extinction and\nis yet another long time favourite of ours.\n\nBrighter Side Of Darkness  Lennie Lacour\ncollaborated with this Chicago Group to add a\nDisco Ball to the Magic Touch Arsenal.\nAlthough the label had a moderate sized\ncatalog for an independent label. Scarce\ndemand prevented many of the titles from\nearning the status Successful. This up-tempo\nrunner caught our ear as an exceptional dance\nfloor piece. We found the first copies around\n9 years ago. We played hooky from our 9-5 jobs\nto check out a collection at a residence in\nK-Town. We showed up at the front porch,\nintroduced ourselves, and the guy tells us,\nOne Minute, he went back inside and came out\nwith 2 boxes of records a couple of smaller\nbox 45s. He had 10 copies of this and some\nother various releases from the label.\n\nFantasie  Our first copy of this production\nwas obtained from the basement of a drug store\n(formally a record shop years earlier) on the\nsouth side. At an earlier time in Chicago, it\nwas not uncommon to see records amongst a loaf\nof bread and some cough syrup. Back in the\ndays records were very plentiful in most\nbusinesses, until cds took their place. Many\npeople over look tons of great records because\nthey simply didnt let the track play long\nenough. In the Case of The Composer, It starts\nas classical piano and ends with the sound of\na circus themed soundtrack. Whats in between\nis what we describe as The Sound.\n\nCheryl Berdell  We had recently had our\noutdoor overhead sign installed and were\ninside doing construction preparing for our\ngrand opening. A guy knocks on the door and\nask, Are you guys open? we replied No.\nNoticing he had a box of vinyl, we let him in\nto take a look, which brought us this\nselection  More classic soap opera disco done\nright By the make-up of this selection, it\nwould make a fantastic climax but an even\nbetter closing track that will leave everyone\nwanting more. The sound of the sixties and\nseventies has never been so sought after as at\nthe present moment. You could even argue that\nmodern music just isn't good enough. As\nevidence consider this: contemporary producers\nand artists are often looking back to get\ninspired (insert staggering number of examples\nhere) so you can safely say that even in this\ndigital age the beating heart of modern R&amp;B\nand hip-hop is still vintage soul, funk and\njazz.\n","torrent":{"xt":"urn:btih:3ba9172d784c93a98c127b8a8a5c9e526bf7e5ba","amp;dn":"VA-The_Real_Sound_Of_Chicago-2CD-2010-OMA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ba9172d784c93a98c127b8a8a5c9e526bf7e5ba","infoHashBuffer":{"type":"Buffer","data":[59,169,23,45,120,76,147,169,140,18,123,138,138,92,158,82,107,247,229,186]},"announce":[],"urlList":[]}}