{"title":"Resource Hacker","uid":10697050,"size":748246,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3d2674d89bd271139d1fd72f9c6348572b24545f&amp;dn=Resource+Hacker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AppTeam","files":1,"time":1407182237,"description":"Resource HackerTM is a freeware utility to view, modify, rename, add, delete and extract resources in 32bit &amp; 64bit Windows executables and resource files (*.res). It incorporates an internal resource script compiler and decompiler and works on all (Win95 - Win7) Windows operating systems.\n\nViewing Resources: Cursor, Icon, Bitmap, GIF, AVI, and JPG resource images can be viewed. WAV and MIDI audio resources can be played. Menus, Dialogs, MessageTables, StringTables, Accelerators, Delphi Forms, and VersionInfo resources can be viewed as decompiled resource scripts. Menus and Dialogs can also be viewed as they would appear in a running application.\n\nSaving Resources: Resources can be saved as image files (*.ico, *.bmp etc), as script files (*.rc), as binary resource files (*.res), or as untyped binary files (*.bin).\n\nModifying Resources: Resources can be modified by replacing the resource with a resource located in another file (*.ico, *.bmp, *.res etc) or by using the internal resource script compiler (for menus, dialogs etc). Dialog controls can also be visually moved and/or resized by clicking and dragging the respective dialog controls prior to recompiling with the internal compiler.\n\nAdding Resources: Resources can be added to an application by copying them from external resource files (*.res).\n\nDeleting Resources: Most compilers add resources into applications which are never used by the application. Removing unused resources can reduce an application's size.\n","torrent":{"xt":"urn:btih:3d2674d89bd271139d1fd72f9c6348572b24545f","amp;dn":"Resource+Hacker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d2674d89bd271139d1fd72f9c6348572b24545f","infoHashBuffer":{"type":"Buffer","data":[61,38,116,216,155,210,113,19,157,31,215,47,156,99,72,87,43,36,84,95]},"announce":[],"urlList":[]}}