{"title":"A Critical Rewriting of Global Political Economy.pdf","uid":3394402,"size":2092362,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e9482d18cc1a314591a4d66acdb3efbb668e4c9&amp;dn=A+Critical+Rewriting+of+Global+Political+Economy.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"switchblade424","files":1,"time":1128896050,"description":"Peterson, V. Spike 2003: \n&quot;A critical rewriting of global political economy; integrating reproductive, productive, and virtual economies&quot;, Routledge \n\n***********************\nMoving beyond a narrow definition of economics, this pioneering book advances our knowledge of \nglobal political economy and how we might critically rspond to it. \n \nTwo features of the global economy increasingly determine everyday lives worldwide. The first is \nexplosive ggrowth in financial markets that shapes business decision-making and public policy-making, \nand the second is dramatic growth in informal and flexible work arrangements that shapes \nincome-generation and family well-being. These developments, though widely recognized, are rarely \nanalyzed as inextricable and interacting dimensions of globalization. Using a new theoretical model \nPeterson demonstrates the interdependence of reproductive, productive, and virtual economies, \nand analyzes inequalities of race, gender, class, and nation as structural features of neoliberal \nglobalization.\n\nPresenting a methodologically plural, cross-disciplinary, and well-documented account of globalization, \nthe author integrates marginalized and disparate features of globalization to provide an accesible \nnarrative from a postcolonial feminist vantage point. \n \n- V. Spike Peterson is an Associate professor in the Department of Political Science at the University of \n  Arizona. She is the editor of &quot;Gendered States&quot; and the co-author (with Anne Sisson Runyan) of &quot;Global \n  Gender Issues&quot;. \n\n**************************\n\nKeep on sharing, people! \n\n---------------------------\n\nLSC is a new re-releasegroup. Our goal is to re-release/re-seed .torrents which has died in the enormous informationflow on the internet.\nWe will never claim to have done any new releases, because that is not our goal.\n\nWe will work for emancipating knowledge for everyone, so that students and information-loving people will have full access to texts, ebooks and written knowledge in general, therefore we feel that it is necessary that somebody constantly re-seeds relevant material. Our primary target is danish students, which is why we have chosen to pre-fix all of our re-releases with &quot;vidensdeling&quot;.\nVidensdeling.nu is a new danish site which tries to politicise the practise of students sharing knowledge, information and e-books by digital means. \nWe encourage all danish users to support the project.\n\n\nWe will however will point out that we have *nothing* to do with Piratgruppen or Vidensdeling.nu, except for the common goal of keeping information free and available for everyone to share.\n\nHowToUseBitTorrent (in danish): http://www.piratgruppen.org/piratviden/article.php3?id_article=11\n\n\n\n** CREDITS: **\n** - Everybody that scans&amp;shares their books: for using bandwidth and time for other peoples pleasure **\n** - Piratgruppen: for making Vidensdeling.nu **\n** - The danish publishers organization: for beeing so reasonable **\n** - The danish AntiPiracyGroup: for beeing such fucking wankers **","torrent":{"xt":"urn:btih:3e9482d18cc1a314591a4d66acdb3efbb668e4c9","amp;dn":"A+Critical+Rewriting+of+Global+Political+Economy.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e9482d18cc1a314591a4d66acdb3efbb668e4c9","infoHashBuffer":{"type":"Buffer","data":[62,148,130,209,140,193,163,20,89,26,77,102,172,219,62,251,182,104,228,201]},"announce":[],"urlList":[]}}