{"title":"[NubileFilms] Paula (Fucked Hard / 10.11.2013)","uid":9054043,"size":328618887,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3eb67069fe5a7bd6947c80569a760e42c2bac1ca&amp;dn=%5BNubileFilms%5D+Paula+%28Fucked+Hard+%2F+10.11.2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1381919147,"description":"[NubileFilms] Paula (Fucked Hard / 10.11.2013)\n\nAnticipating a romantic afternoon with her man, Paula collects flowers and then goes to meet Dan where he waits on the outdoor patio. Dan can't wait to get their sexual interlude started; he pulls Paula's miniskirt until her bald twat and lush breasts are uncovered, and then settles Paula on the beanbag chair he just occupied to give his woman a long pussy licking and fingering.\n\nThe brunette babe can't stop moaning and rubbing her breasts as her man works his oral magic on her. Her fingers pinch her rock hard nipples before curling into Dan's hair to keep him exactly where she needs him to be. Eventually his efforts pay off as Paula cums around his fingers with a low moan of pleasure.\n\nStanding up and slipping off her dress, the cock craving sweetie sinks to her knees and takes her man's large bulge in her mouth. She uncovers her erect treat with a smile and settles back onto the beanbag to get comfortable for a hot blowjob. Her mouth and hands work in tandem to deliver amazing sensations to her boyfriend's engorged cock.\n\nDan doesn't want to blow his load before he gets his woman off again, so he pulls Paula onto her feet and turns her around. The blunt head of his dick finds a welcoming warmth as he slides into Paula's tight sheathe and thrusts hard enough to make her full boobs shake.\n\nUnable to keep his hands off of Paula's bountiful breasts, Dan pulls her up to stand up from her bent position so that he can caress and massage her tits as he continues to penetrate her.\n\nThe couple shifts positions so that Paula is seated atop her boyfriend to ride him reverse cowgirl style. The shift hits her g-spot perfectly so that with a few minutes of hard pumping Paula gasps a second orgasm. Dan is not far behind, pulling out of his tight wetness just in time to spill his seed all over Paula's flat belly.\n\nSated, the couple engages in a long erotic kiss as they enjoy the moments after their love.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=bjuc65ytlvxvq94bveie.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=bjuc65ytlvxvq94bveie.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=wopvbmu67xc0ekb3ry25.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=wopvbmu67xc0ekb3ry25.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:3eb67069fe5a7bd6947c80569a760e42c2bac1ca","amp;dn":"%5BNubileFilms%5D+Paula+%28Fucked+Hard+%2F+10.11.2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eb67069fe5a7bd6947c80569a760e42c2bac1ca","infoHashBuffer":{"type":"Buffer","data":[62,182,112,105,254,90,123,214,148,124,128,86,154,118,14,66,194,186,193,202]},"announce":[],"urlList":[]}}