{"title":"The Great Sea - David Abulafia  (Unabridged)","uid":9679200,"size":847773736,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3fdf6863a4b3da1d3a167a47add3f94292cad80d&amp;dn=The+Great+Sea+-+David+Abulafia++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Robin1966","files":5,"time":1393631281,"description":"Audio Books : History : MP3/128Kbps : English\n\n\nSituated at the intersection of Europe, Asia, and Africa, the Mediterranean Sea has been for millenia the place where religions, economies, and political systems met, clashed, influenced, and absorbed one another. David Abulafia offers a fresh perspective by focusing on the sea itself: its practical importance for transport and sustenance; its dynamic role in the rise and fall of empires; and the remarkable cast of characters - sailors, merchants, migrants, pirates, pilgrims - who have crossed and recrossed it.\n\n\nRanging from prehistory to the 21st century, The Great Sea is above all the history of human interaction across a region that has brought together many of the great civilizations of antiquity as well as the rival empires of medieval and modern times.\n\nInterweaving major political and naval developments with the ebb and flow of trade, Abulafia explores how commercial competition in the Mediterranean created both rivalries and partnerships, with merchants acting as intermediaries between cultures, trading goods that were as exotic on one side of the sea as they were commonplace on the other. He stresses the remarkable ability of Mediterranean cultures to uphold the civilizing ideal of convivencia, &quot;living together&quot;, exemplified in medieval Spain, where Christian theologians studied Arabic texts with the help of Jewish and Muslim scholars, and traceable throughout the history of the region.\n\nBrilliantly written and sweeping in its scope, The Great Sea is itself as varied and inclusive as the region it describes, covering everything from the Trojan War, the history of piracy, and the great naval battles between Carthage and Rome to the Jewish Diaspora into Hellenistic worlds, the rise of Islam, the Grand Tours of the 19th century, and mass tourism of the 20th. It is, in short, a magnum opus, the definitive account of perhaps the most vibrant theater of human interaction in history.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:3fdf6863a4b3da1d3a167a47add3f94292cad80d","amp;dn":"The+Great+Sea+-+David+Abulafia++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fdf6863a4b3da1d3a167a47add3f94292cad80d","infoHashBuffer":{"type":"Buffer","data":[63,223,104,99,164,179,218,29,58,22,122,71,173,211,249,66,146,202,216,13]},"announce":[],"urlList":[]}}