{"title":"Coast to Coast AM June 18, 2013 - Exopolitics &amp; Contact","uid":8620384,"size":56633476,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:40a8ae6dc91dc6c8d2b7a187d10746b650dcf3b0&amp;dn=Coast+to+Coast+AM+June+18%2C+2013+-+Exopolitics+%26amp%3B+Contact&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1372354145,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\ndate:\n06-18-13\nHost:\nGeorge Noory\nGuests:\nMichael E. Salla,                   Earnest  Cobb\nPioneer in the development of 'Exopolitics,' Michael Salla discussed evidence of contact that is surfacing through major international agencies such as the Vatican, as well as the issue of diplomacy with ETs. In terms of negotiations with extraterrestrials who have been visiting our world for decades, he advocated a style of conflict resolution called Track II diplomacy, in which non-officials such as activists, scholars, and private citizens engage in dialogue, and propose solutions. Though ETs and various governments have reached agreements in the past, this has led to problematic cover-ups and abductions, and the general public has been left out of the secretive negotiating process, Salla noted.  \nHe believes that some 19 different ET civilizations have been intervening on Earth, many of whom are more human-appearing than the &quot;Greys&quot; that are often associated with the idea of aliens. Some of these groups have tried to bypass the governmental talks and reach out directly to people, and their efforts date all the way back to the contactee era of the 1950s, Salla suggested. For example, the 'Friendship' case in Italy encompassed a 22-year period (1956-1978) in which human-looking ETs, who were living in an underground base, had ongoing liaisons and discussions with over 100 people, and shared their galactic knowledge with them. One of the lead contactees, Bruno Sammaciccia, led efforts to help the ETs by providing them with supplies and food, Salla recounted. \nAnother intriguing case involved a Colombian named Enrique Castillo Rincon who was said to meet with a Jesus-like ET in the Andes, along with about 20 other contactees. The Vatican has been moving toward an acceptance of ETs, and may be preparing to announce their presence, Salla reported, adding that the Catholic Church could benefit and become more popular by embracing a type of expansive spirituality that includes ETs in a kind of brotherhood. Salla also announced his new project ExoNews, in which he presents concise video reports on YouTube (watch a sample episode here). \nSlot Machine Guru\nFirst hour guest, Earnest Cobb, who has won over $10.3 million in slot machine jackpots since 2005, talked about luck and gaming. Known as the 'Slot Guru,' he said he focuses on winning so that he can give money away to elderly casino patrons and others. &quot;I'm really addicted not to gaming, but to giving,&quot; he remarked. Cobb detailed how he plays 6 or 7 slot machines at the same time, and chooses ones that have the largest payouts. &quot;When you go to the casino, the quickest way for you to lose is to think you're going to lose. You've got to be able to train your mind to alleviate that,&quot; he advised. \nNews segment guests: Douglas Hagmann, Jim Berkland \nWebsite(s):\n exopolitics.org\n ExoNews.tv\n theslotguru.com\nBook(s):\n Galactic Diplomacy\n Exposing U.S. Government Policies on Extraterrestrial Life\n Exopolitics: Political Implications Of The Extraterrestrial Presence\n The Secrets to Hitting More Jackpots\n","torrent":{"xt":"urn:btih:40a8ae6dc91dc6c8d2b7a187d10746b650dcf3b0","amp;dn":"Coast+to+Coast+AM+June+18%2C+2013+-+Exopolitics+%26amp%3B+Contact","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40a8ae6dc91dc6c8d2b7a187d10746b650dcf3b0","infoHashBuffer":{"type":"Buffer","data":[64,168,174,109,201,29,198,200,210,183,161,135,209,7,70,182,80,220,243,176]},"announce":[],"urlList":[]}}