{"title":"Dark Vengeance","uid":4511066,"size":71402421,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4230bae5012397a2eeb48f1644d745326a46dc2f&amp;dn=Dark+Vengeance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hound1234","files":29,"time":1226779079,"description":"The storyline is pretty cool. A looong time ago the Humans were at war with the Elves. Just when it seemed sure that the Elves were going to wipe out all of humanity, a group called the High Council stepped in and laid down a badass curse. Basically they used a powerful spell to set it so that the sun would flame every Elf it hit (If they could lay down magic that heavy it make you wonder why they hadn't done it a LOT sooner). Somebody tipped off the Elves though, and they were teleported to a dark isle where they could sit and plot their revenge. Skip to present day (okay, present day for the game). An eclipse of the sun has frozen in the sky and the Elves (now called Dark Elves) are rampaging the land getting revenge for all those years of darkness (Dark Vengeance... get it?). You, personally injured by the actions of the monsters are looking to stop the eclipse and get even in the process. \n\nUnlike most third-person games, Dark Vengeance gives you a choice of three different characters to play - Nanoc the Gladiator, Kite the Trickster, and Jetrel the Warlock. The Gladiator, as you might expect, is a burly warrior who has access to the most powerful hand-to-hand weapons. The Trickster, Jetrel has several very fast attacks and great jumping ability. Finally there's the Warlock, a hideously scarred mage who has loads of distance attacks at his disposal. Each of the characters has their own basic advantages and disadvantages, and in the end, I found the three to be remarkably well balanced in their abilities. \n---------This is a old game.Made in 1998 by Reality Bites","torrent":{"xt":"urn:btih:4230bae5012397a2eeb48f1644d745326a46dc2f","amp;dn":"Dark+Vengeance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4230bae5012397a2eeb48f1644d745326a46dc2f","infoHashBuffer":{"type":"Buffer","data":[66,48,186,229,1,35,151,162,238,180,143,22,68,215,69,50,106,70,220,47]},"announce":[],"urlList":[]}}