{"title":"Frank Zappa - Tinseltown Rebellion TQMP","uid":5148505,"size":499596441,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:42499cf2d912de54203037f07a9006ab4f4d726f&amp;dn=Frank+Zappa+-+Tinseltown+Rebellion+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":32,"time":1257416244,"description":"An uneven, nearly all-live double-record set, Tinseltown Rebellion mixes new material and versions of Zappa oldies like &quot;Love of My Life,&quot; &quot;I Ain't Got No Heart,&quot; &quot;Tell Me You Love Me,&quot; &quot;Brown Shoes Don't Make It,&quot; and a reworked &quot;Peaches en Regalia,&quot; titled &quot;Peaches III.&quot; These songs, as well as the band's stellar instrumental work, provide the album's best moments. Elsewhere, the title track is an only partially accurate satire of punk; Zappa's intentionally smarmy crowd banter is featured on &quot;Dance Contest&quot; and &quot;Panty Rap,&quot; the latter a bit involving the collection of female audience members' underwear. More problematic is the sometimes violent sexual juvenilia of songs like &quot;Fine Girl,&quot; &quot;Easy Meat,&quot; &quot;Pick Me, I'm Clean,&quot; and &quot;Bamboozled by Love&quot;; if, as Zappa insisted, this part of his oeuvre simply mixes dumb fun and satire of both sexes' peccadillos, with no underlying misogyny, it's rather difficult to tell.\n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:                         &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\t\t\t","torrent":{"xt":"urn:btih:42499cf2d912de54203037f07a9006ab4f4d726f","amp;dn":"Frank+Zappa+-+Tinseltown+Rebellion+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42499cf2d912de54203037f07a9006ab4f4d726f","infoHashBuffer":{"type":"Buffer","data":[66,73,156,242,217,18,222,84,32,48,55,240,122,144,6,171,79,77,114,111]},"announce":[],"urlList":[]}}