{"title":"[Israel] Against Our Better Judgment - Alison Weir","uid":11389789,"size":2853802,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:424b302cc0031f1154837d0b6e14be96f832b759&amp;dn=%5BIsrael%5D+Against+Our+Better+Judgment+-+Alison+Weir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":6,"time":1415309539,"description":"Against Our Better Judgment: The Hidden History of How the U.S. Was Used to Create Israel\n\n***** rating on Amazon\n\nAlison Weir's site:  \nIf Americans Knew: What every American needs to know about the Israeli Assault on Palestine &lt;a href=&quot;\nhttp://www.ifamericansknew.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ifamericansknew.org/&lt;/a&gt;\n\n&quot;Prodigiously documented... Alison Weir must be highly commended for throwing such a brilliantly hard light on the relationship between the United States and Israel. I hope this marvelous book gets all the attention it deserves.&quot; - Ambassador Andrew Killgore, Publisher, Washington Report on Middle East Affairs.\n\n Soon after WWII, US statesman Dean Acheson warned that creating Israel on land already inhabited by Palestinians would &quot;imperil&quot; both American and all Western interests in the region. Despite warnings such as this one, President Truman supported establishing a Jewish state on land primarily inhabited by Muslims and Christians.\n\nFew Americans today are aware that US support enabled the creation of modern Israel. Even fewer know that US politicians pushed this policy over the forceful objections of top diplomatic and military experts.\n\nAs this work demonstrates, these politicians were bombarded by a massive pro-Israel lobbying effort that ranged from well-funded and very public Zionist organizations to an &quot;elitist secret society&quot; whose members included Supreme Court Justice Louis Brandeis.\n\nAGAINST OUR BETTER JUDGMENT brings together meticulously sourced evidence to illuminate a reality that differs starkly from the prevailing narrative. It provides a clear view of the history that is key to understanding one of the most critically important political issues of our day","torrent":{"xt":"urn:btih:424b302cc0031f1154837d0b6e14be96f832b759","amp;dn":"%5BIsrael%5D+Against+Our+Better+Judgment+-+Alison+Weir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"424b302cc0031f1154837d0b6e14be96f832b759","infoHashBuffer":{"type":"Buffer","data":[66,75,48,44,192,3,31,17,84,131,125,11,110,20,190,150,248,50,183,89]},"announce":[],"urlList":[]}}