{"title":"Device Bondage--DB-31174 Bailey Blue WMV","uid":8599645,"size":770247748,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:435889c903ae4922ae82f3e37e7498771ef3d016&amp;dn=Device+Bondage--DB-31174+Bailey+Blue+WMV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1371851955,"description":"Claire Adams vs Bailey Blue\n\nJun 21, 2013 - Performers: Bailey Blue \n\n\nWMV only. MP4 + Pics later.\n\n\nStrikingly beautiful but very shy Bailey has agreed to a day with me on Device. Impressed by her interest in pain and natural flexibility her day is centered around both. A recipe for the perfect storm in favor of me.\n\nBailey begins moderately laced in a tight fitting corset, ballet boots, and high reaching posture collar. Her ankles are trapped open, making it impossible to close her legs, but everything looks much too loose. With my boot on her ass, I pull the laces of her corset closed and adjust the turnbuckle on her posture collar from tolerable to unreasonable. Her hair is then bound to a thick metal hook inserted into her ass. Her hands are pried open with pieces of metal, finger by finger. Everything is exposed and she is helpless to the torment that awaits.\n\nSecond, I like dressing my bitches up. The more exotic they are, the more beautiful they become. In latex stockings, heels, garter, tight leather choking collar and the single leather armbinder, she is bent back over very uncomfortable metal. Her nipples beg for attention and snake bite suction tubes suck them up to attention. Today she gets to be tormented by electricity, I do wonder how she is going to respond. She's tough... but how tough?\n\nFinally Bailey in installed in the Scavenger's Daughter, an apparatus created in the era of Henry VIII, but with an upgrade. A long metal rod is added to keep her arms nice and open. She likes pain... so now its time to play and see what she can take. Once satisfied with her being pushed to the limit, she is laid on her back (the rightful place of all sluts) and thoroughly fucked. First in the ass, then in the pussy, then in the pussy and the ass. All of her holes are filled. She screams of ecstasy even while in a hellish metal device; desperately, clinging to the pleasure.\n\nScreens &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=31174&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=31174&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:435889c903ae4922ae82f3e37e7498771ef3d016","amp;dn":"Device+Bondage--DB-31174+Bailey+Blue+WMV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"435889c903ae4922ae82f3e37e7498771ef3d016","infoHashBuffer":{"type":"Buffer","data":[67,88,137,201,3,174,73,34,174,130,243,227,126,116,152,119,30,243,208,22]},"announce":[],"urlList":[]}}