{"title":"KnowMads - River Runs Deep","uid":7168093,"size":5679094,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:44ded6f5b97aba787a666b6b327fe2313d823f1d&amp;dn=KnowMads+-+River+Runs+Deep&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"beauuu.","files":-1,"time":1333851068,"description":"KnowMads grew up in Seattle and have been making music for the past 7 years. Tom &quot;Pepe&quot; and Tom &quot;Cheef&quot; Wilson are the MC's and &quot;Jester&quot; Judd makes the beats. At age 21, the KnowMads have independently released 4 albums and two mixtapes, performed in over 200 shows, shared the stage with the likes of Nappy Roots, Andre Nickatina, Blue Scholars, Macklemore, OneBeLo and Zion I, as well as built a strong independent following that is rapidly expanding out of the Pacific NW to global audiences who represent the KnowMadicFamily.\n\n&quot;TheKnewBook&quot; coming this Spring will be the 5th full-length album from the KnowMads. Featuring local artists Sol, Loon, and La as well as national spitters Ras Kass, Smoke DZA, and Devin The Dude's Coughee Brothaz... The beats have a unique sound which paints with deep texture; the lyrics are passionate and sharp. Jester's eclectic palette keeps you nodding to West Coast and Dilla influenced jams as well as some Jazz influenced cuts such as &quot;BreakThrough&quot; (featuring Seattle singer Mario Sweet and local legend Chev) while up and coming solo violinist Peter Lee Johnson composes the outro on &quot;RainyNight&quot;, this is the KnowMads most balanced and developed project so far. The feel is classic hip hop with a NW soul.\n\n1. KnowMads - River Runs Deep","torrent":{"xt":"urn:btih:44ded6f5b97aba787a666b6b327fe2313d823f1d","amp;dn":"KnowMads+-+River+Runs+Deep","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44ded6f5b97aba787a666b6b327fe2313d823f1d","infoHashBuffer":{"type":"Buffer","data":[68,222,214,245,185,122,186,120,122,102,107,107,50,127,226,49,61,130,63,29]},"announce":[],"urlList":[]}}