{"title":"Garth Ennis' War Story (Complete) [English]","uid":8025695,"size":173989681,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:459fd6b8e1e8372c9bba4a9ca2633c16963a1968&amp;dn=Garth+Ennis%27+War+Story+%28Complete%29+%5BEnglish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hamster-X","files":-1,"time":1358302174,"description":"English | CBR \n\nWriter: Garth Ennis\n\nIncludes the complete collection (2 series of 4 issues each).\n\n\n**Series 1**\n\n\n\nJohann's Tiger\n\nIn the final days of World War Two the commander of a Tiger tank tries to save his men by convincing them to desert so they may surrender to the Americans before they are killed fighting the Soviets.\n\nWith pencils by Chris Weston and inks by Gary Erskine.\n\n\n\nD-Day Dodgers\n\nA young British officer is assigned to the Italian campaign. Once there he finds that their sacrifices are being ignored at home in favour of news about the battle in France and a massive, possibly suicidal, push is planned to attract headlines.\n\nWith art by John Higgins.\n\n\n\nScreaming Eagles\n\nIn the last days of the war four American soldiers, all that remains of their company, are sent to secure a mansion to be used as a General's head quarters. Once there they find Nazis have been storing a fortune in stolen artworks, antiques and valuables. The men decide to enjoy themselves for a few days before they have to return to the front.\n\nWith art by Dave Gibbons.\n\n\n\nNightingale\n\nNarrated by her executive officer, The Nightingale is a ship assigned to escort convoys on the Murmansk Run. When they are given foolish orders that lead to ships under their care being lost she gets a reputation as cursed. Her crew are forced to make the ultimate sacrifice to set things right.\n\nWith art by David Lloyd.\n\n\n\n**Series 2**\n\n\n\nThe Reivers\n\nA story of the SAS in North Africa. Conflict begins between the groups Commanding Officer and his second in command when it seems the former is more interested in satisfying his lust for blood and glory than fighting a war.\n\nWith art by Cam Kennedy.\n\n\n\nJ for Jenny\n\nA British pilot hopes to take revenge on the Germans who killed his family by bombing civilian targets but his co-pilot is more of a pacifist who sees their missions as a necessary evil. Their conflict leads to brawling and eventually threatens to destroy the crew when they're shot down over Germany.\n\nWith art by David Lloyd.\n\n\n\nCondors\n\nSet towards the end of the Spanish Civil War, four soldiers from different sides and different countries seek shelter in a shell hole during a battle. Unarmed, they each tell their stories for entering the war to pass the time.\n\nWith art by Carlos Ezquerra.\n\n\n\nArchangel\n\nAn RAF pilot is assigned to a Cam Ship as part of a string of unfortunate luck. But his experiences make him realize he shouldn't put off living his life just because he might die at any moment.\n\nWith art by Gary Erskine.\n\n\n\n\nEnjoy and seed!\t","torrent":{"xt":"urn:btih:459fd6b8e1e8372c9bba4a9ca2633c16963a1968","amp;dn":"Garth+Ennis%27+War+Story+%28Complete%29+%5BEnglish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"459fd6b8e1e8372c9bba4a9ca2633c16963a1968","infoHashBuffer":{"type":"Buffer","data":[69,159,214,184,225,232,55,44,155,186,74,156,162,99,60,22,150,58,25,104]},"announce":[],"urlList":[]}}