{"title":"40 Lessons for the Club Player: A Proven Course in All Aspects o","uid":7606366,"size":8038455,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:45bd93c0b1765ccbcbd126be7e39e6347692c88f&amp;dn=40+Lessons+for+the+Club+Player%3A+A+Proven+Course+in+All+Aspects+o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1346955455,"description":"40 Lessons for the Club Player: A Proven Course in All Aspects of Chess\n\n\nThis is a well written book that is fun and easy to read. The lessons are relatively short (a typical lesson may run 3-5 pages and contain approximately 3 games).\n\nThe lessons are supposedly designed for players rated between 1750 and 2050. Although in my opinion, a motivated 1500 player would still be able to gain a great deal by reading this book.\n\nThe lessons cover openings, strategy, tactics, endings (heavy emphasis on this topic), history, and middlegame plans and analysis.\n\nI personally enjoyed the &quot;bite size&quot; nature of the lessons - each lesson could be enjoyed, savored, and pondered over in one sitting.\n\nThe type font, diagrams, and level of explaination are all excellent. This book has just the right mix of analysis versus verbal descriptions of what is going on in a given position. I get lost in books that are too heavy on long strings of endless variations - this book is not like that at all. It has a good mix of good, plain old english describing the action.\n\nA sampling of some of the specific topics are; classic bishop sacrifice on h7, the seven evaluation principles, how to draw a pawn down in a rook ending, how to parry a flank attack, open vs. closed positions, attacking the uncastled king, when the kings have both castled on the same side, when the kings have castled on opposite sides, etc.\n\nMost of the lessons start of with a little history regarding a certain player (very interesting) and then follows up with a specific concept illustrated by 2 to 4 games.\n\nAll in all, this book is a good follow up book after a player has read a couple of more elementary treatises.\n &lt;a href=&quot;\nhttp://www.amazon.com/40-Lessons-Club-Player-Aspects/dp/0713452811/ref=sr_1_1?ie=UTF8&amp;qid=1346947740&amp;sr=8-1&amp;keywords=40+lessons+for+the+club+player&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/40-Lessons-Club-Player-Aspects/dp/0713452811/ref=sr_1_1?ie=UTF8&amp;qid=1346947740&amp;sr=8-1&amp;keywords=40+lessons+for+the+club+player&lt;/a&gt;","torrent":{"xt":"urn:btih:45bd93c0b1765ccbcbd126be7e39e6347692c88f","amp;dn":"40+Lessons+for+the+Club+Player%3A+A+Proven+Course+in+All+Aspects+o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45bd93c0b1765ccbcbd126be7e39e6347692c88f","infoHashBuffer":{"type":"Buffer","data":[69,189,147,192,177,118,92,203,203,209,38,190,126,57,230,52,118,146,200,143]},"announce":[],"urlList":[]}}