{"title":"Judaism strange gods Michael Hoffman audiobook. Talmud","uid":11237213,"size":97882389,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4625e26e6694a68f55f7cdc1697c0d9a362f21ef&amp;dn=Judaism+strange+gods+Michael+Hoffman+audiobook.+Talmud&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"ausdiobooktorrents","files":13,"time":1413609948,"description":"Michael Hoffman,christian great researcher. Judaism strange gods audiobook. If you want to learn what the jewish people living in Israel today believe and about their religion this is a good place to start then talking to them about their religion and what they believe about Jesus. There is a serious problem with the semantics of the word 'jew' in the NT the greek word is ioudaio or soem variation of it which is Judean\n &lt;a href=&quot;\nhttp://www.scripture4all.org/OnlineInterlinear/NTpdf/mat27.pdf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.scripture4all.org/OnlineInterlinear/NTpdf/mat27.pdf&lt;/a&gt;\n\nJesus Christ king of the JUDEANS, people living in Judea which was on the same land where modern Palesitne/Israel is today, somewhere along the line someone decided to make Judeans synonymous with a newly created english word 'jew'. Need to go through the OT in greek and hebrew and find out the optimal translation of whatever the word is that comes out as 'jew' in english bibles is,.\n\nThe pharisee religion of the NT in the 1st century may be talmadic judaism in 2014 someone just needs to show parallels between the 2 to prove it logically though.\n\nThe talmud which is the foundation book of judaism contains very ant christian material like Jesus is boiling in hell in seamen, he was conceived of sin sex, deserved to die and other evil material. Please dont support the jewish people in Isra-hell this is what they believe their religion is judaism which is the opposite of christianity","torrent":{"xt":"urn:btih:4625e26e6694a68f55f7cdc1697c0d9a362f21ef","amp;dn":"Judaism+strange+gods+Michael+Hoffman+audiobook.+Talmud","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4625e26e6694a68f55f7cdc1697c0d9a362f21ef","infoHashBuffer":{"type":"Buffer","data":[70,37,226,110,102,148,166,143,85,247,205,193,105,124,13,154,54,47,33,239]},"announce":[],"urlList":[]}}