{"title":"Dave Matthews Band - Remember Two Things [Expanded] [320k MP3]","uid":10653277,"size":174821262,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:47583f25d4b31c67d35c745741226f6b7f0c698f&amp;dn=Dave+Matthews+Band+-+Remember+Two+Things+%5BExpanded%5D+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smbdownload","files":-1,"time":1406643972,"description":"Before they sold over 30 million records worldwide, saw six consecutive studio albums debut at No. 1 and attracted untold millions of fans across 20 years of acclaimed live shows, the Dave Matthews Band were a one-of-a-kind group from Virginia looking to make a name for themselves in a music scene dominated by loud guitars and louder angst. Remember Two Things, their first official release on their own Bama Rags label, remains an important calling card for fans everywhere - and it's being expanded on CD for the first time.\n\nThis high-spirited set found the band singer/guitarist Dave Matthews, drummer Carter Beauford, saxophonist LeRoi Moore, violinist Boyd Tinsley and bassist Stefan Lessard, with guest contributions by guitarist Tim Reynolds on four tracks unleashing easygoing but spirited original songs, recorded mostly live on stage (along with two additional studio recordings). The band's foot-stomping take on &quot;Ants Marching,&quot; the soothing acoustics of &quot;Satellite,&quot; and future concert staples like &quot;Tripping Billies,&quot; Recently and &quot;Seek Up&quot; captured the energy and excitement of a band truly on the verge of major success.\n\nRemember Two Things, a bona-fide word-of-mouth sensation which earned the band a platinum record in 2002, remains the first and best introduction to the DMB sound. That sound would soon take the world by storm with the release of their major-label debut Under The Table And Dreaming in 1994, but for the band's most loyal fans, Remember Two Things is truly where the band s story begins.\n\nThis new reissue features the original album expanded with two previously unreleased bonus tracks: early studio versions of &quot;Pay For What You Get&quot; and &quot;Typical Situation,&quot; newly mastered by original album engineer David Glasser. \n\nTrack Listing [320k MP3]\n\n01. Ants Marching\n02. Tripping Billies\n03. Recently\n04. Satellite\n05. One Sweet World\n06. The Song That Jane Likes\n07. Minarets\n08. Seek Up\n09. I'll Back You Up\n10. Christmas Song\n\n[Bonus]\n\n11. Pay For What You Get\n12. Typical Situation\n","torrent":{"xt":"urn:btih:47583f25d4b31c67d35c745741226f6b7f0c698f","amp;dn":"Dave+Matthews+Band+-+Remember+Two+Things+%5BExpanded%5D+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47583f25d4b31c67d35c745741226f6b7f0c698f","infoHashBuffer":{"type":"Buffer","data":[71,88,63,37,212,179,28,103,211,92,116,87,65,34,111,107,127,12,105,143]},"announce":[],"urlList":[]}}