{"title":"EnigmaT Set Rips { Cuts } - February 8th, 2014","uid":9588316,"size":855878215,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:477451067b8765cb38bc5890f3ee104f5ca11cc7&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+February+8th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":97,"time":1391857327,"description":"1Touch - Be Strong (Yuriy From Russia Remix) (Cut From Anderson Set)-enTc.mp3\nAbove &amp; Beyond - Hello (ABGT 065 Rip)-enTc.mp3\nAbove &amp; Beyond - Satellite Stealing Time (Acoustic Mix) (ABGT 065 Rip)-enTc.mp3\nAlter Future &amp; Max van Gord - Spirit (GDJB Rip)-enTc.mp3\nAmine Maxwell - Olusia (Cut From Palagano Set)-enTc.mp3\nAmir Hussain &amp; Tangle - Labryinth (Cut From Skyver Set)-enTc.mp3\nAndrea Roma feat. Leusin Still Loving (Martin Roth Interpretation) (ABGT 065 Rip)-enTc.mp3\nAngel Ace - Entrancers (Sunset Heat Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nArnej - The Burrow (Cut From Tydi Set)-enTc.mp3\nAudiocells - The Road In Liverpool (Original Mix) (Cut From Misja Set)-enTc.mp3\nBen'Yala - Nightmare (Club Mix) (Cut From El Jay Set)-enTc.mp3\nBlatwax - Supersolid (Cut From BT Set)-enTc.mp3\nCaptiva - Memories (Active Limbic System Remix) (Cut From El Jay Set)-enTc.mp3\nClaus Backslash - Globe North (Original Mix) (Cut From Anderson Set)-enTc.mp3\nControlwerk &amp; Reiklavik - The November Air (Cut From Knowles Set)-enTc.mp3\nCosmic Gate - Crushed (Fabio XB Rework) (Cut From Lange Set)-enTc.mp3\nCycle End - Polarity (Cut From Tydi Set)-enTc.mp3\nDenis Mash - Mnemonica (Cut From Ruben Set)-enTc.mp3\nDiscey - Ashram (Original Mix) (Cut From Shah Set)-enTc.mp3\nDj Vegas - Sunset (Dj Vegas Houston Skyline Remix) (Cut From DJ Sin Set)-enTc.mp3\nDj Vegas Pres. The Gathering - Ship In The Wind (Old School Mix) (Cut From DJ Sin Set)-enTc.mp3\nDmitry Strochenko - Beyond Reality (Antonio Next Remix) (Cut From Anderson Set)-enTc.mp3\nDreamy - A Day I Wish Didn't Come (Tom8 Remix) (Cut From Palagano Set)-enTc.mp3\nEpicFail - Matrix (Original Mix) (Cut From Anderson Set)-enTc.mp3\nFlatlex - Borealis (Original Mix) (Cut From Karybde Set)-enTc.mp3\nGabrielle Aplin - Home (Umami &amp; Alle Farben Edit) (Cut From Shah Set)-enTc.mp3\nGareth Emery feat. Bo Bruce - U (W&amp;W Remix) (ASOT 650 Part II Rip)-enTc.mp3\nGareth Emery feat. Christina Novelli - Concrete Angel (RAM Rework) (ASOT 650 Part II Rip)-enTc.mp3\nGarrido feat. Isobel Mai - On My Own (Orbion Remix) (Cut From Palagano Set)-enTc.mp3\nGroove Connective - Killer Industry (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nHeatbeat &amp; Rodrigo Deem - Felina (ASOT 650 Part II Rip)-enTc.mp3\nJamie Knowles - Global Emotive (Cut From Knowles Set)-enTc.mp3\nJayeson Andel &amp; Andrea Willson - Fight Gravity (Tygris Remix) (Cut From Anderson Set)-enTc.mp3\nJens Jakob - Binary Star (Diego.Morrill vs. 5th Dimension Remix) (Cut From El Jay Set)-enTc.mp3\nJohn Manz - Aether (Hanski Remix) (Cut From Knowles Set)-enTc.mp3\nJordan Suckley &amp; Eddie Bitar - Centipede (Allen &amp; Envy Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nKago Pengchi - Astronaut (Original Mix) (-Short- Cut From Rayel Set)-enTc.mp3\nKaretus - Battle Royale (Cut From BT Set)-enTc.mp3\nKyau &amp; Albert - Encounter (Arisen Flame Remix) (ASOT 650 Part II Rip)-enTc.mp3\nLTN - Havan Place (Original Mix) (Cut From Nickey Set)-enTc.mp3\nMajor7, Black &amp; White - Black 7 (Coming Soon Remix) (Cut From Patterson Set)-enTc.mp3\nMark Norman &amp; Alexx Rave - Cream (Cut From Sunny Lax Set)-enTc.mp3\nMark Sixma &amp; Jerome Isma-Ae - Refused (Dousk Remix) (Cut From Ruben Set)-enTc.mp3\nMarkus Schulz &amp; Klauss Goulart featuring Paul Aiden - Fireworks (GDJB Rip)-enTc.mp3\nMarkus Schulz &amp; Venom One featuring Chris Madin - Revolution (GDJB Rip)-enTc.mp3\nMarkus Schulz - Dancing in the Key of Life (GDJB Rip)-enTc.mp3\nMarkus Schulz - In the Shadows (GDJB Rip)-enTc.mp3\nMarkus Schulz - Mango (GDJB Rip)-enTc.mp3\nMarkus Schulz - Reflection (GDJB Rip)-enTc.mp3\nMarkus Schulz featuring CeCe Peniston - Make You Fall (GDJB Rip)-enTc.mp3\nMarkus Schulz featuring Lady V - Erase You (GDJB Rip)-enTc.mp3\nMarkus Schulz featuring Liz Primo - Blown Away (GDJB Rip)-enTc.mp3\nMaRLo - Poseidon (ASOT 650 Part II Rip)-enTc.mp3\nMat Zo feat. Rachel K Collier - Only For You (Estiva Remix) (Cut From Sunny Lax Set)-enTc.mp3\nMatthew C - Keep The Bass Going (Cut From DJ Sin Set)-enTc.mp3\nMikhjian - Everlasting Moments (Mark Bester &amp; Winter State Mix) (Cut From Palagano Set)-enTc.mp3\nMisja Helsloot - Wrecked (ASOT 650 Part II Rip)-enTc.mp3\nMistol Team - Motorama (Original Mix) (Cut From Anderson Set)-enTc.mp3\nMwe - Inside (Cut From Shah Set)-enTc.mp3\nNaoufal Lamrani &amp; Johannes Fischer - Elegy (O.B.M Notion Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nNaoufal Lamrani &amp; Johannes Fischer - Elegy (Saman &amp; Farzam Remix) (Cut From El Jay Set)-enTc.mp3\nNiels Vernimmen - Triple Digits (Original Mix) (Cut From Anderson Set)-enTc.mp3\nNorin &amp; Rad - That Was Easy (Cut From Schossow Set)-enTc.mp3\nOlive - You Are Not Alone (Markus Lawyer Remix) (-Short- Cut From Rayel Set)-enTc.mp3\nOrbion - ID -Feb 2014- (Cut From Knowles Set)-enTc.mp3\nOuter Space - Unbreakable Will (Reiklavik Uplifting Remix) (Cut From Above Clouds Set)-enTc.mp3\nPaul Rigel - Vertical Vengeance (Cut From Palagano Set)-enTc.mp3\nPhil Parry - Destiny (Original Mix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nReiklavik - Saxophonics (Cut From Knowles Set)-enTc.mp3\nRene Ablaze &amp; DJ T.H. - Dusseldorf (Wellenrausch's Dark Matter Remix) (GDJB Rip)-enTc.mp3\nSaint - Whale (Cut From Palagano Set)-enTc.mp3\nSasha - Xpander (Paul Thomas &amp; Kash Trivedi Bootleg) (Cut From Ruben Set)-enTc.mp3\nSean Rise - Brake The Rules (Unexplained Mix) (Cut From Anderson Set)-enTc.mp3\nShady - Moonrise (O.B.M Notion Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nShady - Moonrise (Original Mix) (Cut From El Jay Set)-enTc.mp3\nShowtek, Justin Prime Feat. Matthew Koma - Cannonball Earthquake (Kryder Remix) (Cut From Schossow Set)-enTc.mp3\nSignum - Coming On Strong (Tasso's Acid Remix) (Cut From Van Doe Set)-enTc.mp3\nSlaviX - Get Up &amp; Fly (Cut From Knowles Set)-enTc.mp3\nSlaviX - Mia (Cut From Knowles Set)-enTc.mp3\nSolid Stone - Remember (Rodg Remix) (Cut From Ruben Set)-enTc.mp3\nSpace Rockerz feat. Ellie Lawson - So Out Of Reach (Serdar Grey Remix) (-SAMPLE- From Anderson Set)-enTc.mp3\nStephane Badey - Full Moon (French Skies Remix) (Cut From Karybde Set)-enTc.mp3\nSteve Anderson - Breathless (Original Mix) (Cut From Anderson Set)-enTc.mp3\nSunn Jellie - Stargaze (Cosmonaut Remix) (Cut From Anderson Set)-enTc.mp3\nTalla 2XLC and Sarah Russell - Build These Walls (Set Rip)-enTc.mp3\nTangle - Indigo (Cut From Knowles Set)-enTc.mp3\nTasso &amp; Daniel Skyver - Do You Copy (Splattered Implant Remix) (Cut From Skyver Set)-enTc.mp3\nThe Cloudy Day - Aurora (Abandoned Rainbow Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nThe Destiny - Perpetuum Mobile (Cut From Sunny Lax Set)-enTc.mp3\nTiesto - Dance 4 Life (Felix Pot Bootleg) (Cut From Rayel Set)-enTc.mp3\nTuneflux - Clairvoyance (Original Mix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nVadim Soloviev &amp; Proff - It's A Funky Record (VIF Remix) (Cut From Anderson Set)-enTc.mp3\nViktor Kuzin - She (Cut From Knowles Set)-enTc.mp3\nWinkee - Helsinki (Original Mix) (Cut From Anderson Set)-enTc.mp3\nWitness45 - Umbrella (Original Mix) (Cut From Anderson Set)-enTc.mp3\nYang - Thunderstorm (Cut From Palagano Set)-enTc.mp3\nYang feat. Sarah-Jane Neild - Flow (Cut From Palagano Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:477451067b8765cb38bc5890f3ee104f5ca11cc7","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+February+8th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"477451067b8765cb38bc5890f3ee104f5ca11cc7","infoHashBuffer":{"type":"Buffer","data":[71,116,81,6,123,135,101,203,56,188,88,144,243,238,16,79,92,161,28,199]},"announce":[],"urlList":[]}}