{"title":"Fountains of Wayne - Welcome Interstate Managers","uid":5739872,"size":432924188,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:47b757825769f5913533842af0d182f09797a43a&amp;dn=Fountains+of+Wayne+-+Welcome+Interstate+Managers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ddawg","files":-1,"time":1280963845,"description":"\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/dc/b2/47ace893e7a0f6fc170f5110.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/dc/b2/47ace893e7a0f6fc170f5110.L.jpg&lt;/a&gt;\n\n\nTitle: Welcome Interstate Managers\nArtist: Fountains of Wayne\nAudio CD (June 10, 2003) \nOriginal Release Date: 2003 \nNumber of Discs: 1 \nGenre: Indie\nFormat: flac\n\n\nTrack Listing:\n\n01. Mexican Wine\n02. Bright Future in Sales\n03. Stacy's Mom\n04. Hackensack\n05. No Better Place\n06. Valley Winter Song\n07. All Kinds of Time\n08. Little Red Light\n09. Hey Julie\n10. Halley's Waitress\n11. Hung Up on You\n12. Fire Island\n13. Peace and Love\n14. Bought for a Song\n15. Supercollider\n16. Yours And Mine\n\n\nAllmusic Review:\nFans waiting for Fountains of Wayne to finally quit goofing around and release a sonically experimental, brooding collection of &quot;serious music&quot; are just going to have to keep waiting. Luckily, the number of their listeners hoping for anything besides another infectious batch of sunny singalong numbers from Adam Schlesinger, Chris Collingwood, and company is probably about the same as the number of people waiting for the White Stripes to record a smooth jazz record. On the mind-numbingly charming Welcome Interstate Managers, Fountains of Wayne do what they do best. And while they reinforce their reputation as the reigning deities of uptempo, big-guitar pop/rock with feel-good anthems like &quot;Mexican Wine,&quot; &quot;Bright Future in Sales,&quot; &quot;Stacy's Mom,&quot; and &quot;Little Red Light,&quot; they also continue their proud tradition of mellow yet equally tongue-in-cheek tunes. While their debut album had &quot;Sick Day&quot; and &quot;You Curse at Girls,&quot; and Utopia Parkway featured &quot;Prom Theme&quot; and &quot;The Senator's Daughter,&quot; Welcome Interstate Managers introduces &quot;Fire Island,&quot; a plea to be left home alone when the parents go on vacation, and &quot;All Kinds of Time,&quot; perhaps the best (and first) musical interpretation of a slow-motion football replay ever recorded. But the bouncing acoustic guitars of &quot;Hey Julie&quot; are definitely the high point. This time, the one flaw may simply be that the group doesn't know when to say when. Their two previous releases closed with lazy ballads, and this time they build to a perfect finale with &quot;Fire Island.&quot; Unfortunately, they follow it with four more songs that add little to the quality of the album. Still, CD players were made with skip buttons for a reason, and too much material is usually preferable to too little. Even without the last four tracks, Welcome Interstate Managers had more than enough pitch-perfect melodies and smile-inducing lyrics to make it a defining album for the summer of 2003. And if that's not your thing, well, maybe some winter they'll finally put out that somber record you've been waiting for. \n \nAmazon Review:\nAfter a four-year hiatus notable for some film and television soundtrack work, a lapsed contract, and a relaxed songwriting schedule Fountains of Wayne return with their third and best CD to date. The New York-based power-pop quartet delivers a diverse feast of infectious melodies and endlessly clever lyrics. Songwriters Adam Schlesinger and Chris Collingwood still slide on a sweet scale between the Beatles and the Monkees, but they've branched out from '60s sounds to include bona fide alt rock (&quot;Little Red Light,&quot; &quot;Bought for a Song&quot;), orchestrated pop (&quot;Halley's Waitress&quot;), a country lark worthy of Dwight Yoakam (&quot;Hung Up On You&quot;), and hints of psychedelia (&quot;Supercollider&quot;). The Cars-flavored &quot;Bright Future in Sales&quot; and &quot;Stacy's Mom&quot; warrant heavy-rotation airplay. Following their acclaimed eponymous debut and the vastly underrated Utopia Parkway, Welcome Interstate Managers leaves no doubt that Fountains of Wayne are gaining strength.","torrent":{"xt":"urn:btih:47b757825769f5913533842af0d182f09797a43a","amp;dn":"Fountains+of+Wayne+-+Welcome+Interstate+Managers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47b757825769f5913533842af0d182f09797a43a","infoHashBuffer":{"type":"Buffer","data":[71,183,87,130,87,105,245,145,53,51,132,42,240,209,130,240,151,151,164,58]},"announce":[],"urlList":[]}}