{"title":"Marcin Mortka - Morza Wszeteczne [PL]","uid":13534557,"size":343774702,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:485588be4c55c618b78cbd48a93efd030fb13ce5&amp;dn=Marcin+Mortka+-+Morza+Wszeteczne+%5BPL%5D+MP3%4064&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"everdarksoul","files":31,"time":1455435914,"description":"Audiobook PL - 29 części /   \r\nrozmiar: 327 MB / czas: 11:51:58\r\nczyta: Waldemar Barwiński\r\n\r\nSalwa burtowa i sufit walący się na głowę - to na ogół kiepski początek dnia... Ale dla Rolanda, zwanego Wywijasem, to najczęściej zwiastun wielkich zmian w życiu (o ile uda się je ocalić). Niestety Roland miast palić, grabić i rabować, jak na pirata przystało, wplątuje się w groźną wojnę. Dobrze, że może chociaż liczyć na swoje pirackie szczęście i zgraję typów spod bardzo ciemnej gwiazdy, dla których takie określenia jak: szaleniec czy moczymorda - brzmią jak niewinne komplementy...\r\nMistrz &quot;pirackiego fantasy&quot; powraca! Gwarantuje wartką akcję, krwawą jatkę i ...salwy śmiechu! \r\n\r\nHistorie o piratach często zaczynają się w ten sam sposób: kapitan, wskutek wyczerpującej walki, traci swój statek oraz większość załogi - zostają tylko ci najwierniejsi... Zaraz, zaraz - czy aby na pewno najwierniejsi, a nie ci mniej zaradni - którzy nie mieli pomysłu, aby zrobić ze sobą coś lepszego? To okazuje się zwykle w toku dalszych przygód... Kapitan Roland niby znalazł się w podobnej sytuacji - ale jednak nie do końca... Bo czy każda banda piratów - tak jak ta, grasująca po Morzach Wszetecznych - rekrutuje się spośród goblinów, półgoblinów, satyrów oraz szamanów - a w dodatku wszystkich tak zaciekłych, bezlitosnych, dzikich i zgoła nie najmądrzejszych? Otóż nie - takich awanturników, jak załoga tego dość podejrzanego, ale za to wyjątkowo szybko znalezionego nowego statku nazwanego &quot;Błędnym Rycerzem&quot;, nie spotyka się nigdzie indziej niż w okolicach dziwnie wymarłego miasta portowego Necroville...\r\nLegenda głosi, że piraci grasujący po Morzach Wszetecznych są wyrośniętymi, zdeformowanymi, brzydkimi dziećmi - które zostały niegdyś wrzucone do morza przez swych przerażonych rodziców. Patrząc na bandę kapitana Rolanda rekrutującą się spośród najdziwniejszych i najniebezpieczniejszych pokrak i wyrzutków wszelkiej maści, trudno nie dać wiary legendzie...\r\nHordy potencjalnych przeciwników, czających się w okolicach miasta Necroville muszą się mieć na baczności. Najmocniejszą stroną bandy Rolanda nie jest myślenie. Zwykle używają broni dużo szybciej niż głowy - o ile oczywiście głowa może przydać się do czegokolwiek w walce i przygodzie...\r\nHmm, przygodzie? Wątpliwe, że to słowo tutaj pasuje. Nie po to jest się piratem, żeby poszukiwać po najodleglejszych krańcach mórz przygód. Załoga Błędnego Rycerza szuka wprawdzie cały czas, ale czegoś innego - szuka awantury!\r\n\r\n&quot;Morza Wszeteczne&quot; to pierwsza część nowego cyklu Marcina Mortki, łączącego w sobie humorystyczne fantasy z powieścią awanturniczo-przygodową. W cyklu &quot;Morza Wszeteczne&quot; ukazały się dotąd dwie powieści, a całość na chwilę obecną zaplanowana jest jako trylogia.\r\n\r\ncykl Morza Wszeteczne:\r\n\r\n1 - Morza Wszeteczne\r\n2 - Wyspy Plugawe\r\n3 - Zaułki St. Naarten","torrent":{"xt":"urn:btih:485588be4c55c618b78cbd48a93efd030fb13ce5","amp;dn":"Marcin+Mortka+-+Morza+Wszeteczne+%5BPL%5D+MP3%4064","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"485588be4c55c618b78cbd48a93efd030fb13ce5","infoHashBuffer":{"type":"Buffer","data":[72,85,136,190,76,85,198,24,183,140,189,72,169,62,253,3,15,177,60,229]},"announce":[],"urlList":[]}}