{"title":"Platvoet en zn Vriendjes deel 5- Het Mysterieuze eiland.DVDr.NLT","uid":4965725,"size":710879862,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4964a9792b53a4ccb8171f8d193f8dd9121d9cfa&amp;dn=Platvoet+en+zn+Vriendjes+deel+5-+Het+Mysterieuze+eiland.DVDr.NLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"diddle783","files":-1,"time":1245522946,"description":"Engelse Titel: Land before Time V: The Mysterious Island \nNederlandse titel: Platvoet en Zijn Vriendjes V: Het Mysterieuze Eiland \n\noorspronkelijke bioscoop datum: 1997\ndvd release mei 2007\nBron : eigen dvd\n\nVerenigde Staten\nAnimatie / Avontuur\n74 minuten\n\ngeregisseerd door Charles Grosvenor\nmet de stemmen van Jeff Bennett, Aria Noelle Curzon en Thomas Dekker\n\nAchter de Groene Vallei ligt een schitterend maar mysterieus eiland. Op deze buitengewone plaats ontdekken Platvoet, Cera, Bekkie, Fladder en Punt oude en nieuwe vriendjes, krijgen ze te maken met spannende uitdagingenen beleven ze het avontuur van hun leven. Het is een geheel nieuwe, met liedjes gevulde klassieker uit de Platvoet en zijn Vriendjes serie. Op een dag strijkt een zwerm rupsen neer in de Groene Vallei die iedere plant verslindt die ze tegenkomt. De eens zo groene ruimte is nu leeg en onvruchtbaar en de bewoners moeten een nieuw thuis vinden totdat de 'Groene Vallei' is herstelt. Maar als een ruzie tussen de volwassenen de vriendjes uiteen dreigt te drijven, lopen Platvoet en zijn vriendjes van huis weg. Hun tocht neemt hen mee van het Grote Water-waar vreemde figuren zwemmen en spelen, naar de kust van een mysterieus eiland waar ze hun vriendje Happer weer tegenkomen. Maar dit keer is alles anders en moet happer zijn vriendje beschermen tegen se scherptanden op het eiland en zelfs tegen zijn ouders!\n\n\nDeze torrent wordt je aangeboden door NLT.ons-Forum \n\nNLT is op zoek naar nieuwe uploaders.\n\nHet forum met de nieuwste films en muziek en de meest uitgebreide\nCollectie DviX torrents. Al onze Film torrents hebben Nederlandse subs of zijn Nederlands Geproken\n\nLijkt het je leuk om in gezellig team terecht te komen en samen met hun de uploads voor het NLT te verzorgen meld je dan aan bij NLT.Ons-Forum\n\nJe kan je daarna aanmelden bij Diddle783.\n\nTot ziens op het NLT.\n\nWe zijn te vinden op:\nwww.nlt.ons-forum.nl","torrent":{"xt":"urn:btih:4964a9792b53a4ccb8171f8d193f8dd9121d9cfa","amp;dn":"Platvoet+en+zn+Vriendjes+deel+5-+Het+Mysterieuze+eiland.DVDr.NLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4964a9792b53a4ccb8171f8d193f8dd9121d9cfa","infoHashBuffer":{"type":"Buffer","data":[73,100,169,121,43,83,164,204,184,23,31,141,25,63,141,217,18,29,156,250]},"announce":[],"urlList":[]}}