{"title":"Ramones - The Family Tree  [2CD] (2008) [mp3@320]","uid":5141345,"size":249836094,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:49f40adec9d7b45e38550d71a0a7ee2155ffe3f9&amp;dn=Ramones+-+The+Family+Tree++%5B2CD%5D+%282008%29+%5Bmp3%40320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zibbik","files":38,"time":1256954708,"description":"\nGenre: Punk Rock, Rock, Rock'n'Roll\n\nThe Ramones: The Family Tree is an 2CD collection released in December, 2008. Argentinean Music Brokers label released this worldwide. The Family Tree has 28 songs: two Ramones songs and 26 solo or side project songs. Great Argentinean fan named Mariano Asch compiled this for the Argentinean label Music Brokers.\n- I did my best to get permission for many songs that included side projects or solo songs of the different Ramones members, even though a lot of songs were impossible to be able to use I think I did a damn good job with it anyway, told Mariano Asch for me (Jari-Pekka Laitio-Ramone) in December 2008.\n\nTRACKLISTING OF CD1: 37:16\n\n1) Blitzkrieg Bop: Die Toten Hosen featuring Joey Ramone.\n2) I Wanna Be Your Boyfriend: The Ramones.\n3) I Am Seeing U.F.O.s: Dee Dee Ramone featuring Joey Ramone.\n4) 3 Cheers For You: Marky Ramone And The Intruders.\n5) Good Enough For Me: Bad Chopper (CJ Ramone's band).\n6) Good Rockin' Tonight: The Swing Cats featuring Johnny Ramone &amp; Lemmy Kilmister.\n7) On The Beach: The Rattlers featuring Joey Ramone.\n8) Negative Creep: Dee Dee Ramone.\n9) The KKK Took My Baby Away: Osaka Popstar (Marky Ramone does play).\n10) Lying To Myself: Blackfire featuring Joey Ramone.\n11) I'm Making Monsters For My Friends: Dee Dee Ramone &amp; I.C.L.C. featuring Nina Hagen.\n12) Don't Blame Me: Marky Ramone And The Intruders featuring Joan Jett.\n13) Meatball Sandwich: Youth Gone Mad featuring Joey Ramone.\n14) Do It To Me: Bad Chopper (CJ Ramone's band).\n\nTRACKLISTING OF CD2: 38:34\n\n1) Pet Sematary (live): Marky Ramone. This is taken from Marky Ramone's Start Of The Century collection, song is recorded in Mexico in February, 2005.\n2) Now I Wanna Be Sedated: Dee Dee Ramone.\n3) See My Way: Sibling Rivalry (line-up has Joey Ramone and his brother Mickey Leigh).\n4) Judy Is A Punk: The Ramones.\n5) Cherry Bomb: Marky Ramone, Cherie Currie and Wayner Kramer.\n6) Viva Las Vegas: The Swing Cats featuring Johnny Ramone.\n7) Bad Horoscope: Dee Dee Ramone featuring Lux Interior.\n8) Nowhere Man: Marky Ramone And The Intruders.\n9) Punishment Fits The Crime: CJ Ramone &amp; Bien Desocupados.\n10) Slug (live): The Independents featuring Joey Ramone.\n11) Round The Bend: Uncle Monk (Tommy Ramone's and Claudia Tienan's band).\n12) The Bowery Electric: The Bowery Electric Crew (line-up has Tommy Ramone, CJ Ramone and Marky Ramone).\n13) Jump In The Fire: Dee Dee Ramone.\n14) The Wonderful Widow Of Eighteen Springs: Joey Ramone. \n\n\nAll references to the music, placed above, are presented only for fact-finding listening .. so if you like it - buy it !\n\nAlways Support The Artists And Buy The Original Material And Erase Downloaded Files in 24 hours or less, The Albums Are Not My Uploads...\n\n\n\n\n\n","torrent":{"xt":"urn:btih:49f40adec9d7b45e38550d71a0a7ee2155ffe3f9","amp;dn":"Ramones+-+The+Family+Tree++%5B2CD%5D+%282008%29+%5Bmp3%40320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49f40adec9d7b45e38550d71a0a7ee2155ffe3f9","infoHashBuffer":{"type":"Buffer","data":[73,244,10,222,201,215,180,94,56,85,13,113,160,167,238,33,85,255,227,249]},"announce":[],"urlList":[]}}