{"title":"Los.Inmortales.En.Busca.De.La.Venganza.2007.DVDrip.Xvid.Spanish.","uid":4732767,"size":733377384,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a30ed8584817110b1dfe9d7390cecd42d4c3802&amp;dn=Los.Inmortales.En.Busca.De.La.Venganza.2007.DVDrip.Xvid.Spanish.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LDivx","files":4,"time":1235125910,"description":"Los Inmortales - En Busca de la Venganza (2007)\n\nDirigida por: Yoshiaki Kawajiri\n\nIntÃƒÂ©rpretes: \n\nNacionalidad: \n\nDuraciÃƒÂ³n: 90 min\n\nCalificaciÃƒÂ³n moral: 13\n\nTÃƒÂ­tulo original: Highlander: The Search for Vengeance\n\nLanzamiento: 18/02/2009\n\n\nSinopsis:\nTras cuatro pelÃƒÂ­culas y dos exitosas series de televisiÃƒÂ³n, Los Inmortales se renueva. MacLeod regresa dispuesto a vengarse... Ã‚Â¡En un largometraje ÃƒÂ©pico animado! El mago del anime Yoshiaki Kawajiri aporta su maestrÃƒÂ­a visual ÃƒÂºnica a la franquicia inmortal de Los Inmortales. Por primera vez, la katana de MacLeod estarÃƒÂ¡ en manos de un inmortal JaponÃƒÂ©s. En la nueva ventura, Colin, un guerrero solitario, viaja junto con un fantasma bromista llamado Amergon a travÃƒÂ©s de tierras desoladas en busca del dÃƒÂ©spota inmortal Marcus Ocativus, que asesinÃƒÂ³ a su amada Moya en las planicies celtas siglos atrÃƒÂ¡s. Durante su bÃƒÂºsqueda, Colin descubre que Nueva York estÃƒÂ¡ en ruinas, y que una fortaleza monolÃƒÂ­tica domina la ciudad, devastada por un virus mortal. Colin puede salvar a los supervivientes, pero su espada estÃƒÂ¡ sedienta de la sangre de un solo hombre... hasta que descubre que el monolito estÃƒÂ¡ controlado por aquÃƒÂ©l a quien se ha pasado la vida persiguiendo: Ã‚Â¡el mismÃƒÂ­simo Marcus! A pesar de siglos de entrenamiento, Colin jamÃƒÂ¡s logrÃƒÂ³ derrotar a Marcus en las grandes batallas de la historia. Ã‚Â¿PodrÃƒÂ¡ terminar lo que ha empezado y detener a Marcus? Ã‚Â¿GuiarÃƒÂ¡ Colin a la gente hacia la libertad o se dejarÃƒÂ¡ consumir por el odio? La respuesta estÃƒÂ¡ en la hermosa pero implacable Dahlia, una guerrera de la libertad que tiene una misteriosa relaciÃƒÂ³n con Moya. Colin deberÃƒÂ¡ enfrentarse a Marcus en una batalla en la que el futuro de toda la humanidad estÃƒÂ¡ en juego. SÃƒÂ³lo puede quedar uno.. ","torrent":{"xt":"urn:btih:4a30ed8584817110b1dfe9d7390cecd42d4c3802","amp;dn":"Los.Inmortales.En.Busca.De.La.Venganza.2007.DVDrip.Xvid.Spanish.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a30ed8584817110b1dfe9d7390cecd42d4c3802","infoHashBuffer":{"type":"Buffer","data":[74,48,237,133,132,129,113,16,177,223,233,215,57,12,236,212,45,76,56,2]},"announce":[],"urlList":[]}}