{"title":"Midget - Jukebox [1998]","uid":9394010,"size":349033562,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4ae966f3c8046721910c59f81bf8b2f0bd31d5c1&amp;dn=Midget+-+Jukebox+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1387944435,"description":"NTRODUCTION TO MIDGET\n\n\nFormed: 1993 in Stamford, Lincolnshire\n\nLee Major - Drums\nRichard Gombault - Guitar &amp; Vocals\nAndy Hawkins - Bass &amp; Backing Vocals\n  \nFormed originally as 'The Smoking Lizards' in 1993, the band changed their name to 'Midget' in April 1995. Their first official release was their mini album 'Alco-pop!' (November 1997) followed by the 'bright and breezy pop rock' first full-length album 'Jukebox' in 1998. They toured with bands such as Feeder, Red Kross, Carter USM, and Idlewild and did two successful headline tours of Japan. They also played at the 1998 Fuji Rock Festival in front of thousands of rock fans. Unfortunately the band's label 'Radar' folded up halting much publicity for the band.\n   \nMidget carried on, changing their musical style towards 'psychedelic swirls, sample loops, vocal effects and shifting song structures', for their under-rated second full-length album 'Individual Inconsistent' (2000). This album was released in the UK under the 'Pet Sounds' label although sadly it did not get near as much success or publicity as previous releases.\n  \n2001 was a quiet year for the band. Midget only played live on two occasions although they did record a new album 'The Milgram Experiment'. This album was only released in Japan as the band had gone their own ways before the U.K version came out. \n   \nAlthough Midget technically didn't split up, the members decided to follow their careers. Richard teaches guitar and also formed the band 'Kubrick' who released two CD's before splitting up. Andy records and mixes records for bands and has been soundman for many bands such as 'The Damned'. Lee has the unusual job of an air traffic controller and also is in the band 'Complex Four'.   \n\nMidget reformed in February 2006, and recorded a new song 'My Infatuation', which was released on the 'Alcopopular' CD compilation. The band plan to record new material in the future, although current  commitments have temporarily halted further progress.\n\nfrom http://www.xanthein.co.uk/bandindex.htm","torrent":{"xt":"urn:btih:4ae966f3c8046721910c59f81bf8b2f0bd31d5c1","amp;dn":"Midget+-+Jukebox+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ae966f3c8046721910c59f81bf8b2f0bd31d5c1","infoHashBuffer":{"type":"Buffer","data":[74,233,102,243,200,4,103,33,145,12,89,248,27,248,178,240,189,49,213,193]},"announce":[],"urlList":[]}}