{"title":"East River Pipe - Poor Fricky [1995][EAC,log,cue. FLAC]","uid":8597596,"size":265781784,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4b2488c372df22de30587afce69e86fefe0016f2&amp;dn=East+River+Pipe+-+Poor+Fricky+%5B1995%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":16,"time":1371795958,"description":"Artist: East River Pipe\nRelease: Poor Fricky\nReleased: 1995\nLabel: Merge\nCatalog#: MRG081\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:Alternative Rock\n\n\n1 Bring On The Loser (2:53)\n2 Metal Detector (3:33)\n3 Here We Go (2:42)\n4 Put-Down (2:03)\n5 Superstar In France (4:06)\n6 Keep All Your Windows Tight Tonight (6:36)\n7 Ah Dictaphone (3:08)\n8 Walking The Dog (2:52)\n9 Marty (4:21)\n10 Crawl Away (2:54)\n11 Hey, Where's Your Girl? (3:39)\n12 Powerful Man (4:28)\n13 When The Ground Walks Away (2:14)\n\nF.M. Cornog returns with his eagerly awaited second LP after the appreciative murmurs caused by his debut, Shining Hours in a Can (the British Goodbye California, plus all his stellar early 7&quot; songs as additional tracks). Reviews that attempted to lump the uniquely talented Cornog in with some sort of &quot;lo-fi&quot; revolution, with such bands as Guided by Voices and Sebadoh -- since Cornog contents himself with recording 8-track in his home -- are misguided and laughable. For while those groups -- ERP is a person -- record haphazard, sporadic bursts of whatever tunes come into their heads, Cornog is busy multi-tracking undefiled recordings of his simple, neo-spiritual arrangements -- he's more Pet Sounds than The White Album. Poor Fricky in particular puts some distance between him and those other 24-track/mega-studio-eschewing-folks. Its 13 burbling tracks are more in the vein of Shining Hours' &quot;Make a Deal with the City&quot; (too bad nothing here is as nasty or as nerve-racking as &quot;Psychic Whore&quot; or &quot;Helmet On,&quot; but that's OK), with a supremely prickling ambiance in his simple, only-slightly distorted, dreamy guitar signatures. Sometimes he'll add an ice-pop organ, and his vocal is as yearning and slightly resigned as ever. The likes of the luscious &quot;Bring on the Loser&quot; (nice sentiment, that, the opposite of &quot;in your face&quot;), and the happy &quot;Here We Go&quot; show that as he progresses, Cornog gets more and more likable, not a lonely loser but a transcendent-pop lover, as he better navigates his home portastudio for maximum results. Poor Fricky is as fresh as Pop'n'Fresh dough (and the doughboy spokesman, hoo-hooo-ho), and as gently babbling as a spring brook. From a nondescript Astoria apartment to us, this is direct communication. (allmusic)","torrent":{"xt":"urn:btih:4b2488c372df22de30587afce69e86fefe0016f2","amp;dn":"East+River+Pipe+-+Poor+Fricky+%5B1995%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b2488c372df22de30587afce69e86fefe0016f2","infoHashBuffer":{"type":"Buffer","data":[75,36,136,195,114,223,34,222,48,88,122,252,230,158,134,254,254,0,22,242]},"announce":[],"urlList":[]}}