{"title":"Chris Botti - Night Sessions","uid":3826013,"size":114669961,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4b5051fff164ec5bae26e3827033eab64e07f4f9&amp;dn=Chris+Botti+-+Night+Sessions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ziolo13","files":18,"time":1191252373,"description":"Three of the biggest instrumental pop hits ever recorded were by trumpeters Hugh Masekela, Herb Alpert, and Chuck Mangione. Botti&amp;#039;s fourth album comes equipped with more than enough catchy and light melodies to compete with that legacy, but it will probably be &quot;All Would Envy,&quot; one of the two vocal tunes on Night Sessions, that will help this disc dent radio and sales charts. It&amp;#039;s a song given an irresistible Brazilian lilt by its composer, Sting, who Botti has toured with, and sung hauntingly by Shawn Colvin. Like those aforementioned horn players, Botti does put an emphasis on rhythm on upbeat groove tunes like &quot;Miami Overnight,&quot; &quot;Streets Ahead,&quot; and especially &quot;Blue Horizon,&quot; which has more than a hint of Europe&amp;#039;s drum &amp; bass sound, and features killer keyboard work by Billy Childs and album producer Kipper. But it&amp;#039;s the Alpert-influenced &quot;Through an Open Window,&quot; with its rock guitars and slick melody line that many may consider the hottest track. Most of the other tracks consist of Botti&amp;#039;s crisp clear tone cutting through the kind of atmospheric, heavily padded keyboard music that has gotten him on smooth-jazz radio and Hollywood soundtracks. --Mark Ruffin \n \n \n&quot;Suddenly there&amp;#039;s a rush to harness producers with fresh ideas with smooth jazz artists going for a makeover.This is not only a musical makeover, but an image one, as well. The cover gives credit for &quot;grooming&quot;! However the influence of Kipper as a producer across the whole of this album adds a whole new dimension to Chris Botti&amp;#039;s work that is a postive step forward. There&amp;#039;s never been any doubt about his ability as a trumpet player, but this is enhanced throughout by little flourishes that add to the overall sound of the album. Listen to the start of &quot;Streets ahead&quot; for an example, and also later on the track the extra keyboard flourishes, courtesy of Jeff Lorber. Kipper not only adds keyboards, but also drum programming on the excellent &quot;Blue Horizon&quot;.Other favourites for me are &quot;You move me&quot; where the vocals of Camilla add yet another dimension to the overall sound, and &quot;Best time&quot; where Bill Reichenback adds trombone to underpin Botti&amp;#039;s playing.This is a real move forward in Botti&amp;#039;s output, and if you&amp;#039;re looking an album to listen to when you&amp;#039;re in reflective mood this could be it, but make sure you play it LOUD!!&quot; Amazon \n \n \n1.Lisa\n2.Miami Overnight\n3.Streets Ahead\n4.Interlude\n5.All Would Envy - (featuring Shawn Colvin)\n6.Best Time\n7.When I See You\n8.You Move Me\n9.Blue Horizon\n10.Light The Stars\n11.Through An Open Window\n12.Easter Parade \n \nPersonnel: Chris Botti (trumpet); Shawn Colvin, Lani Groves, Camilla (vocals); Bill Reichenbach (trombone); Kazu Matsui (shakuhachi); Kipper (keyboards, programming); Jeff Lorber, Billy Childs, Jeff Young (keyboards); Dominic Miller, Shane Fontayne, Heitor Pereira, Marc Shulman (guitar); Christian McBride, Jimmy Johnson, Jon Ossman (bass); Vinnie Colaiuta, Abe Laboriel, Jr. (drums); Luis Conte (percussion). \n \n \nRip: Exact Audio Copy (secure mode) \nColumbia/Sony Music 2001 \ncover :yes \nmpc@BrainDead /Q8 VBR 278-320kb/s","torrent":{"xt":"urn:btih:4b5051fff164ec5bae26e3827033eab64e07f4f9","amp;dn":"Chris+Botti+-+Night+Sessions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b5051fff164ec5bae26e3827033eab64e07f4f9","infoHashBuffer":{"type":"Buffer","data":[75,80,81,255,241,100,236,91,174,38,227,130,112,51,234,182,78,7,244,249]},"announce":[],"urlList":[]}}