{"title":"Randy Rogers Band - Burning the Day [2010][EAC,log,cue. FLAC]","uid":8423776,"size":282232687,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4e2eca36345bfd5068688f82425b7999840e7bb0&amp;dn=Randy+Rogers+Band+-+Burning+the+Day+%5B2010%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1367278357,"description":"Artist: Release: Burning the Day\nMusicBrainz: d7558d6b-8202-499e-a93a-ba58af3845a6\nReleased: 2010\nLabel: MCA Nashville\nCatalog#: B0014217-02\nCountry: US\nGenre: country, americana, texas.country, red.dirt\n\nTracklisting:\n\n01. Interstate (04:42)\n02. Damn The Rain (03:02)\n03. Too Late For Goodbye (03:40)\n04. Missing You Is More Than I Can Do (03:53)\n05. Holding On To Letting Go (03:29)\n06. Just Don't Tell Me The Truth (02:56)\n07. I've Been Looking For You So Long (04:12)\n08. Steal You Away (03:50)\n09. Starting Over For The Last Time (04:12)\n10. I Met Lonely Tonight (02:52)\n11. Last Last Chance (03:02)\n\nThe current members of the Randy Rogers Band have been together since 2004. They've taken their time, learned how to make records, and matured slowly. In 2006 the band crossed over. They signed to Mercury Nashville and released Just a Matter of Time (which reached number six on Billboard's country chart). They grossed over $2.5 million while touring in support of it in 2007, warranting placement in Rolling Stone as a &quot;must-see&quot; artist. In 2008, they enlisted Radney Foster to produce their self-titled follow-up, which mirrors Nashville's studio culture. Burning the Day, produced by Paul Worley, finds them on MCA Nashville, and as the last song on the album states, &quot;This is my last, last, last, last, chance to get it right.&quot; And it may be. Preceded by the fine single &quot;Too Late for Goodbye,&quot; a ringing midtempo rock ballad, the Randy Rogers Band has evolved from its roots as a good-time, spontaneous live band into first-rate masters of the recording studio. The other fine tunes on the set, &quot;Holding on to Letting Go,&quot; &quot;I've Been Looking for You so Long,&quot; &quot;Starting Over for the Last Time,&quot; and &quot;Last Last Chance,&quot; reveal a more polished version of what the band is best at live: playing a 21st century meld of contemporary country and mainstream pop/rock; as influenced by Bob Seger as it is by Jack Ingram and Pat Green. Elsewhere, however, on more more traditional country-style tunes such as &quot;Missing You Is More Than I Can Do,&quot; the 21st century honky tonker &quot;I Met Lonely Tonight,&quot; or the thoroughly generic opener &quot;Interstate,&quot; their sound is so polished and the songs so perfectly formulated, the band's personality disappears; it sounds like play-by-the-numbers contemporary country-pop. As a result, Burning the Day doesn't burn at all; it suffers half the time from a severe lack of inspiration and creativity. It's too bad, too; RRB has worked hard to get to this plateau, but the final product falls far short of the group's considerable potential.","torrent":{"xt":"urn:btih:4e2eca36345bfd5068688f82425b7999840e7bb0","amp;dn":"Randy+Rogers+Band+-+Burning+the+Day+%5B2010%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e2eca36345bfd5068688f82425b7999840e7bb0","infoHashBuffer":{"type":"Buffer","data":[78,46,202,54,52,91,253,80,104,104,143,130,66,91,121,153,132,14,123,176]},"announce":[],"urlList":[]}}