{"title":"The Last Trilogy - Michael Adams","uid":12093538,"size":7310932,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e564fca2d0418460cbf9abd29777c57a61d59a7&amp;dn=The+Last+Trilogy+-+Michael+Adams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":9,"time":1436109118,"description":"01. The Last Girl [The Last Trilogy, #1] - Michael Adams\n\nThe end of the world happened quickly. The sun still shone, there was no explosion - just a tsunami-sized wave of human thought drowning the world in telepathic noise as everyone's inner-most secrets became audible. Everyone's thoughts, that is, except sixteen-year-old Danby.\n\nEveryone looked like bad actors in a poorly dubbed movie. Their expressions didn't match their emotions and their lips didn't sync with what they were saying. But they were all so loud.\n\nGod-he-looks-hot-Can't-she's-my-best-friend-How'd-she-lose-that-weight-No-don't-you-dare-Oh-no-please-\n\nThe end of the world happens in the blink of an eye.\n\nWhen The Snap sweeps the globe, everyone can instantly hear everything that everyone else is thinking. As secrets and lies are laid bare, suburbs and cities explode into insanity and violence. What might have been an evolutionary leap instead initiates the apocalypse.\n\nSixteen-year-old Danby Armstrong's telepathy works very differently. She can tune into other people but they can't tune into her. With only this slender defence, Danby must protect her little brother and reach the safety of her mother's mountain retreat. But it's 100 kilometres away and the highways are blocked by thousands of cars and surrounded by millions of people coming apart at the psychic seams.\n\nDanby's escape is made even more dangerous by another cataclysm that threatens humanity's extinction. And her ability to survive this new world will be tested by a charismatic young man whose power to save lives may be worse than death itself.\n\n&quot;If you're looking for a great Australian YA read over summer, treat yourself to a copy of Michael Adams' post-apocalyptic page-turner, The Last Girl&quot; Margot McGovern, reviewer for Australian Book Review\n\n02. The Last Shot [The Last Trilogy, #2] - Michael Adams\n\nSixteen-year-old Danby has survived the telepathic outbreak that ravaged humanity, but now she's caught in a desperate battle for her own survival... and for the future of the world.\n\nI glance at my fellow fugitives in the glow of the fire: black-streaked, white-eyed, faces fearful but fierce. Whoever any of us were a week ago, we've now become people we could never have imagined.\n\nAfter facing the heartbreaking truth in Shadow Valley, Danby is determined to have her revenge on Jack.\n\nWith Jack dead, her little brother Evan and hundreds of other Minions will be free of his control. With Jack dead, she and her friend Nathan will be able to revive thousands more from the millions of catatonic Goners.\n\nBut what if she's wrong - about everything?\n\nAfter Danby confronts Jack on a dying stretch of highway, all of her beliefs are turned inside out. Not only are his feelings for her real, he's working against the clock to save lives and rebuild society. To Danby's horror, it's Nathan who appears to threaten the new order.\n\nWith her emotions raging and blood on her hands, Danby has to take a side in a deadly battle that'll decide the future of the world. And as allies become enemies and foes turn into friends, she'll have to embrace methods so dark that the price of survival may be her very soul ...\n\n03. The Last Place [The Last Trilogy, #3] - Michael Adams\n\nJack is more powerful than ever and has control of the one person Danby truly loves, her brother Evan. Determined to free Evan and rid the world of the evil that is Jack, Danby hatches a risky plan - but will she pay the ultimate price to liberate those she loves?\n\nBy the glow of the instrument panel, I see my face reflected in the darkened window.\n\n'My God,' she says. 'Who are you?'\n\nIt's what I've been asked before. I don't know the answer.\n\nDanby is desperately fighting to save the last of humanity.\n\nBut with Jack's sinister influence more powerful than ever, Danby's one hope for freeing his minions - and her little brother - seems lost. The only option now for the few survivors not under Jack's control is escape at any cost.\n\nDanby will also have to confront a danger much closer to home as she realises what she risks in the ferocious battle that looms. Embracing a brutal warrior code might save Danby's life, but the price is high.\n\nIn the explosive final act of the Last trilogy, Danby must save who she can, even if it means abandoning hope for her last remaining family. With soldiers, marauders and toxic bushfires closing in, she has no choice but to fight before she can take flight","torrent":{"xt":"urn:btih:4e564fca2d0418460cbf9abd29777c57a61d59a7","amp;dn":"The+Last+Trilogy+-+Michael+Adams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e564fca2d0418460cbf9abd29777c57a61d59a7","infoHashBuffer":{"type":"Buffer","data":[78,86,79,202,45,4,24,70,12,191,154,189,41,119,124,87,166,29,89,167]},"announce":[],"urlList":[]}}