{"title":"Tinker, Tailor, Soldier, Spy. Official Movie Trailer [HD]","uid":6706013,"size":55162880,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:4f509c003b959a05ddf902fb31c0be6cb87df24f&amp;dn=Tinker%2C+Tailor%2C+Soldier%2C+Spy.+Official+Movie+Trailer+%5BHD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"proffcom","files":-1,"time":1317165374,"description":"In theaters: December 9th, 2011\n\nSynopsis:\n\nTinker, Tailor, Soldier, Spy is the long-awaited feature film version of John le Carre's classic bestselling novel. The thriller is directed by Tomas Alfredson (Let the Right One In). The screenplay adaptation is by the writing team of Bridget O'Connor &amp; Peter Straughan. The time is 1973. The Cold War of the mid-20th Century continues to damage international relations. Britain's Secret Intelligence Service (SIS), a.k.a. MI6 and code-named the Circus, is striving to keep pace with other countries' espionage efforts and to keep the U.K. secure. The head of the Circus, known as Control (John Hurt), personally sends dedicated operative Jim Prideaux (Mark Strong) into Hungary. But Jim's mission goes bloodily awry, and Control is forced out of the Circus - as is his top lieutenant, George Smiley (Gary Oldman), a career spy with razor-sharp senses. Estranged from his absent wife Ann, Smiley is soon called in to see undersecretary Oliver Lacon (Simon McBurney); he is to be rehired in secret at the government's behest, as there is a gnawing fear that the Circus has long been compromised by a double agent, or mole, working for the Soviets and jeopardizing England. Supported by younger agent Peter Guillam (Benedict Cumberbatch), Smiley parses Circus activities past and present. In trying to track and identify the mole, Smiley is haunted by his decades-earlier interaction with the shadowy Russian spy master Karla. The mole's trail remains cold until maverick field agent Ricki Tarr (Tom Hardy) unexpectedly contacts Lacon. While undercover in Turkey, Ricki has fallen for a betrayed married woman, Irina (Svetlana Khodchenkova), who claims to possess crucial intelligence. Separately, Smiley learns that Control narrowed down the list of mole suspects to five men. They are the ambitious Percy Alleline (Toby Jones), whom he had code-named Tinker; suavely confident Bill Haydon (Colin Firth), dubbed Tailor; stalwart Roy Bland (Ciaran Hinds), called Soldier; officious Toby Esterhase (David Dencik), dubbed Poor Man; and - Smiley himself. Even before the startling truth is revealed, the emotional and physical tolls on the players enmeshed in the deadly international spy game will escalate... \n\nGenre: Thriller\n\nDirector: Tomas Alfredson\n\nCast: Gary Oldman, Colin Firth, Tom Hardy, Mark Strong, Benedict Cumberbatch, Toby Jones, David Dencik, Svetlana Khodchenkova, Stephen Graham, Kathy Burke, CiarÃƒÂ¡n Hinds\n\n\n___________________________________________________________\n\nVideo: Xvid 1920x816 23.98fps\n\nAudio: MPEG Audio Layer 3 44100Hz stereo 320kbps\n___________________________________________________________","torrent":{"xt":"urn:btih:4f509c003b959a05ddf902fb31c0be6cb87df24f","amp;dn":"Tinker%2C+Tailor%2C+Soldier%2C+Spy.+Official+Movie+Trailer+%5BHD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f509c003b959a05ddf902fb31c0be6cb87df24f","infoHashBuffer":{"type":"Buffer","data":[79,80,156,0,59,149,154,5,221,249,2,251,49,192,190,108,184,125,242,79]},"announce":[],"urlList":[]}}