{"title":"Buddy Holly - From The Original Master Tapes (1985)","uid":8423521,"size":259828482,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:50349ad6a61c303a1248493fceb3594e627e2ee8&amp;dn=Buddy+Holly+-+From+The+Original+Master+Tapes+%281985%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":27,"time":1367270976,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nBuddy Holly - From The Original Master Tapes (1985)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/510S6xs-EHL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/510S6xs-EHL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by Bruce Eder):\n\nBuddy Holly is perhaps the most anomalous legend of '50s rock &amp; roll -- he had his share of hits, and he achieved major rock &amp; roll stardom, but his importance transcends any sales figures or even the particulars of any one song (or group of songs) that he wrote or recorded. Holly was unique, his legendary status and his impact on popular music all the more extraordinary for having been achieved in barely 18 months. Among his rivals, Bill Haley was there first and established rock &amp; roll music; Elvis Presley objectified the sexuality implicit in the music, selling hundreds of millions of records in the process, and defined one aspect of the youth and charisma needed for stardom; and Chuck Berry defined the music's roots in blues along with some of the finer points of its sexuality, and its youthful orientation (and, in the process, intermixed all of these elements). Holly's influence was just as far-reaching as these others, if far more subtle and more distinctly musical in nature. In a career lasting from the spring of 1957 until the winter of 1958-1959 -- less time than Elvis had at the top before the army took him (and less time, in fact, than Elvis spent in the army) -- Holly became the single most influential creative force in early rock &amp; roll.\n\nRead all of the bio at: &lt;a href=&quot; http://www.allmusic.com/artist/buddy-holly-p4502/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/buddy-holly-p4502/biography&lt;/a&gt;\n\nAll Music Album Review (by Bruce Eder):\n\nMCA got serious about reissuing vintage music from its library in the 1980s, when it put the responsibility in the hands of producer Steve Hoffman, who was willing to spend the time and do the research required to find the right masters and also to propose doing right by them. One of the first results was For the First Time Anywhere, which unearthed a lot of previously unheard undubbed Holly demos, and Hoffman followed it up two years later with From the Original Master Tapes, the first Buddy Holly collection that was a revelation for its sound quality. Although it has been outdone in that department since, what with the advancement of digital technology and its uses, and there are compilations that take into account songs of his that became important in others' hands, this remains the best single-disc collection of Buddy Holly's music, featuring 20 of his biggest hits. The songs aren't presented in chronological order, but the disc flows well, running through every one of his hits and all of his best-known songs -- &quot;That'll Be the Day,&quot; &quot;Peggy Sue,&quot; &quot;Oh, Boy!,&quot; &quot;Maybe Baby,&quot; &quot;Rave On,&quot; &quot;Think It Over,&quot; &quot;Heartbeat,&quot; &quot;It Doesn't Matter Anymore,&quot; &quot;Everyday,&quot; &quot;Not Fade Away,&quot; &quot;Well ... All Right,&quot; and many others. A few terrific songs are missing, but From the Original Master Tapes remains a first-rate introduction and a nearly definitive summary of the highlights of Holly's brief recording career.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/from-the-original-master-tapes-r9467/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/from-the-original-master-tapes-r9467/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B000002O1U&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000002O1U&lt;/a&gt;\n\nTrack List:\n\n01. That'll Be The Day\n02. Oh, Boy!\n03. Not Fade Away\n04. Tell Me How\n05. Maybe Baby\n06. Everyday\n07. Rock Around With Ollie Vee\n08. It's So Easy\n09. I'm Lookin' For Someone To Love\n10. Peggy Sue\n11. I'm Gonna Love You Too\n12. Words Of Love\n13. Rave On\n14. Well... All Right\n15. Listen To Me\n16. Think It Over\n17. Heartbeat\n18. Reminiscing\n19. It Doesn't Matter Anymore\n20. True Love Ways\n","torrent":{"xt":"urn:btih:50349ad6a61c303a1248493fceb3594e627e2ee8","amp;dn":"Buddy+Holly+-+From+The+Original+Master+Tapes+%281985%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50349ad6a61c303a1248493fceb3594e627e2ee8","infoHashBuffer":{"type":"Buffer","data":[80,52,154,214,166,28,48,58,18,72,73,63,206,179,89,78,98,126,46,232]},"announce":[],"urlList":[]}}