{"title":"The Dementia Care Workbook {BBS}","uid":6734945,"size":3172593,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:519a90b145ff3c4841dc29d37faa57fb5eb15ef4&amp;dn=The+Dementia+Care+Workbook+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1318293799,"description":"&quot;I regard this as a long overdue and highly relevant addition to the literature on dementia care. Its grounding in the reality of practice and realistic approach will make it a very valuable workbook for a wide range of car workers. The book will play a large part in helping to improve dementia care by presenting a vision and manual for 'best fit' realistic practice.&quot;\nDanny Walsh, University of Nottingham, UK\n\n&quot;This is an excellent text for both undergraduate and postgraduate students. The strong emphasis on person centred approaches and relationships permeates throughout the book and the activities presented provide the reader with the opportunity to reflect upon their own practice and the best fit options identify interventions for consideration.&quot;\nSandra Fleming, School of Nursing and Midwifery, Trinity College Dublin, Ireland\n\n&quot;I thought this book was a very useful and detailed text exploring the world of the person with dementia and their carer.&quot;\nDr Alisoun Milne, Reader in Social Gerontology, School for Social Policy, Sociology and Social Research, University of Kent, UK\n\n&quot;Excellent text which provides a number of useful case studies which helps to demonstrate the application of evidence to practice. Well written, informative chapters.&quot;\nVal Howatson, Pathway Leader in Mental Health, Glasgow Caledonian University, UK\n\nThis workbook builds upon the person-centred approach to dementia care, and gives students, practitioners and carers a new way of looking at dementia and the people who live with it. The authors reflect upon the reality of working within dementia care and the importance of working positively with others to achieve the best care possible. The workbook is full of exercises and activities to try, all designed to help you engage and connect with the person with dementia, empowering both them and their families/carers. Key topics explored by the workbook includes:\n\n    * Understanding how it feels to live with dementia.\n    * Recognising the issues and feelings involved for family carers or healthcare professionals when caring for individuals with dementia\n    * Questioning your own care approach and attitudes to encourage more compassionate person-centred care\n\nThroughout the workbook, vignettes featuring two fictional characters living with dementia, provide examples of good and realistic practice and encourage you to examine your own practice and explore ways in which the care you give can be enhanced.\n\nThe Dementia Care Workbook is a valuable companion and learning tool for all those working with people with dementia\nAbout the Author\nAbout the authors:\n\nGary Morris is a mental health lecturer at the University of Leeds, UK. He teaches on the mental health nursing programme managing modules in dementia care and mental health issues and the media.\n\nJack Morris is a retired mental health lecturer from the University of Leeds UK. He has had educational commitments, clinical support, and an involvement in the auditing of dementia care services. ","torrent":{"xt":"urn:btih:519a90b145ff3c4841dc29d37faa57fb5eb15ef4","amp;dn":"The+Dementia+Care+Workbook+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"519a90b145ff3c4841dc29d37faa57fb5eb15ef4","infoHashBuffer":{"type":"Buffer","data":[81,154,144,177,69,255,60,72,65,220,41,211,127,170,87,251,94,177,94,244]},"announce":[],"urlList":[]}}