{"title":"Ventos de Agosto 2014 Nacional 1280x720p AAC 48KHz Makalakato","uid":13781345,"size":1788068849,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:52a03089343e4a01ab5a936492d7f2cf77509901&amp;dn=Ventos+de+Agosto+2014+Nacional+1280x720p+AAC+48KHz+Makalakato&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"makalakat","files":1,"time":1457330253,"description":"Portuguese spoken without subs.\r\n\r\nTrailer\n\r\nShirley deixou a cidade grande para viver em uma pequena e pacata vila litorânea cuidando de sua avó. Ela trabalha numa plantação de coco dirigindo trator. Mesmo isolada, cultiva o gosto pelo punk rock e o sonho de ser tatuadora. Ela está de caso com Jeison, um rapaz que também trabalha na fazenda de cocos e nas horas vagas faz pesca subaquática de lagosta e polvo. Um estranho pesquisador chega na Vila para registra o som dos ventos alísios que emanam da Zona de Convergência Intertropical. O mês de agosto marca a chegada das tempestades e das altas marés. Os ventos crescentes marcarão os próximos dias da pequena vila colocando Shirley e Jeison numa jornada sobre perda e memória, a vida e a morte, o vento e o mar.\r\n\r\nShirley has left the big city to live in a small seaside town and look after her elderly grandmother. She drives a tractor on a local coconut plantation, loves rock music and wants to be a tattoo artist. She feels trapped in the tiny coastal village. She is involved with Jeison, who also works on the coconut farm and who free dives for lobster and octopus in his spare time. During the month of August, when tropical storms pound the coastline, a researcher registering the sound of the trade winds emanating from the Intertropical Convergence Zone arrives in their village. The high tides and the growing winds mark the following days of the village and a surprise discovery takes Shirley and Jeison on a journey that confronts them with the duel between life and death, loss and memory, the wind and the sea","torrent":{"xt":"urn:btih:52a03089343e4a01ab5a936492d7f2cf77509901","amp;dn":"Ventos+de+Agosto+2014+Nacional+1280x720p+AAC+48KHz+Makalakato","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52a03089343e4a01ab5a936492d7f2cf77509901","infoHashBuffer":{"type":"Buffer","data":[82,160,48,137,52,62,74,1,171,90,147,100,146,215,242,207,119,80,153,1]},"announce":[],"urlList":[]}}