{"title":"Hawkwind 24 Bit Vinyl Pack","uid":8691550,"size":8859819976,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:54b0fca6c7bdf44037dd62901b07fb2f4ce65dbd&amp;dn=Hawkwind+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1373895178,"description":"\n  Hawkwind 24 Bit Vinyl Pack\n \n  Genre: Pop/Rock\n  Styles: Art Rock, Hard Rock, Heavy Metal, Prog-Rock, Space Rock\n  Source: Vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,800 - 5,600 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz, 192,000 Hz\n\n  Doremi Fasol Latido (192,000 Hz)\n  Hall of the Mountain Grill\n  In Search of Space\n  Independent Days Vol. 2\n  Levitation\n  Quark, Strangness and Charm\n  Warrior on the Edge of Time\n\n  Any sci-fi fan with long memories probably remembers those 1970s' DAW paperback editions of Michael Moorcock's sword-and-sorcery novels, with their images of heavily armored, very muscular warriors, carrying large swords and standing against eerie land- and starscapes. Take that imagery, throw in some terminology and names seemingly lifted from the Marvel Comics of the era (The Watcher, etc.) and particle physics articles of the period, translate it into loud but articulate hard rock music, and that's more or less what Hawkwind is about. One of England's longest-enduring heavy metal bands, Hawkwind was formed during the late '60s, just as art-rock was coming into its own. They combined bold guitar, synthesizer, and Mellotron sounds, creating heavy metal music that seemed to cross paths with Chuck Berry and the Moody Blues without sounding like either of them. \n\n  At their best, their early records sounded like the Beatles of &quot;Yer Blues&quot; combined with the Cream of &quot;I Feel Free.&quot; The introduction of lyrics steeped in science fiction and drug effects on their second album helped define the group and separate them from the competition -- in some ways they were like Pink Floyd with more of a rock &amp; roll beat and a vengeance. They've never charted a record anywhere near the same heights, but it's a sign of the dedication of the fans they do have that the group has dozens of albums available, including archival releases of decades-old live shows and multiple compilations.\n\n  Hawkwind's history has been marked by a series of confusing lineup changes, as members began an almost revolving-door relationship with the band virtually from the outset. The seeds of the group were planted when guitarist/singer Dave Brock and guitarist Mick Slattery of the group Famous Cure, which was playing a gig in Holland in 1969, met saxman/flautist/singer Nik Turner, a member of Mobile Freakout, on the same tour. Once back in England, Brock, Slattery, and Turner hooked up again and, adding John Harrison on bass, Terry Ollis on drums, and DikMik Davies on electronic keyboards, called themselves Group X, later changed to Hawkwind Zoo, and finally to Hawkwind. They secured a contract with United Artists/Liberty Records in England. Before the group recorded, however, Huw Lloyd Langton replaced Mick Slattery on guitar.\n\n  The fledgling band hooked up with two Pretty Things alumni -- drummer Viv Prince, who occasionally joined them on stage, and bassist (and onetime Rolling Stones member) Dick Taylor, who was recruited as a producer but played on their early records. Their first single, &quot;Hurry on Sundown&quot; (aka &quot;Hurry on a Sundown&quot;) b/w &quot;Mirror of Illusion,&quot; was released in July of 1970, just in time for Harrison to exit the lineup, to be replaced by bassist Thomas Crimble. Their first album, Hawkwind, was released to little public notice in August, but that same month the group made a modest splash by playing outside the fences of the Isle of Wight Festival.","torrent":{"xt":"urn:btih:54b0fca6c7bdf44037dd62901b07fb2f4ce65dbd","amp;dn":"Hawkwind+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54b0fca6c7bdf44037dd62901b07fb2f4ce65dbd","infoHashBuffer":{"type":"Buffer","data":[84,176,252,166,199,189,244,64,55,221,98,144,27,7,251,47,76,230,93,189]},"announce":[],"urlList":[]}}