{"title":"The Language of Men- A Memoir by Anthony D'Aries (retail) {dwg}","uid":10988386,"size":12766677,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:551b96a57b13b9f52cc13c2676e82fb5409f32b5&amp;dn=The+Language+of+Men-+A+Memoir+by+Anthony+D%27Aries+%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1409955861,"description":"Growing up in a working class town on Long Island, Anthony D'Aries watched his father rebuild muscle cars, groove to rock n roll, slice meat at the local deli, and bring roadkill back to life in his taxidermy workshop. Anthony, the impressionable younger son, loved his father. Emulated him. Acted out visceral scenes from &quot;Taxi Driver&quot; and &quot;Raging Bull&quot; with his dad and older brother. Soaked up his father's lurid wartime tales: the hooch and the hos in Nam. \n\n&quot;The Language of Men&quot; begins with Anthony's search to learn who his father was. When he travels to Vietnam with his wife, Vanessa, who has a job leading health and anatomy classes for sex workers in Ho Chi Minh City, Anthony isn't sure what he will find. Visiting Long Binh where his father was stationed, then seeing his relationship with Vanessa deteriorate, Anthony arrives at realizations that begin to explain his father's life, as well as his own troubling behaviors. Reluctant to deny or admit complicity, Anthony returns home to look for answers in his past.\n\nWhat does it cost to speak the language of men? In prose that sings sometimes defiantly, sometimes sadly, but always eloquently Anthony D'Aries transports us to the crossroads of gender and history, then leads us through the unsettling terrain that creates fathers, sons, brothers, and husbands.","torrent":{"xt":"urn:btih:551b96a57b13b9f52cc13c2676e82fb5409f32b5","amp;dn":"The+Language+of+Men-+A+Memoir+by+Anthony+D%27Aries+%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"551b96a57b13b9f52cc13c2676e82fb5409f32b5","infoHashBuffer":{"type":"Buffer","data":[85,27,150,165,123,19,185,245,44,193,60,38,118,232,47,181,64,159,50,181]},"announce":[],"urlList":[]}}