{"title":"Osho_The Hidden Splendor #05-love beyond words.mp4","uid":15054685,"size":898712111,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:55fe52e46100bf425018a7647275eae055e960d8&amp;dn=Osho_The+Hidden+Splendor+%2305-love+beyond+words.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drugarica","files":1,"time":1466691639,"description":"Osho_The Hidden Splendor\r\nChapter #5\r\nChapter title: This moment is more than enough\r\n14 March 1987 pm in Chuang Tzu Auditorium\r\n\r\nQuestion 1\r\n\r\nBELOVED Bhagwan,\r\n\r\nIS IT POSSIBLE THAT FOR SOME, MELTING WITH THE MASTER COMES FIRST, AND ALL ELSE FOLLOWS? OR ARE YOU AFTER ALL MY BELOVED AS WELL AS MY MASTER -- EVEN THOUGH I AM NOT SLEEPING IN YOUR ROOM!? JUST WITH A MOVE OF YOUR ARMS, FIRE SPREADS FROM DEEP WITHIN MY BODY AND GIGGLES OF PURE DELIGHT, LIGHTNESS AND JOY FOLLOW LIKE RIPPLES IN ITS WAKE. SOMETIMES A MOMENT OF YOUR SILENCE, OR THE IMPACT OF JUST A FEW OF YOUR WORDS, CARRIES ME STRAIGHT INTO INFINITE SPACE. OSHO, I FEEL THAT ANY MELTING THAT I HAVE KNOWN SO FAR IS OUT OF MY MELTING IN YOUR LOVE -- AND THAT MELTING WITH YOU IS EASIER FOR ME AND MORE POSSIBLE THAN MELTING WITH ANY OTHER MAN HAS BEEN. I HAVE NEVER MELTED IN A TOTAL ORGASM WITH A MAN, HOWEVER BELOVED. YET YOU SAY THIS HAS TO COME FIRST, BEFORE ANY MELTING WITH YOU. BELOVED MASTER, I AM SCARED TO EXPOSE ALL THIS, BUT TELL ME: HAVE I NOT KNOWN ANY MELTING AT ALL?\r\n\r\nPrem Arup, the physical world has definite laws without any exception. But the spiritual world has no laws as such, because there are always exceptions. That is part of the freedom of the spiritual area of our being. So whatever I say about the spiritual growth, always remember: there are exceptions, because it is a freedom of consciousness....\r\ndownload free osho audios and books from oshoworld(dot)com","torrent":{"xt":"urn:btih:55fe52e46100bf425018a7647275eae055e960d8","amp;dn":"Osho_The+Hidden+Splendor+%2305-love+beyond+words.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55fe52e46100bf425018a7647275eae055e960d8","infoHashBuffer":{"type":"Buffer","data":[85,254,82,228,97,0,191,66,80,24,167,100,114,117,234,224,85,233,96,216]},"announce":[],"urlList":[]}}