{"title":"Diabolical","uid":12959841,"size":28164116,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:57e575d9edd4cf0228d85823c72d19762fb710ea&amp;dn=Diabolical&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1449835641,"description":"Start practicing your evil laugh! As the world's greatest criminal mastermind, choose a lair, hire a minion, and steal the world's largest ball of aluminum foil! (Or, destroy the world. FINE.)\r\n\r\n&quot;Diabolical&quot; is a 130,000-word interactive novel by Nick Aires, where your choices control the story. It's entirely text-based--without graphics or sound effects--and fueled by the vast, unstoppable power of your imagination.\r\n\r\nFamous, feared, or filthy rich—why not all three? You've got the money and the motives to build an evil empire worthy of the most ruthless villain the world has ever seen. Crush the good guys and terrorize the populace! Stamp a big red &quot;FAIL&quot; on your enemies' foreheads! Plunder your way to world domination – or sit back and pet your kitty while your henchmen do it for you.\r\n\r\nWill you be a high-tech daredevil, a ruthless military soldier, or an apparition terrifying to behold? What calling card will you leave at the scene of your crimes? Whatever your choices, the results will be diabolical.\r\n\r\n    Play a villainous story of scheming, grandstanding, and laughing evilly.\r\n    Interview and hire the best possible (or best available) minion.\r\n    Decide when to use trickery, when to use force, and when to hide behind henchmen.\r\n    Choose the ultimate, guaranteed-to-be-infamous nickname.\r\n    Play as male or female, with straight, gay, and bisexual romance options.\r\n    Destroy the world!","torrent":{"xt":"urn:btih:57e575d9edd4cf0228d85823c72d19762fb710ea","amp;dn":"Diabolical","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57e575d9edd4cf0228d85823c72d19762fb710ea","infoHashBuffer":{"type":"Buffer","data":[87,229,117,217,237,212,207,2,40,216,88,35,199,45,25,118,47,183,16,234]},"announce":[],"urlList":[]}}