{"title":"Just Constraints - Article","uid":4568924,"size":5005055,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:57f738ba4d77c76cd77be05908130fbad8ef7de0&amp;dn=Just+Constraints+-+Article&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SwissLos","files":1,"time":1228986088,"description":"AUTHOR: ANDREW MASON\n\nABSTRACT: \nPolitical theorists disagree about the extent to which issues of feasibility, stability, institutional design and human nature can be bracketed in analysing the concept of justice. At one end of the spectrum some argue that no analysis of justice can be adequate in the absence of an account of how it could be implemented, whereas at the other end there are those who argue that principles of justice are logically independent of issues of feasibility. Influenced by the work of John Rawls, many theorists occupy the middle ground, maintaining that\nanalyses of justice must be realistic, that is, realizable under the best of foreseeable conditions. Against Rawls and others, this article argues that feasibility does not constrain what can count as an adequate principle of\njustice but nevertheless maintains that there are limits on such principles that derive in part from human nature,which divergent theories of justice must respect. It also distinguishes between different levels of analysis, some of which are governed by feasibility constraints.","torrent":{"xt":"urn:btih:57f738ba4d77c76cd77be05908130fbad8ef7de0","amp;dn":"Just+Constraints+-+Article","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57f738ba4d77c76cd77be05908130fbad8ef7de0","infoHashBuffer":{"type":"Buffer","data":[87,247,56,186,77,119,199,108,215,123,224,89,8,19,15,186,216,239,125,224]},"announce":[],"urlList":[]}}