{"title":"Coast to Coast AM 2012.02.23 Unexplained Sounds","uid":7074913,"size":56200930,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:587e87e05dac6f0ea5d8404c77d1756466bb4f2d&amp;dn=Coast+to+Coast+AM+2012.02.23+Unexplained+Sounds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ViViDSOL","files":5,"time":1330801689,"description":"Coast to Coast AM 2012.02.23 Unexplained Sounds\n\nHost: \tGeorge Noory\nGuests: Linda Moulton Howe, Stephen Bassett\n\nIn three half-hour segments, investigative reporter Linda Moulton Howe discussed the large number of strange and unexplained horn-like sounds filling the air since March 2011 and possible causes. The phenomenon surfaced after a number of videos were uploaded on YouTube from such divergent places as Norway, Costa Rica, Tennessee and Kiev, Ukraine. Recently, Linda interviewed two witnesses in Tennessee, who in separate locations, heard the Kiev-like horn sounds on January 18-19, 2012. One of the witnesses, retired real estate agent Cindy Smith was packing her car for a trip when the air was filled with the Kiev horn sounds coming from every direction. The strange sounds lasted about 30 seconds and left Cindy frightened, wanting to know what happened.\n\nA woman in Topeka, Kansas told Linda she was awakened on September 3, 2011 at her Perry Lake vacation home by the sound of &quot;a television turned on in the distance with voices we could not make out.&quot; Yet, as she and her husband discovered, no television was on in their home when the sounds were heard. More here. In January 2012, an Azerbaijan geophysicist named Elchin Khalilov released an article in which he suggested the strange sounds people are hearing are related to &quot;acoustic-gravity waves caused by powerful solar flares and plasma emissions from the sun.&quot; However, when Linda interviewed NASA solar physicist David Hathaway he doubted that solar activity could be connected with the sounds. Read her full interview with him.\n\nLinda raised an interesting hypothesis-- &quot;what if some of the strange sounds heard around the world...were part of an American government test of what some have called 'voice of God' weapons?&quot; Around the time of 9-11, there were rumors that the Defense Dept. wanted to try sending directed sound waves into the minds of Middle East terrorists, she noted. Linda also presented a report on the increased number of dolphins stranded and dying in Cape Cod &amp; the New Jersey shore since January 2012. She spoke with marine biologist Trevor Spradlin who found the incidents to be unprecedented and perplexing.\n\nNew Disclosure Petition\n\nFirst hour guest, UFO disclosure activist Stephen Bassett talked about a new petition he is spearheading, which is posted on the White House/We the People website. In response to a previous petition, the Obama administration declared that the US govt. has no knowledge of ET contact, so the new petition asks for information related to the Rockefeller Initiative which was said to investigate the ET question during the Clinton administration. Bassett noted that the new petition needs to get 25,000 signatures in order to receive a response from the government.\n\nNews segment guests: Steve Shenk, Christian Wilde\n\nWebsite(s):\n &lt;a href=&quot;\nhttp://earthfiles.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://earthfiles.com&lt;/a&gt; &lt;a href=&quot;\nhttp://paradigmresearchgroup.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://paradigmresearchgroup.org&lt;/a&gt;\n\nBook(s):\n\nGlimpses of Other Realities, Volume 2 &lt;a href=&quot;\nhttp://amzn.to/x31AS6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/x31AS6&lt;/a&gt;\n\nMysterious Lights and Crop Circles &lt;a href=&quot;\nhttp://amzn.to/yCTVvu&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/yCTVvu&lt;/a&gt;\n","torrent":{"xt":"urn:btih:587e87e05dac6f0ea5d8404c77d1756466bb4f2d","amp;dn":"Coast+to+Coast+AM+2012.02.23+Unexplained+Sounds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"587e87e05dac6f0ea5d8404c77d1756466bb4f2d","infoHashBuffer":{"type":"Buffer","data":[88,126,135,224,93,172,111,14,165,216,64,76,119,209,117,100,102,187,79,45]},"announce":[],"urlList":[]}}