{"title":"Anna Levander - De Morten Trilogie. NL Ebook. DMT ","uid":12245849,"size":3072859,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5966ac79e6b5b6d446f026f9a3d029753c8b9bf4&amp;dn=Anna+Levander+-+De+Morten+Trilogie.+NL+Ebook.+DMT+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BiWild","files":6,"time":1439906142,"description":"Anna Levander - De Morten Trilogie. NL Ebook. DMT \n\nAuteur: Anna Levander \nPagina's: 286 / 274 / 285\nTaal: Dutch/Nederlands\nUitgever: Querido's Uitgeverij B.V\nJaar van uitgifte: 2014/2015\nGenre: Thriller\n\nSamenvatting:\n\nAfbeelding\n\nMorton\nDe ambitieuze politicus Morten Mathijsen stevent af op een glorieuze verkiezingsoverwinning. Zijn partij, De Nieuwe Liberalen, \ngaat verrassend aan kop in de peilingen. Mathijsen is de tweede man van de partij en wil leider worden. Dan dreigt een duistere \nzaak uit het verleden zijn reputatie te schaden. Met de briljante spindoctor Evelien Bax aan zijn zijde gaat Morten tot het uiterste \nom het onheil af te wenden. De machtsstrijd maakt meerdere slachtoffers.\n\n\nAfbeelding\n\nMo \nDe kersverse premier Morten Mathijsen doet alles wat in zijn macht ligt om de laffe moord op zijn spindoctor op te lossen. Door zijn \nobsessieve klopjacht op de dader laat hij steken vallen als eerste minister. Intussen leggen interne ruzies bij De Nieuwe Liberalen een \nbom onder het kabinet. De getalenteerde politicus Mo Limam is de gedoodverfde nieuwe fractievoorzitter, maar hij komt keihard in \nbotsing met Mathijsen over de anti-terreurwetgeving. De nieuwe Islamitische Partij Nederland spint garen bij het conflict \nen bij de toenemende polarisatie in de samenleving. Escalatie dreigt.\n\n\nAfbeelding\n\nM \nPremier Morten Mathijsen wendt al zijn macht aan om de publicatie van het schandaalboek van zijn voormalige spindoctor Marijn \nte voorkomen. Hij breekt genadeloos reputaties, maar de vrouwen die hij heeft beschadigd zinnen op wraak. Mortens ex-vrouw \nEsther, die in de gevangenis zit, krijgt de rechters op haar hand. De fractie van De Nieuwe Liberalen is gespleten. \nEen premiercrisis lijkt onafwendbaar. Weet Morten het tij nog te keren?\n\nMet dank aan de originele poster !! \n\nDeze review wordt u aangeboden door\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:5966ac79e6b5b6d446f026f9a3d029753c8b9bf4","amp;dn":"Anna+Levander+-+De+Morten+Trilogie.+NL+Ebook.+DMT+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5966ac79e6b5b6d446f026f9a3d029753c8b9bf4","infoHashBuffer":{"type":"Buffer","data":[89,102,172,121,230,181,182,212,70,240,38,249,163,208,41,117,60,139,155,244]},"announce":[],"urlList":[]}}