{"title":"intervention research.mark w.fraser,et al.2009.pdf","uid":10091102,"size":788742,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59c08c0be5dc30260a2713236d6d5cc90e9120a2&amp;dn=intervention+research.mark+w.fraser%2Cet+al.2009.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sswbzh01","files":1,"time":1399198199,"description":"Intervention Research: Developing Social Programs (Pocket Guides to Social Work Research Methods)\nMark W. Fraser (Author), Jack M. Richman (Author), Maeda J. Galinsky (Author), Steven H. Day (Author)\n\nProduct Details\nFile Size: 1831 KB\nPrint Length: 224 pages\nPublisher: Oxford University Press, USA; 1 edition (April 2, 2009)\nLanguage: English\nASIN: B002Y26U10\n\nBook Description \nWhen social workers draw on experience, theory, or data in order to develop new strategies or enhance existing ones, they are conducting intervention research. This relatively new field involves program design, implementation, and evaluation and requires a theory-based, systematic approach. Intervention Research presents such a framework.\n\nThe five-step strategy described in this brief but thorough book ushers the reader from an idea's germination through the process of writing a treatment manual, assessing program efficacy and effectiveness, and disseminating findings. Rich with examples drawn from child welfare, school-based prevention, medicine, and juvenile justice, Intervention Research relates each step of the process to current social work practice. It also explains how to adapt interventions for new contexts, and provides extensive examples of intervention research in fields such as child welfare, school-based prevention, medicine, and juvenile justice, and offers insights about changes and challenges in the field.\n\nThis innovative pocket guide will serve as a solid reference for those already in the field, as well as help the next generation of social workers develop skills to contribute to the evolving field of intervention research.\n\nReview\n&quot;[T]his volume is a very useful addition to the intervention research literature and should be useful to both students of intervention research and practitioners (and future practitioners) who will be the consumers of evidence-based programs.&quot;--PsycCritiques\n\n\n&quot;Intervention Research is an indispensable resource for students, practitioners, and researchers engaged in related work, and is an appropriate choice as a primary or supplementary textbook in master's or doctoral level methodology courses.&quot;--Research on Social Work Practice\n\n\n&quot;Intervention Research is an indispensable resource for students, practitioners, and researchers engaged in related work, and is an appropriate choice as a primary or supplementary textbook in master's or doctoral level methodology courses.&quot; -- Byron J. Powell, Washington University, St. Louis, Research on Social Work Practice\n\n\nAbout the Author\nMark W. Fraser, Ph.D., holds the John A. Tate Distinguished Professorship for Children in Need and is Associate Dean for Research at the School of Social Work, University of North Carolina-Chapel Hill. Jack M. Richman, Ph.D., is the Dean of the School of Social Work, University of North Carolina-Chapel Hill. Maeda J. Galinsky, Ph.D., is Kenan Distinguished Professor Emerita at the School of Social Work, University of North Carolina-Chapel Hill. Steven H. Day, M.C.P., is a Research Assistant Professor at the School of Social Work, University of North Carolina-Chapel Hill. ","torrent":{"xt":"urn:btih:59c08c0be5dc30260a2713236d6d5cc90e9120a2","amp;dn":"intervention+research.mark+w.fraser%2Cet+al.2009.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59c08c0be5dc30260a2713236d6d5cc90e9120a2","infoHashBuffer":{"type":"Buffer","data":[89,192,140,11,229,220,48,38,10,39,19,35,109,109,92,201,14,145,32,162]},"announce":[],"urlList":[]}}