{"title":"The Imaginarium of Doctor Parnassus BLUE-RAY [UK Release] minino","uid":5255004,"size":1303495614,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5a12b9d712f181daf60c8d646542514222680e2c&amp;dn=The+Imaginarium+of+Doctor+Parnassus+BLUE-RAY+%5BUK+Release%5D+minino&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fieldupload","files":-1,"time":1262518778,"description":"The Imaginarium of Doctor Parnassus is a fantastical morality tale, set in the present day. It tells the story of Dr Parnassus and his extraordinary 'Imaginarium', a travelling show where members of the audience get an irresistible opportunity to choose between light and joy or darkness and gloom. Blessed with the extraordinary gift of guiding the imaginations of others, Dr Parnassus is cursed with a dark secret. Long ago he made a bet with the devil, Mr Nick, in which he won immortality. Many centuries later, on meeting his one true love, Dr Parnassus made another deal with the devil, trading his immortality for youth, on condition that when his first-born reached its 16th birthday he or she would become the property of Mr Nick. Valentina is now rapidly approaching this 'coming of age' milestone and Dr Parnassus is desperate to protect her from her impending fate. Mr Nick arrives to collect but, always keen to make a bet, renegotiates the wager. Now the winner of Valentina will be determined by whoever seduces the first five souls. Enlisting a series of wild, comical and compelling characters in his journey, Dr Parnassus promises his daughter's hand in marriage to the man that helps him win. In this captivating, explosive and wonderfully imaginative race against time, Dr Parnassus must fight to save his daughter in a never-ending landscape of surreal obstacles - and undo the mistakes of his past once and for all... \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1054606&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1054606&lt;/a&gt;","torrent":{"xt":"urn:btih:5a12b9d712f181daf60c8d646542514222680e2c","amp;dn":"The+Imaginarium+of+Doctor+Parnassus+BLUE-RAY+%5BUK+Release%5D+minino","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a12b9d712f181daf60c8d646542514222680e2c","infoHashBuffer":{"type":"Buffer","data":[90,18,185,215,18,241,129,218,246,12,141,100,101,66,81,66,34,104,14,44]},"announce":[],"urlList":[]}}