{"title":"Ship.Simulator.Extremes.Update.4-SKIDROW","uid":6090081,"size":273986143,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5a1c6a5953e8ef58bb55abca44573c0d8c7f30c1&amp;dn=Ship.Simulator.Extremes.Update.4-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rlf-rls","files":-1,"time":1294513752,"description":"Ship Simulator: Extremes Update 4\n\nRELEASE DATE: 07-01-2011      PROTECTION: Steam + cgr + Serial\nGAME TYPE: Ship Simulator     DISKS: CRACKED UPDATE\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks\nWe're a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We don't earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties\n\nIf you think you got something to offer, then don't hold back\non contacting us as soon as possible\n\n\ntwice the fun \\/ double the trouble\n\n\n---------------------------------------------------------------\n\n\nSweet and dear RELOADED:\n\nWe could easy write a &quot;god who knows endless&quot; pages long reply\nto you, but why taking the effort, when you obviously want to\ndeceive the general nfo reader\n\nIt's obvious that to actually mark our SecuROM cracks as a\nloader, it has to be a loader(a loader is responsible for\nloading programs, one of the essential stages in the process\nof starting a program, it means loader is a program that\nplaces programs into memory and prepares them for execution.)\n\nLet's use a few lines to explain what we have done, as you\nobvious don't have taken the time to look at our work. It's\nfairly easy to explain as we patch the original SecuROM exe to\nplace our dll into memory, where the SecuROM calls gets the\nproper return value, meaning that the calls are emulated. This\nnothing out of the ordinary, as you use the same type of\nmethod to emulate VM calls. In sort terms, we simply just\nemulated the whole protection. With ours you can perfectly\nload them into a debugger too. Get your facts right, before\naccusing our SecuROM method for being a loader\n\nAbout Steam:\n\nWe wish to see a example of one of the integrity or system\nchecks which you were talking about, because we haven't found\nany of those and all our cracks are working flawless unlike\nyours\n\nAbout Protection Keygens:\n\nWe're pretty sure you would have propered anyone that made\nSecuROM activated, the same way you do that for Solidshield v1\nand v2. Furthermore keygens were allowed by the premise that\nyou can activate a product were the activation is integrated\ninto the product, and not for exe wrappers that have\nabsolutely nothing to do with the general product. You talk\nabout breaking the protection on it's own premise by doing\ncommercial protections with a keygen, that's not any\ndifferent, than our SecuROM emulation method\n\nConclusion:\n\nWe don't want to waste any more time on this matter, as it's\nobvious nfo shooting on a level the general gamer don't\nunderstand, nor is interested in understanding, as long as\nthey can play the games. Even the majority of the scene, has\nno clue about these things, so why do you think you can fool\nus with your blurry rule bending and untrue propaganda\n\nSo from now on, we won't reply to more of your propaganda\nconcerning this matter, and remember you once dominated the\ngame iso releasing scene, you don't anymore\n\n\n\nOn with the game release information:\n\nShip Simulator: Extremes Update 4 General\n* New Feature: Mission Editor is now available from the main\nmenu. Manual available from the Windows Start menu\n\n* New Feature: Antialiasing functionality is now accessible\nfrom options -&gt; graphics -&gt; quality settings menu\n\n* New Feature: Shortcut in Windows Start menu to access game\nphoto folder\n\n* New Feature: Added navigation lights on bouys\n* New Feature: Cinematic in-game camera added. Select from\ncamera GUI. LMB click to set camera location, LMB click\nagain to set camera height\n\n* Performance Improvement: Allow the game to allocate more\nmemory, upto 3GB, on 64-bit systems\n\n* Performance Improvement: Duplicate mission behaviour; just\nthe duplicate mission will be omitted and the user will get\nnotified in the main menu\n\n* Performance Improvement: Allow more parts of the game to run\nin a separate thread, optimizing performance\n\n* Visual Improvements: Lightened up the night, Brighter\nambient colours, More prominent reflections, Buoy navlights\n\n* Fixed an issue where a duplicate file could interfere with\nseveral menu's in-game\n\n* Fixed an issue where mission savegames could corrupt ship\ncontrols\n\n* Various smaller bugfixes Mission editor\n\n* Mission Editor added\n\n* Updated Feature: added multiselecttool\n* Updated Feature: double-click anywhere in the environment to\ncenter the camera's focus point there Chart\n\n* Added depth display ranges\n\n* More realistic buoy positioning Missions\n\n* New Feature: Added bollards to freeroaming in all\nenvironments\n\n* Improved freeroam traffic pathfinding\n\n* Fixed an issue where autopilot would incorrectly warn about\nother ships\n\n* Fixed and added better descriptions for several mission\nobjectives Ships\n\n* New Feature: Added anchor chains and dropping anchors\n* New Feature: multiple helmsman cameras on appropriate ships\ncycle through them with the GUI or the shortcut key (2)\n\n* New Feature: helmsman camera panning, use default camera\npanning actions to pan the camera left or right\n\n* New Feature: Added functionality for SS08-style controlling\nusing dual throttles by moving the center of the levers\n\n* New Feature: Added working Bridge-wing controls\n* New Feature: Moving indicators on ship bridges (rpms, rudder\nangles)\n\n* New Feature: Moving radar on bridge monitors\n* New Feature: Rowboat deployables on Red Eagle\n\n* New Feature: Navigation light state 'fishing'\n* New Feature: Option to switch a Ferry's general direction\n\n* Improved tighter mooring ropes (tighter)\n\n* Improved performance of ship update\n\n* Improved smoke particles on most ships\n\n* Improved ship dynamics\n\n* Improved navigation lights\n\n* Improved mouse-response for controls\n\n* Improved ship bridge layouts\n\n* Improved ship bridge control types\n\n* Fixed and added several missing hull ship names\n\n* Fixed an issue where controls on several ships could\ninterfere with eachother (mouse/keyboard)\n\n* Fixed an issue and made walkthrough run mode functional\nagain\n\n* Fixed an issue with collision of the Red Eagle\n\n* Fixed an issue where the GUI indicator would display\nnegative (port) values while they should be positive\n(starboard) Multiplayer\n\n* Improved network ship dynamics\n\n* Improved stability\n\n* Fixed an issue where the ocean state was not syncronized\namong peers\n\n* Fixed an issue where the in-game time was reset upon\nrejoining a session\n\n\n\nInstall Notes:\n\n1. Unpack the included rar files\n2. Run Ship.Simulator.Extremes.Update.4.exe and install\n3. Copy the cracked content from SKIDROW directory to your\nmain installation directory and overwrite\n4. Type anything at the serial check screen (only needed once)\n5. Play the game\n\nAdditional Notes:\n\nYou don't need to have any of the previous updates installed\nas this update is featuring all previous updated content\n\n\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS","torrent":{"xt":"urn:btih:5a1c6a5953e8ef58bb55abca44573c0d8c7f30c1","amp;dn":"Ship.Simulator.Extremes.Update.4-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a1c6a5953e8ef58bb55abca44573c0d8c7f30c1","infoHashBuffer":{"type":"Buffer","data":[90,28,106,89,83,232,239,88,187,85,171,202,68,87,60,13,140,127,48,193]},"announce":[],"urlList":[]}}