{"title":"Boys And Girls Alone S01E02 - FREE TRACKER","uid":4727393,"size":398215152,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5acb4f9ad33858cb9cadb6b1ff184287c0b10e69&amp;dn=Boys+And+Girls+Alone+S01E02+-+FREE+TRACKER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"FlyingNaked","files":2,"time":1234820685,"description":"!!THIS IS A FREE TORRENT - THIS MEANS YOU CAN DOWNLOAD IT WITHOUT REGISTRATION!!\n\nGenre: Reality Tv Broadcasted On Channel 4 in the United Kingdom On Februari 10th 2009\n\nBoys And Girls Alone is a documentary series where 20 children between the ages of 8 and 11 discover what life would be like if they lived together without any parents. The boys and girls set up home in two different camps.\n\nPart 2\n\nAfter only three days of adventure, the boys - most of who can't cook - are wet, hungry and missing their mums. Meanwhile, the girls\nhave gone from baking cakes to splitting into warring gangs. Looking on, their parents decided to step in to put their kids back on track.\nThe children are given money to feed and entertain themselves for three days. While the boys invest in essentials like wrestling belts and\nDr Who action figures, surviving on meagre rations, the girls blow their money, filling three trolleys with huge quantities of food. That is\nonce they've demonstrated the age old cliche about women and map reading.\nMeanwhile, Ade and Charley, who elected themselves leaders of the two villages, soon learn that power comes with its downsides as\nrevolution brews amongst their subjects. And the parents find it hard to watch as their children continue to struggle to get along.\nAs the three days looking after their own finances comes to an end, it's the boys that have done better. Whilst the girls are skint and are\nreduced to smoking fake cigarettes and gambling with rabbits as the chips; the boys come together as a cohesive unit and discover that\nsharing is the way to go.\n\n\nCodec/Info: XviD project\n\nPlayTime: 47mn 32s\n\nBit rate: 979 Kbps\n\nWidth: 624 pixels\n\nHeight: 352 pixels\n\nFrame rate: 25.000 fps\n\nCodec: MPEG-1 Audio layer 3\n\nCodec profile: Joint stereo\n\nBit rate: 129 Kbps\n\nBit rate mode: VBR\n\nChannel(s): 2 channels\n\nWriting library: LAME3.90\n\nEncoding settings: VBR\n\n\nURL: &lt;a href=&quot; http://www.tvrage.com/shows/id-21598&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.tvrage.com/shows/id-21598&lt;/a&gt;\n\n\n*All credits goes to the original uploader","torrent":{"xt":"urn:btih:5acb4f9ad33858cb9cadb6b1ff184287c0b10e69","amp;dn":"Boys+And+Girls+Alone+S01E02+-+FREE+TRACKER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5acb4f9ad33858cb9cadb6b1ff184287c0b10e69","infoHashBuffer":{"type":"Buffer","data":[90,203,79,154,211,56,88,203,156,173,182,177,255,24,66,135,192,177,14,105]},"announce":[],"urlList":[]}}