{"title":"The Revolution - A Manifesto","uid":4707930,"size":307763456,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5bde60df5e0f285b10ce2b35ea6b2413c5a71793&amp;dn=The+Revolution+-+A+Manifesto&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Brooksie92","files":57,"time":1233880439,"description":"Congressman, Republican Presidential candidate and author Dr. Ron Paul (A Foreign Policy of Freedom) says &quot;Let the revolution begin&quot; with this libertarian plea for a return to &quot;the principles of our Founding Fathers: liberty, self-government, the Constitution, and a noninterventionist foreign policy.&quot; Specific examples demonstrate how far U.S. law has strayed from this path, particularly over the past century, as well as Paul's firm grasp of history and dedication to meaningful debate: &quot;it is revolutionary to ask whether we need troops in 130 countries... whether the accumulation of more and more power in Washington has been good for us...to ask fundamental questions about privacy, police-state measures, taxation, social policy.&quot; Though he can rant, Paul is informative and impassioned, giving readers of any political bent food for thought. With harsh words for both Democrats and Republicans, and especially George W. Bush, Paul's no-nonsense text questions the &quot;imperialist&quot; foreign policy that's led to the war in Iraq (&quot;one of the most ill considered, poorly planned, and... unnecessary military conflicts in American history&quot;), the economic situation and rampant federalism treading on states' rights and identities (&quot;The Founding Fathers did not intend for every American neighborhood to be exactly the same&quot;). Though his policy suggestions can seem extreme, Paul's book gives new life to old debates. ","torrent":{"xt":"urn:btih:5bde60df5e0f285b10ce2b35ea6b2413c5a71793","amp;dn":"The+Revolution+-+A+Manifesto","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bde60df5e0f285b10ce2b35ea6b2413c5a71793","infoHashBuffer":{"type":"Buffer","data":[91,222,96,223,94,15,40,91,16,206,43,53,234,107,36,19,197,167,23,147]},"announce":[],"urlList":[]}}