{"title":"Evan Marc (Bluetech) - Dreamtime Submersibles 2008","uid":4265059,"size":176724096,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5c08e91f968b36bf8fe2f3d19684d4b8c927b460&amp;dn=Evan+Marc+%28Bluetech%29+-+Dreamtime+Submersibles+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hueg678e","files":7,"time":1214611465,"description":"Evan Marc - Dreamtime Submersibles 2008\n\n1. Evan Marc - Intention Craft (13:21)\n2. Evan Marc - Hypnagogue (7:57)\n3. Evan Marc - Alpha Phase (9:46)\n4. Evan Marc - Theta Phase (9:45)\n5. Evan Marc - Delta Phase (9:40)\n6. Evan Marc - Hypnopomp (11:32)\n7. Evan Marc - Resurface (11:40)\n\nOver the course of his career, Steve Hillage has gained a lifetime (or two) worth of insight into music. While establishing his name as a Rock guitarist he turned toward the Ambient to realize the now classic Rainbow Dome Musick. Later, working as a producer, then on to collaborations with The Orb, Hillage reconciled these many worlds with the formation of the bands 777, System 7 and Mirror System. Evan Marc also views music as an interdependent system. Recording and performing under the name Bluetech as well as the multi-faceted Evan Bartholomew, Evan Marc explores everything from techno to contemporary instrumental to Ambient. Dreamtime Submersible (67&amp;#039;00&quot;) brings Evan Marc and Steve Hillage together for seven connected tracks of techno-infused, trance-based electronica more for the thinker than the dancer. Within the first few moments of Dreamtime Submersible the pace is set with a throbbing bassline and steady pulse - the bare instrumentation stripping the music down to its core. As the music propels forward, rhythmic elements are added, subtracted, reversed and augmented in minimalist fashion. Intricate layers of shifting electronic percussion, synth pops, accents and effects provide an engaging listening experience. But what really sets this work apart is the top-notch guitar artistry of Steve Hillage. At various points throughout this album we hear the atmospheric wavering of Hillage&amp;#039;s glissando guitar. Half melody, half-textural source, under heavy reverb and delay the voice-like tone rises amidst the ongoing beats. Elsewhere his strumming accumulates into interlocking echo waves. With the beats gone several levels of loops slowly mix between one another - allowing the CD to conclude in a more cerebral zone. Both popular and accomplished, Steve Hillage and Evan Marc create music at the service of the mind.","torrent":{"xt":"urn:btih:5c08e91f968b36bf8fe2f3d19684d4b8c927b460","amp;dn":"Evan+Marc+%28Bluetech%29+-+Dreamtime+Submersibles+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c08e91f968b36bf8fe2f3d19684d4b8c927b460","infoHashBuffer":{"type":"Buffer","data":[92,8,233,31,150,139,54,191,143,226,243,209,150,132,212,184,201,39,180,96]},"announce":[],"urlList":[]}}