{"title":"Jeff Buckley - You and I (2016) [16.44 CD FLAC]","uid":15128929,"size":267159598,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5c6b3a6d56ea8d03e332c534ef87b12e17620ace&amp;dn=Jeff+Buckley+-+You+and+I+%282016%29+%5B16.44+CD+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":13,"time":1467134842,"description":"\n  Jeff Buckley - You and I (2016) [16.44 CD FLAC]\r\n\r\n  Genre: Rock\r\n  Styles: Singer/Songwriter, Alternative\r\n  Source: CD (log + cue)\r\n  Codec: FLAC \r\n  Bit rate: ~ 1,000 kbps\r\n  Bit depth: 16\r\n  Sample rate: 44.1 kHz\r\n\r\n  01 Just Like a Woman\r\n  02 Everyday People\r\n  03 Don't Let the Sun Catch You Cryin\r\n  04 Grace\r\n  05 Calling You\r\n  06 Dream of You and I\r\n  07 The Boy with the Thorn in His Side\r\n  08 Poor Boy Long Way from Home\r\n  09 Night Flight\r\n  10 I Know It's Over\r\n\r\n  Jeff Buckley recorded the ten tracks that comprise the 2016 compilation You and I in February 1993, roughly four months after he signed to Columbia Records. He'd start recording Grace, his lone completed studio album, with producer Andy Wallace a few months after he laid down these sketches, but despite containing a solo demo of &quot;Grace,&quot; the closest connection to the music on You and I is the coffeehouse crooner showcased on Live at Sin-e, the EP released as a teaser toward the conclusion of 1993. Like that EP and its accompanying 2003 expansion, You and I relies on covers delivered by Buckley, accompanied by nothing more than his electric guitar, strummed as if it were an acoustic. Much of the repertoire showcased on this album will be familiar to any Gen-Xer who attended college during the height of alternative rock: classic rock numbers intertwined with the Smiths and standards, and tunes chosen to telegraph the singer's influences while also providing context for the originals. Occasionally, there's a slight surprise -- Buckley attempts Bukka White's Delta stomp on a slippery, slurred version of &quot;Poor Boy Long Way from Home&quot; -- but usually, You and I feels of a piece with the rest of his early work: he zeroes in on both the funk and spectral qualities of Zeppelin, he elongates Bob Dylan, plays &quot;Don't Let the Sun Catch You Cryin'&quot; relatively straight, and he finds his heart in Morrissey &amp; Marr, drawing equally from the heartbreak and jangle. All these tunes may have been composed by other writers, but in Buckley's hands they seem to belong to him, which is the highest compliment that can ever be paid to a vocalist","torrent":{"xt":"urn:btih:5c6b3a6d56ea8d03e332c534ef87b12e17620ace","amp;dn":"Jeff+Buckley+-+You+and+I+%282016%29+%5B16.44+CD+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c6b3a6d56ea8d03e332c534ef87b12e17620ace","infoHashBuffer":{"type":"Buffer","data":[92,107,58,109,86,234,141,3,227,50,197,52,239,135,177,46,23,98,10,206]},"announce":[],"urlList":[]}}