{"title":"The Demon Haunted World - Science As A Candle In The Dark - By C","uid":4189786,"size":619917824,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5ca54d729713abdec2a4cddbf2d3ac2555c09793&amp;dn=The+Demon+Haunted+World+-+Science+As+A+Candle+In+The+Dark+-+By+C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheAutomator","files":3,"time":1210884097,"description":"*******************************************************************************\n           The Demon Haunted World: Science As A Candle In The Dark\n                                 By: Carl Sagan\n*******************************************************************************\n\n-------------------------------------------------------------------------------\n                              General Information\n-------------------------------------------------------------------------------\nType.................: AudioBook\nPlatform.............: Any MP3 Player\nMore Info............: http://www.amazon.com/gp/product/0345409469\n\nTitle................: The Demon Haunted World: Science As A Candle In The Dark\nArtist...............: Carl Sagan\nYear.................: 1995\nGenre................: Speech\nComment..............: Complete and Unabridged AudioBook\nDuration.............: 14 Hours 20 Minutes\nNumber of Songs......: 1 Single MP3 File\n\nGenre................: Non-Fiction / Philosophy of Science\n\nAudio Format.........: MP3\nBitrate..............: 96 Kbps CBR\nSource...............: Tape (With Audio Quality Edits and Silence Removal)\nRecording............: Audio Cassettes Recorded Using Audio Record Wizard 3\n-------------------------------------------------------------------------------\n                                 Release Notes\n-------------------------------------------------------------------------------\nAmazon.com\nCarl Sagan muses on the current state of scientific thought, which offers him \nmarvelous opportunities to entertain us with his own childhood experiences, the \nnewspaper morgues, UFO stories, and the assorted flotsam and jetsam of \npseudoscience. Along the way he debunks alien abduction, faith-healing, and \nchanneling; refutes the arguments that science destroys spirituality, and \nprovides a &quot;baloney detection kit&quot; for thinking through political, social, \nreligious, and other issues.\n\nFrom Publishers Weekly\nEminent Cornell astronomer and bestselling author Sagan debunks the paranormal \nand the unexplained in a study that will reassure hardcore skeptics but may \nleave others unsatisfied. To him, purported UFO encounters and alien abductions \nare products of gullibility, hallucination, misidentification, hoax and \ntherapists&amp;#039; pressure; some alleged encounters, he suggests, may screen memories \nof sexual abuse. He labels as hoaxes the crop circles, complex pictograms that \nappear in southern England&amp;#039;s wheat and barley fields, and he dismisses as a \nnatural formation the Sphinx-like humanoid face incised on a mesa on Mars, first \nphotographed by a Viking orbiter spacecraft in 1976 and considered by some \nscientists to be the engineered artifact of an alien civilization. In a \npassionate plea for scientific literacy, Sagan deftly debunks the myth of \nAtlantis, Filipino psychic surgeons and mediums such as J.Z. Knight, who claims \nto be in touch with a 35,000-year-old entity called Ramtha. He also brands as \nsuperstition ghosts, angels, fairies, demons, astrology, Bigfoot, the Loch Ness \nmonster and religious apparitions.\n\nFrom Library Journal\nIn a chapter entitled &quot;Science and Hope,&quot; Sagan (Pale Blue Dot, Random, 1994) \nwrites: &quot;This book is a personal statement, reflecting my lifelong love affair \nwith science.&quot; Accordingly, he deplores pseudoscientific thinking and the \ncredulous beliefs that emerge from it. Today, when science is critical for \nsolving the world&amp;#039;s problems, many people, instead, trust astrology and New Age \nspiritualism. Likewise, surveys reveal that a majority of Americans believe that \nEarth is regularly visited by space aliens. Using basic tools of \nscience?empiricism, rationalism, and experimentation?Sagan debunks these and \nother common fallacies of pseudoscience. In doing so, he speculates as to how \nsuch beliefs arise. Some of his explanations are not entirely convincing (are \nalien-abduction tales really modern versions of medieval myths?), but he handles \nthem with empathy so as to not demean the intelligence of true believers. The \nbest chapters examine the state of science education and technical literacy in \nAmerica and suggest an agenda for improving both. Still, Sagan&amp;#039;s theme is \nimportant, and his popularity might lure some readers from the UFO and occult \nbooks cluttering so many library and bookstore shelves. For public and \nundergraduate libraries.\n\nThe New York Times Book Review, James Gorman\nWhile he touches on various sorts of pseudoscience and antiscience, including \nrepressed memories of all sorts, creationism, belief in miracles and, to his \ncredit, the claims of tobacco companies that cigarettes have not been shown to \nbe harmful, Mr. Sagan&amp;#039;s primary target is the widespread belief in alien \nabductions . . . he is seldom wrong . . . [and] he always writes clearly. \n\nFrom Booklist\nSagan has devoted himself to the noble mission of rousing us from our stuporous \nneglect of science. His accessible and passionate books about the cosmos, our \norigins, and space exploration (Pale Blue Dot ) open doors of perception into \nexciting realms many nonscientists simply avoid. In his newest book, Sagan \nconducts a vigorous inquiry into why science is so &quot;hard to learn and hard to \nteach&quot; and asks why so many people embrace the sort of &quot;pseudoscience&quot; \nassociated with New Age beliefs or served up in the pages of tabloids. \nWidespread scientific illiteracy and a dearth of critical thinking are &quot;perilous \nand foolhardy,&quot; Sagan tells us, and that&amp;#039;s obviously true. To show us just how \ndeluded we can be, Sagan tackles the popular belief in extraterrestrials and \nalien abduction stories, debunking a number of half-baked but commonly held \nassumptions simply by asking commonsensical questions. He moves on to the whole \n&quot;recovered memory&quot; debacle, then segues into a very convincing discussion of \nhallucinations. Ultimately, he links today&amp;#039;s aliens with yesterday&amp;#039;s demons in \nthis lithe, well-supported, sometimes quite wry, and altogether refreshing \nperformance. Stick to the facts, Sagan tells us, &quot;There are wonders enough out \nthere without our inventing any.&quot; There are wonders within, too, all we need to \ndo is learn to use them.","torrent":{"xt":"urn:btih:5ca54d729713abdec2a4cddbf2d3ac2555c09793","amp;dn":"The+Demon+Haunted+World+-+Science+As+A+Candle+In+The+Dark+-+By+C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ca54d729713abdec2a4cddbf2d3ac2555c09793","infoHashBuffer":{"type":"Buffer","data":[92,165,77,114,151,19,171,222,194,164,205,219,242,211,172,37,85,192,151,147]},"announce":[],"urlList":[]}}