{"title":"Monte Cassino: Ten Armies in Hell - spanikopita","uid":7775586,"size":4569209,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d24a2eca009bea83019d5f7f35d0b2ead4c1a78&amp;dn=Monte+Cassino%3A+Ten+Armies+in+Hell+-+spanikopita&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"spanikopita","files":2,"time":1351644662,"description":"Peter Caddick-Adams \nHardcover: 384 pages\nPublisher: Oxford University Press, USA (April 1, 2013)\nLanguage: English\nISBN-10: 0199974640\nISBN-13: 978-0199974641\n\nThe most horrific battles of World War II ring in the popular memory: Stalingrad, the Bulge, Iwo Jima, to name a few. Monte Cassino should stand among them. Waged deep in the Italian mountains beneath a medieval monastery, it was an astonishingly brutal encounter, grinding up ten armies in conditions as bad as the Eastern Front at its worst. \n\nNow the battle has the chronicle it deserves. In Monte Cassino, military historian Peter Caddick-Adams provides a vivid account of how an array of men from across the globe fought the most lengthy and devastating engagement of the Italian campaign in an ancient monastery town. Not simply Americans, British, and Germans, but Russians, Indians, Georgians, Nepalese, Ukrainians, French, Slovaks, Armenians, New Zealanders, and Poles, among others, fought and died there. Caddick-Adams offers a panoramic view, surveying the strategic heights and peering over the shoulders of troops fruitlessly digging for cover in the stony soil. Here are incisive sketches of the theater commanders--Field Marshal &quot;Smiling Albert&quot; Kesselring, who outmaneuvered Rommel to command German troops in Italy, and the English aristocrat General Harold Rupert Leofric George Alexander, tall, upbeat, &quot;and--crucially for Churchill--looked every inch a general.&quot; Caddick-Adams puts Cassino into the context of the Italian campaign and larger Allied war plans, and takes readers into the savage, often hand-to-hand combat in the bombed-out medieval town. He captures the brutal weather and unforgiving terrain--the rubble and rocky slopes that splintered dangerously under artillery barrages and caused shellfire to echo with such volume that men had trouble keeping their sanity due to acoustics alone. Over four months, the struggle would inflict some 200,000 casualties, and Allied planes would level the historic monastery-and eventually the entire town as well.\n\nWith scholarly care, insightful analysis, and narrative verve, Caddick-Adams has crafted a monumental account of one of World War II's lesser-known but no less devastating battles.\n\n---\n\nMOBI","torrent":{"xt":"urn:btih:5d24a2eca009bea83019d5f7f35d0b2ead4c1a78","amp;dn":"Monte+Cassino%3A+Ten+Armies+in+Hell+-+spanikopita","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d24a2eca009bea83019d5f7f35d0b2ead4c1a78","infoHashBuffer":{"type":"Buffer","data":[93,36,162,236,160,9,190,168,48,25,213,247,243,93,11,46,173,76,26,120]},"announce":[],"urlList":[]}}