{"title":"The Parade - Sunshine Girl","uid":10627937,"size":321282052,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5ddb96274583f85adb4f2ceffd3e7df50190167f&amp;dn=The+Parade+-+Sunshine+Girl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Roman_Bornski","files":25,"time":1406259242,"description":"Sunshine pop pioneers Parade teamed veteran songwriter and producer Jerry Riopelle (a former Phil Spector associate who'd played keyboards on sessions headlined by the Ronettes, the Righteous Brothers, and Ike &amp; Tina Turner) with character actors Murray MacLeod (known for his work on television series including Hawaii Five-O and Kung Fu) and Allen &quot;Smokey&quot; Roberds. MacLeod and Roberds -- longtime friends and songwriting partners who occasionally collaborated with Roger Nichols of A Small Circle of Friends fame, leading to erroneous rumors that Roberds and Nichols were in fact one and the same -- met Riopelle while unsuccessfully pitching a song written for Spector to produce; the trio soon christened themselves Parade, co-writing &quot;Sunshine Girl&quot; and selling the song to A&amp;M producer Chuck Kay. Recorded with session legends including drummer Hal Blaine, bassist Carol Kaye, and saxophonist Teenage Steve Douglas, &quot;Sunshine Girl&quot; cracked the Billboard Top 20 in 1967, emerging as one of the first and most successful records to embody the summery, harmony-rich sound that would later be dubbed sunshine pop. During the process of recording the follow-up, &quot;She's Got the Magic,&quot; fellow actor Stuart Margolin -- later &quot;Angel&quot; on the classic TV series The Rockford Files -- joined Parade as well; the second single failed to repeat the success of &quot;Sunshine Girl,&quot; however, missing the pop charts altogether. The same fate befell the group's third release, &quot;Frog Prince,&quot; although in 1968, Parade climbed as high as number 127 with &quot;Radio Song.&quot; After two more flops, &quot;She Sleeps Alone&quot; and &quot;Hallelujah Rocket,&quot; the group dissolved. While Riopelle later signed to Capitol as a solo act, MacLeod and Roberds briefly signed to Epic as Ian &amp; Murray; as Freddie Allen, Roberds also recorded an early version of Nichols' and Paul Williams' &quot;We've Only Just Begun,&quot; later a worldwide smash for the Carpenters.","torrent":{"xt":"urn:btih:5ddb96274583f85adb4f2ceffd3e7df50190167f","amp;dn":"The+Parade+-+Sunshine+Girl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ddb96274583f85adb4f2ceffd3e7df50190167f","infoHashBuffer":{"type":"Buffer","data":[93,219,150,39,69,131,248,90,219,79,44,239,253,62,125,245,1,144,22,127]},"announce":[],"urlList":[]}}