{"title":"Ricky Martin - Livin' La Vida Loca (English Version)","uid":4672602,"size":132474884,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5e6c990987869f9301b4ea6f912629c42680d438&amp;dn=Ricky+Martin+-+Livin%5C%27+La+Vida+Loca+%28English+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1232791292,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Livin' la Vida Loca&quot; (English: Living the Crazy Life) is a song by Puerto Rican singer Ricky Martin. It was released in 1999 from Martin's self-titled debut English album. The song was composed by Desmond Child and Ricky Martin and topped the charts during 1999. It received various Grammy nominations and helped Ricky Martin obtain enormous success inside the United States and worldwide.\n\nThe song is generally seen as the song that began the latin pop explosion of 1999 (ending in early 2002), and making the acceptance of other Latin artists (first Marc Anthony, Jennifer Lopez, and Enrique Iglesias, then later Shakira &amp; Paulina Rubio) easier to crossover into the English market. Before this time, most non-Latino Americans had never heard of Ricky Martin until his show-stopping performance of La Copa de la Vida at the 1999 Grammy Awards show, which became a catalyst in bringing latin pop into the forefront of the U.S. music scene.\n\nThe video was directed by Wayne Isham, and received six nominations at the 1999 MTV Video Music Awards, (Video Of The Year, Best Male Video, Best Pop Video, Best Dance Video, Best Choreography in a Video and Viewers Choice), winning Best Pop Video, Best Dance Video and two extra awards for Viewers Choice internationally.\n\n&quot;Livin la Vida Loca&quot; was Ricky Martin's first number-one hit (and only to date), it stayed at number one in the U.S. for five weeks and peaked at number 10 on the year-end charts of 1999.\n\n&quot;Livin' la Vida Loca&quot; is especially monumental because it was the first No. 1 song to be recorded, edited, and mixed totally on a DAW (digital audio workstation). It is seen by audio-production enthusiasts everywhere as the song that marked the shift from analog recording to digital recording.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5e6c990987869f9301b4ea6f912629c42680d438","amp;dn":"Ricky+Martin+-+Livin%5C%27+La+Vida+Loca+%28English+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e6c990987869f9301b4ea6f912629c42680d438","infoHashBuffer":{"type":"Buffer","data":[94,108,153,9,135,134,159,147,1,180,234,111,145,38,41,196,38,128,212,56]},"announce":[],"urlList":[]}}