{"title":"Little Village - Little Village [1991] 192k cbr","uid":4579423,"size":67002148,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5e7ba22c00fee1a26b133a344b3f2d52adf97615&amp;dn=Little+Village+-+Little+Village+%5B1991%5D+192k+cbr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cyclone7","files":12,"time":1229362589,"description":"Little Village - &quot;Little Village&quot; - 192K CBR\n\n01. Little Village - Solar Sex Panel (3:47)\n02. Little Village - The Action (3:24)\n03. Little Village - Inside Job (4:15)\n04. Little Village - Big Love (6:24)\n05. Little Village - Take Another Look (3:39)\n06. Little Village - Do You Want My Job (5:37)\n07. Little Village - Don't Go Away Mad (3:38)\n08. Little Village - Fool Who Knows (3:45)\n09. Little Village - She Runs Hot (3:18)\n10. Little Village - Don't Think About Her When You're Trying To Drive (4:32)\n11. Little Village - Don't Bug Me While I'm Working (3:55)\n\n\nLittle Village was formed in 1991* by Ry Cooder (guitar, vocal), John Hiatt (guitar, piano, vocal), Nick Lowe (bass, vocal) and Jim Keltner (drums). This group of musicians had previously worked together as a unit -- albeit not under the Little Village name - recording the John Hiatt solo album, Bring The Family in 1987. Upon reconvening in 1992, the group's name was initially (and jokingly) announced as Hiatus. It was soon changed to Little Village in reference to a famous in-studio diatribe by Sonny Boy Williamson II.\nLittle Village recorded their first and last proper group album in mid-1992. The self-titled record featured a set of songs composed by all four group members. The songs were largely sung by Hiatt, although Lowe took lead on two songs and Cooder one. Prior to its release, the Little Village album was heavily anticipated in some quarters. Bring The Family was (and still is) considered to be one of Hiatt's finest albums, and a reunion of the group that recorded it fostered great critical \nexpectations. However, upon being issued Little Village met with only lukewarm reviews and general commercial indifference. The consensus was that the material on the album seemed somewhat thin, as if the composers were saving their best work for their solo careers.[citation needed] Nevertheless, the album was nominated for a Grammy Award in the &quot;Best Album&quot; category.\nThe Little Village album release was followed by a number of well-received concerts in the U.S. and Europe. Nevertheless, the group disbanded in late 1992.\n[http://en.wikipedia.org/wiki/Little_Village] \n\n*{Wiki states 1992 but this cd was recorded in 1991] -c7\n","torrent":{"xt":"urn:btih:5e7ba22c00fee1a26b133a344b3f2d52adf97615","amp;dn":"Little+Village+-+Little+Village+%5B1991%5D+192k+cbr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e7ba22c00fee1a26b133a344b3f2d52adf97615","infoHashBuffer":{"type":"Buffer","data":[94,123,162,44,0,254,225,162,107,19,58,52,75,63,45,82,173,249,118,21]},"announce":[],"urlList":[]}}