{"title":"Call Of Duty 1 Classic Single and Multi Play Noinstall","uid":13636192,"size":1258034281,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5f04835490db8a07971c776c94d08603f8b3cb9f&amp;dn=Call+Of+Duty+1+Classic+Single+and+Multi+Play+Noinstall&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"21AP237","files":206,"time":1456077995,"description":"Call Of Duty 1/Classic Version 1.4 noinstall with multiplayer\r\n\r\n\r\n1. First run the Call Of Duty MPSettings .reg file to load the correct multiplayer game settings to your computer. (Important otherwise multiplayer wont work).\r\n\r\n\r\n2. If you want to play call Of Duty online multiplayer browse the Call of Duty folder and lunch CoDMP.exe Wen the game starts select a server form the main menu or refresh favorites in the server browser.\r\n\r\n\r\n4. To Play call of duty singleplayer browse the Call of Duty folder and lunch CoDSP.exe\r\n\r\n\r\nNOTE!!\r\n\r\nIf you get an error &quot;can not write to hunkusage.dat&quot;, this is fixed by deleting this file located in /main/HUNKUSAGE.DAT in the Call Of Duty Directory\r\n\r\n\r\nHave Fun! If you have any questions feel free to email me at   \r\n\r\n\r\n\r\n\r\n\r\nCall of Duty is a 2003 first-person shooter video game developed by Infinity Ward and published by Activision, the first installment of the Call of Duty video game series.[2] The game simulates the infantry and combined arms warfare of World War II. The game is based on the Quake III: Team Arena engine. It was accompanied in September 2004 by an expansion pack, Call of Duty: United Offensive, which was produced by Activision, and developed by Gray Matter Interactive, with contributions from Pi Studios. Call of Duty is similar in theme and gameplay to Medal of Honor, as it is made out of single-player campaigns and missions. However, unlike Medal of Honor, the war is seen not just from the viewpoint of an American soldier but also from the viewpoint of British, Canadian, and Soviet soldiers.\r\nThe game was somewhat unusual at the time in that throughout the single-player mode the player is joined by computer-controlled allies who range in quantity from two infantrymen (in some of the British missions) to an entire regiment of tanks (in the Soviet missions). The computer-controlled allies will support the actual player during the missions. They also further the game's goal of providing an immersive and realistic experience; that is, soldiers in World War II were usually part of a larger group, as opposed to the &quot;lone wolf&quot; seen in video games such as Medal of Honor. However, there are some missions where the player is alone.\r\nThe &quot;Hardened&quot; and &quot;Prestige&quot; editions of Call of Duty: Modern Warfare 2, released on November 10, 2009, includes a redemption code to download the game for Xbox 360 and PlayStation 3, giving it a new title, Call of Duty Classic","torrent":{"xt":"urn:btih:5f04835490db8a07971c776c94d08603f8b3cb9f","amp;dn":"Call+Of+Duty+1+Classic+Single+and+Multi+Play+Noinstall","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f04835490db8a07971c776c94d08603f8b3cb9f","infoHashBuffer":{"type":"Buffer","data":[95,4,131,84,144,219,138,7,151,28,119,108,148,208,134,3,248,179,203,159]},"announce":[],"urlList":[]}}