{"title":"Frontman: Obama's Darkest Secrets Revealed","uid":11775068,"size":3862995,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f50ee2d29e5917f942bc36624114d3bd4885580&amp;dn=Frontman%3A+Obama%27s+Darkest+Secrets+Revealed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427247612,"description":"In 2008, Barack Obama became the face of hope and change. Yet lurking behind the scenes is a host of personages who long ago selected this man to forward their global agenda. FRONTMAN reveals the actual powers behind his throne: Bilderberg plotters, Zionist handlers, global financiers and Marxist activists. Critics have called Obama an empty suit, but in actuality, the suit is filled by a cabal of men and women whose primary goal is to radically transform the United States. To cover their tracks, an air of secrecy has enveloped Obama's past, including his birth records, college transcripts and employment history.\n\nWhile other books merely scratch the surface, FRONTMAN tears away the deceptive smoke and mirrors that have been used to propel him into the Oval Office. By far the most comprehensive expose to date, President Barack Obama can no longer hide behind a facade that has been carefully created and orchestrated over the past few decades by people who are still pulling his strings.\n\nThe title says it all: America's commander-in-chief is merely a figurehead for much more powerful people and forces. Now, at long last, one of the most brutally honest portraits ever presented shows how our nation is being controlled by unseen hands that are leading us perilously close to disaster","torrent":{"xt":"urn:btih:5f50ee2d29e5917f942bc36624114d3bd4885580","amp;dn":"Frontman%3A+Obama%27s+Darkest+Secrets+Revealed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f50ee2d29e5917f942bc36624114d3bd4885580","infoHashBuffer":{"type":"Buffer","data":[95,80,238,45,41,229,145,127,148,43,195,102,36,17,77,59,212,136,85,128]},"announce":[],"urlList":[]}}