{"title":"Broken 2012 DVDRip Sonata Premiere","uid":9094750,"size":731220462,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5ff0bbfccc8e6a65f08269993ba79540363f6af3&amp;dn=Broken+2012+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":2,"time":1382656811,"description":"The summer holidays have just begun and 11 year-old Skunk's afternoons are full of day dreams and curious wanderings around her neighborhood - with the exception that she must regularly give herself injections to combat her type 1 diabetes. When, one day, Skunk (Eloise Laurence) discovers her bitter and angry older neighbor, Mr. Oswald (Rory Kinnear), savagely beating Rick, a psychologically-troubled boy from the neighborhood whom Mr. Oswald's daughter has callously and fictitiously accused of rape, Skunk's innocence begins to vanish. Trying to find solace with her loving nanny (Zana Marjanovic) and father (Tim Roth), with whom she is very close, Skunk is unwittingly drawn into her neighbors' unfolding melodrama involving violence, sex, and life-shattering illness. Her home, her neighborhood and her school all become treacherous environments where the happy certainties of childhood give way to a fear-filled doubt, and the promise of a complex, broken future. Overwhelmed by her experiences, Skunk herself is drawn into an ethereal chaos from which she may only return through the intense love of those closest to her. ","torrent":{"xt":"urn:btih:5ff0bbfccc8e6a65f08269993ba79540363f6af3","amp;dn":"Broken+2012+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ff0bbfccc8e6a65f08269993ba79540363f6af3","infoHashBuffer":{"type":"Buffer","data":[95,240,187,252,204,142,106,101,240,130,105,153,59,167,149,64,54,63,106,243]},"announce":[],"urlList":[]}}