{"title":"The $19 Cure for AIDS","uid":3536221,"size":121069,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:603b821752bcab9746be185c7cf7faff33aff353&amp;dn=The+%2419+Cure+for+AIDS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kibbles5757","files":14,"time":1160387809,"description":"The included html file shows the web page from the patent office for a blood purifier invention. The story about this invention is told in the 2 text files in this torrent and are both written by Wayne Green (the founder of 73 Magazine, Byte, CD Review, Cold Fusion and dozens of other magazines). (Check out Wayne Green\\&amp;#039;s \\&quot;been-there, done-that\\&quot; brag list at www.secretstohealth.us/author.html) The following is part of the included text file titled \\&quot;The $19 Cure for A.I.D.S.\\&quot;, which is just part of Mr. Green\\&amp;#039;s wonderful daily blog which inspired me to create this torrent. \n\n\nThe Blood Purifier\n\n    \\&quot;This is a long story. Normally I?d make a booklet out of it, but since some of the information can?t be sent through the mail, this is the only medium I have.\n    It started with an old friend mentioning that Bob Beck, a mutual friend, had developed a simple cure for AIDS. Hey! So I called Bob and he faxed me the story.\n    Drs. Lyman and Kaali, at the Albert Einstein College of Medicine at Yeshiva University in New York had accidentally discovered that when they passed a tiny electric current through blood it prevented any virus, microbe, parasite, yeast infection or fungus from replicating, causing them to die. Yep, it worked on anything, including HIV, the AIDS virus. So they got a patent on the process (#5,188,738), but never published anything about it.\n    When Bob noticed a small item in a magazine about it, being a physicist and an inventor, he figured why take the blood out to treat it? How about passing the small current through the blood while it?s still in the body? \n    So he put together a little gadget to provide the needed 35-volts and used a small relay to reverse the current flow a few times a second so a resistance to it wouldn?t build up. Next, he got a local clinic to test it, and sure enough, they were quickly curing AIDS patients.\n    I wrote about this in my 73 Amateur Radio Today magazine, asking the readers to design a solid-state blood purifier instead of using that clicking relay. One did and I published the circuit in the May 1996 issue. The unit used $19 in parts. A few of the readers built the circuit and I began getting reports of AIDS cures. And hepatitis.\n    My next step was to publish a booklet with the story and a reprint of the article. \n    Then, about three years ago, I got a letter from the Post Office saying that since the blood purifier hadn?t been okayed by the FDA, it was, by law fraudulent, and I would be fined $25,000 for each booklet I sent through the mail. That mess cost me over $30,000 in legal fees.\n    The fact that it worked and had been proven by a medical clinic to work was irrelevant. The Post Office officials said that if I even mentioned the patent number in a mail piece I?d be fined. \n    So much for the power of the FDA to protect the pharmaceutical industry...\\&quot; - from Wayne Green\\&amp;#039;s blog of 7/16/06 at www.waynegreen.com/wayne/news.html","torrent":{"xt":"urn:btih:603b821752bcab9746be185c7cf7faff33aff353","amp;dn":"The+%2419+Cure+for+AIDS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"603b821752bcab9746be185c7cf7faff33aff353","infoHashBuffer":{"type":"Buffer","data":[96,59,130,23,82,188,171,151,70,190,24,92,124,247,250,255,51,175,243,83]},"announce":[],"urlList":[]}}