{"title":"Dagboek van Anne Frank/De originele verfilming van het dagboek","uid":4180569,"size":1409440201,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:605e5472d2a6726c255cf765cd951e42337e1916&amp;dn=Dagboek+van+Anne+Frank%2FDe+originele+verfilming+van+het+dagboek+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mike1968","files":2,"time":1210375461,"description":" &lt;a href=&quot;http://www.edith.nl/Rouwen/klas4g/daniellehampsink/anne.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.edith.nl/Rouwen/klas4g/daniellehampsink/anne.gif&lt;/a&gt;\n\n\nHaar familie verhuisde in 1933 van het Duitse Frankfurt am Main, waar Anne was geboren, naar Amsterdam om aan vervolging door de nazi&amp;#039;s te ontkomen. De eerste tijd woonde het gezin Frank in een Amsterdamse nieuwbouwwijk, op het Merwedeplein (achter het Victorieplein). Ze was net 13 jaar oud toen ze in juli 1942 onderdook in het Achterhuis, een kleine ruimte van twee verdiepingen achter het bedrijf van Otto Frank op de Prinsengracht 263. De deur naar het achterhuis zat verstopt achter een boekenkast.\n\nAnne Frank en haar familie verloren hun Duitse nationaliteit door een Duitse naziwet uit 1941, die alle Joden buiten Duitsland hun staatsburgerschap ontnam. De familie werd op dat moment staatloos. Of de Duitse naziwet die de naar het buitenland gevluchte Duitse Joden hun staatsburgerschap ontnam ooit later is ingetrokken is niet bekend.\n\nZe woonden in het Achterhuis van 6 juli 1942 tot 4 augustus 1944. Er woonden in totaal acht mensen in het huis: Otto en Edith Frank (Annes ouders), Annes oudere zus Margot, Fritz Pfeffer, een Joodse tandarts (in het dagboek Dussel geheten), en de heer en mevrouw Van Pels met hun zoon Peter (in het dagboek Van Daan geheten).\n\nIn deze jaren hield Anne een dagboek bij, waarin ze schrijft over haar angst tijdens het onderduiken, haar ontluikende gevoelens voor Peter, de ruzies met haar ouders en haar ambities om schrijver te worden. Het enige stukje natuur dat Anne kon zien vanaf de zolderkamer was de top van een kastanjeboom, die door de beschrijving in het dagboek later als Anne Frankboom bestempeld zou gaan worden. Ze schreef een aantal schriften vol, en alsof ze zich realiseerde dat het na de oorlog een echt boek kon worden, herschreef ze een groot gedeelte. In tien weken schreef ze 324 vellen vol, maar ze kreeg het niet af.\n\nSource: De Tros (TVrip)\nDe originele verfilming van het dagboek van anne frank.\n\nVoor de liefhebber een Must See.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1183895/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1183895/&lt;/a&gt;","torrent":{"xt":"urn:btih:605e5472d2a6726c255cf765cd951e42337e1916","amp;dn":"Dagboek+van+Anne+Frank%2FDe+originele+verfilming+van+het+dagboek+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"605e5472d2a6726c255cf765cd951e42337e1916","infoHashBuffer":{"type":"Buffer","data":[96,94,84,114,210,166,114,108,37,92,247,101,205,149,30,66,51,126,25,22]},"announce":[],"urlList":[]}}