{"title":"Peter Wolf - Midnight Souvenirs 2010 (flac)","uid":6431587,"size":331098249,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:61548f16d4c2058a71afe1c2b3834e3c537b3a94&amp;dn=Peter+Wolf+-+Midnight+Souvenirs+2010+%28flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1306628516,"description":"Peter Wolf (born Peter W. Blankfield, March 7, 1946) is an American Rhythm and Blues, Soul and Rock and Roll musician, best known as the lead vocalist for the J. Geils Band from 1967 to 1983 and for a successful musical solo career to date with writing partner Will Jennings besides being a renowned painter.\n\nWolf was born in the Bronx, New York. He planned a career as an artist, but he got a job in the late 1960s as a disc jockey on then-cutting edge Boston FM radio station WBCN and began exploring his interest in blues and rhythm and blues music, giving himself the nickname the Wolfa Goofa, sometimes expanded to the Wolfa Goofa with the Green Teeth (as mentioned in the intro to Must of Got Lost on the Blow Your Face Out album). Later as solo artist he called himself Woofa Goofa Mama Toofa. He formed a group called the Hallucinations who performed with The Velvet Underground, Howlin' Wolf, Muddy Waters, Van Morrison, John Lee Hooker, and Sun Ra. He then saw the J. Geils Blues Band in concert and quickly joined. He was the vocalist and frontman, and often acted as a sort of manager. Wolf was known for his charismatic stage antics of fast-talking quips and pole-vaulting with the microphone stand. He and keyboard player Seth Justman were responsible for most of the songwriting. Creative differences followed their Freeze-Frame album, causing the J. Geils Band and Peter Wolf to part ways in 1983.\n\nWolf became a solo artist for the next 15 years, but in 1999 the J. Geils Band reunited for several appearances, with Wolf resuming his duties as lead vocalist. They separated again, and Wolf began touring once more, as a solo act. Wolf's first solo record, Lights Out (1984) was produced by Michael Jonzun of the Jonzun Crew, features Adrian Belew, and has a somewhat funky, electro sound. The eponymous single became a hit single the same year, peaking at no.12 on the Billboard Hot 100. He recorded many duets with the likes of Aretha Franklin, Little Milton, John Lee Hooker, Don Covay, and Wilson Pickett to name just a few.\nLong Line was co-produced with two musician friends, Johnny A. and a Bob Dylan backup band member, Stu Kimball. Tim Archibald (Bass) and Brian Maes (keys and backing vocals) who are both members of Ernie And The Automatics, played on the record and Toured in support of Long Line. His next two solo albums, Fool's Parade and Sleepless (the latter featuring guest appearances from Mick Jagger and Keith Richards), were both highly praised by Jann Wenner in Rolling Stone, receiving four-and-a-half and five stars, respectively. Sleepless (2002) was noted as one of the 500 greatest albums of all time in Rolling Stone issue 937. He has performed on stage with such diverse people as Bruce Springsteen and Phil Lesh. Wolf toured in 2008 with Kid Rock and Rev. Run on The Rock N Roll Revival Tour. He performed Love Stinks solo with Kid Rock's band. Then he joined Kid Rock for Ain't Too Proud to Beg, Musta Got Lost, Centerfold (from the J. Geils album Freeze Frame) and For What It's Worth. The J. Geils Band re-united for a series of shows in 2009, including opening night at the Boston House of Blues. On August 14, 2010 the J. Geils Band teamed up with Aerosmith for a concert at Boston's Fenway Park. The following week on August 21, the J. Geils Band performed at the DTE Music Theatre in Clarkston, MI.\n\nWolf's 2010 album Midnight Souvenirs won Album of the Year at the Boston Music Awards. On Midnight Souvenirs Wolf performed duets with Shelby Lynne, Neko Case and Merle Haggard.\n\n 1. Tragedy (with Shelby Lynne)\n 2. I dont wanna know\n 3. Watch her move\n 4. There's still time\n 5. Lying low\n 6. The green fields of summer (with Neko Case)\n 7. Thick As Thieves\n 8. Always asking for you\n 9. Then it leaves us all behind\n10. Overnight lows\n11. Everything I do (gonna be funky)\n12. Dont try to change her\n13. The night comes down (for Willy Deville)\n14. It's too late for me (with Merle Haggard)\n","torrent":{"xt":"urn:btih:61548f16d4c2058a71afe1c2b3834e3c537b3a94","amp;dn":"Peter+Wolf+-+Midnight+Souvenirs+2010+%28flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61548f16d4c2058a71afe1c2b3834e3c537b3a94","infoHashBuffer":{"type":"Buffer","data":[97,84,143,22,212,194,5,138,113,175,225,194,179,131,78,60,83,123,58,148]},"announce":[],"urlList":[]}}