{"title":"Ancestors...In Dreams And Time(2012)[FLAC]","uid":7300447,"size":444431493,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:62541541e1fb7c15f0bd68c00a34fa45eb28d281&amp;dn=Ancestors...In+Dreams+And+Time%282012%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":9,"time":1338020625,"description":"\nWhispers\n\nThe Last Return\n\nCorryvreckan\n\nOn The Wind\n\nRunning In Circles\n\nFirst Light\n\n\n\nClever name, clever cover art, marketed as a progressive metal band, this could be interesting could have been my first thoughts in regards to this album. This is an album that has spun in my player for 23 times now according to pietunes, something that ought to indicate that I know the album rather well by now since these plays has been during the latest two weeks as well. These ancestors are of american descent and they have before this one released two albums which would make this the third, I also noticed while researching this band that the earlier albums I noticed were rather well received and that doom/stoner was mentioned a bit. I am no good in categorising music as it is more of a feeling and an adventure than something quantifiable for me anyway, but that is what others say so for helping you pinpoint somewhat I could put it here.\n\n\n\nThere are a few things that become apparent rather quickly when you listen to this album, one is the atmospheric sense that run through the entire album giving it a sense of adventure. Another thing is the long tracks, you will reflect on this while listening because it is hard to miss, the average playing time of the tracks is staggering, over ten minutes, on average. There are six tracks on the album and the playing time is 66 minutes and only one track is shorter than nine minutes and three play for longer than ten. So the long song box is clearly ticked for these guys, the sound is good providing this atmosphere so I must say that the production is a high class one. Another thing you will reflect upon while listening to this album is how sparse the vocals are used, sure there are vocals and quite a bit of them but it still feels like the songs are more focused on instrumental parts than the vocals. It gives a touch of a post metal feel, that is if I have understood that term correctly which I may not have done.\n\n\ncd ripped with X Lossless Decoder version 20120407 (140.0)\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:62541541e1fb7c15f0bd68c00a34fa45eb28d281","amp;dn":"Ancestors...In+Dreams+And+Time%282012%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62541541e1fb7c15f0bd68c00a34fa45eb28d281","infoHashBuffer":{"type":"Buffer","data":[98,84,21,65,225,251,124,21,240,189,104,192,10,52,250,69,235,40,210,129]},"announce":[],"urlList":[]}}