{"title":"Anne Feeney - If I Can't Dance 2006","uid":6572642,"size":335204791,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:627320b3aeaa68d996fd4ce4b4077b3ef981fc5d&amp;dn=Anne+Feeney+-+If+I+Can%5C%27t+Dance+2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1312038321,"description":"Anne Feeney (born July 1, 1951) is a political activist, folk musician and singer-songwriter.\nAnne Feeney was born in Charleroi, Pennsylvania to Annabelle Runner and Edward J. Feeney. She has a sister, Kathleen, born May 3, 1953. The family moved to the Brookline section of the city of Pittsburgh in 1954. She graduated from Resurrection elementary school in 1964.\n\nFeeney graduated from Fontbonne Academy, a Catholic girls' high school run by the Sisters of St. Joseph, in 1968. After saving for one year, she purchased a Martin D-28 guitar that she retired from service after 40 years. The Vietnam War and Civil Rights Movement were influential events that shaped her politics and songwriting. Feeney was also influenced by her grandfather, William Patrick Feeney, who was a mineworkers' organizer and violinist who also used his music in the service of political and labor causes.\n\nIn 1972 she was arrested in Miami at the Republican National Convention where she was protesting Richard Nixon's re-nomination for President of the United States. The charges were subsequently dismissed. Later that year she co-founded Pittsburgh Action Against Rape, which still provides services to rape victims in the Pittsburgh area. She graduated from the University of Pittsburgh in 1974 with a Liberal Studies degree. In 1976 she joined a bluegrass band - Cucumber Rapids. Feeney played rhythm guitar and acoustic double bass. The other members of the band were John Wiley Nelson (guitar), Paul Boas (harmonica), Gary Mohler (guitar and dobro) and Bill Vandivier (banjo, bass and trumpet). Later on, Larry Zierath (mandolin) replaced Gary Mohler, and violinist John Mattes joined the band shortly thereafter. The group disbanded in 1977. Feeney married labor attorney Ron Berlin on November 19, 1977. She graduated from the University of Pittsburgh School of Law in 1978. Feeney is the mother of two children, Dan (1979) and Amy (1981) Berlin. She worked for 12 years as a trial attorney and served as president of the Pittsburgh Musicians' Union (the only woman ever elected to this position) from 1997-1998. Feeney's marriage to Ron Berlin ended in divorce in 1995. She has always been involved in community activism and regional performances at political and labor rallies. She is a member of the Industrial Workers of the World as well as the American Federation of Musicians.\n\nSince 1991, Feeney has toured North America and the world to perform and participate in political and labor rallies and events. Her first recording, Look to the Left, was released in 1992. Since then she has released several more albums, most recently Dump the Bosses Off Your Back. Feeney and her daughter Amy Berlin performed Feeney's song Ain't I a Woman at the March for Women's Lives in Washington, DC, on April 25, 2004.\n\nAnne Feeney's music has been recorded by Peter, Paul and Mary and played in concert as well. Political cartoonist Mike Konopacki included Feeney's recording of Union Maid in a flash animation in 2003. Feeney's music is frequently featured on the broadcast radio program Democracy Now! and her anthem Have You Been to Jail for Justice? is featured in the documentaries This is What Democracy Looks Like, Isn't This a Time: A Tribute to Harold Leventhal and Get Up/Stand Up: The History of Pop and Protest.\n\nIn 2002, she married Swedish political artist Julie Leonardsson.\n\nIn August of 2010, while touring in Sweden, Feeney was diagnosed with small cell lung cancer. She is currently undergoing treatment for that, as well as a MAC infection in her lungs. Feeney's friends around North America have been holding benefit events to provide her living expenses since she will be unable to work for some time. Benefit concerts have been organized in Vancouver, BC, Berkeley, CA, Eugene, OR, Ft. Lauderdale, FL, Lexington, KY and most recently Pittsburgh, PA. (wikipedia)\n\n- - -\n\nAnne Feeney - If I Can't Dance 2006\n\n 1 Emma Goldman \n 2 Defenders of Marriage \n 3 My Feet Are Tired \n 4 Dr Jazz \n 5 Amelia Earhart's Last Ride \n 6 Shell Game \n 7 Let Their Heads Roll \n 8 Too Much Monkey Business \n 9 Me Case con un Heroe \n10 Who's the Criminal? \n11 Sheik of Araby/Blues My Naughty Sweetie Gives to Me \n12 Days of the Theocracy \n13 Your Mind is on Vacation \n14 The Dutchman \n15 Phil the Fluter's Jam \n16 Lullaby\n","torrent":{"xt":"urn:btih:627320b3aeaa68d996fd4ce4b4077b3ef981fc5d","amp;dn":"Anne+Feeney+-+If+I+Can%5C%27t+Dance+2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"627320b3aeaa68d996fd4ce4b4077b3ef981fc5d","infoHashBuffer":{"type":"Buffer","data":[98,115,32,179,174,170,104,217,150,253,76,228,180,7,123,62,249,129,252,93]},"announce":[],"urlList":[]}}