{"title":"Na Rubu Znanosti - 2014-01-27 - TM i globalna mirovna inicijativ","uid":9534046,"size":418392102,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:648e523e132272e5961e0cebad2c4f13207f2c65&amp;dn=Na+Rubu+Znanosti+-+2014-01-27+-+TM+i+globalna+mirovna+inicijativ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"donatius","files":1,"time":1390892134,"description":"Na rubu znanosti: Transcendentalna meditacija i globalna mirovna inicijativa\n\n\nKrajem 1960-ih svijet se poceo upoznavati s raznim tehnikama meditacije koje su prodirale s istoka. Njihova prozetost tradicijama i filozofijama krajeva iz kojih su stizale bile su ponekad koliko privlacne toliko i tesko svatljive umu zapadnog covjeka. To je potaknulo Maharishija Mahesha - po vokaciji jogija, po obrazovanju fizicara - da sintetizira vedska znanja o metidacijama i zvuku i prilagodi ih drugacijem kulturnom okolisu Zapada. Novonastalu tehniku nazvao je transdencentalna meditajica. No, njegov skup postavki i tumacenja meditacije nadilazio je osobnu korist za pojebinca. Medicatiju je smartao nacinom da covjek prodre do korjena zbilje i odatle djeluje na nju, kako na okolnosti vlastitog zivota, tako i na dogadjaje svijeta izvan njega. U sklopu TM-a poznati su postali i drugi pojmovi iz indijanske vedske trabicije, poput jogijskog letenja i jagija, a koji su imali veze s Marahishijevim postavkama o vezi stanja koletkivne svjesti i iskustva koje velike zajebnice ljudi - poput drzava - prozivljavaju. Ti pojmovi nalaze se i u temelju Globalne mirovne inicijative koju predstavljamo u emisiji.\n\nGost: Mona Kagi Carsemann","torrent":{"xt":"urn:btih:648e523e132272e5961e0cebad2c4f13207f2c65","amp;dn":"Na+Rubu+Znanosti+-+2014-01-27+-+TM+i+globalna+mirovna+inicijativ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"648e523e132272e5961e0cebad2c4f13207f2c65","infoHashBuffer":{"type":"Buffer","data":[100,142,82,62,19,34,114,229,150,30,12,235,173,44,79,19,32,127,44,101]},"announce":[],"urlList":[]}}