{"title":"Futanari Insanity Part 3 - Costume Futa","uid":5307485,"size":152772762,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:6525d42d9ab0816af69bf21873e86b812b2ba77a&amp;dn=Futanari+Insanity+Part+3+-+Costume+Futa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":154,"time":1264448806,"description":"Futanari Insanity Part 3 - Costume Futa | From Pr0n_Glutton/black_dragon\n\nOPTIONAL: If you followed the optional instructions from Part 2, Place &quot;Costume Futa&quot; in your &quot;Category Futa&quot; folder, as well as &quot;Futa Types&quot; and &quot;Futa Fluids&quot;\n\nThere was a time when I was running out of places to put pictures that didn't fit in a particular folder. When that happened, I decided to make a folder to separate futa by what they were wearing..it was only thing that stuck out to me and makes more since to me than organizing by picture color, picture size, whether or not Futa had balls or not, etc. Because of this however, this left me with some folders with tons of content, and some with little to almost nothing. Of course, more pics could fit each folder, but they are stored elsewhere for other reasons\n\nThe following list show what &quot;Costumes&quot; are categorizes. Asterisks (*) show folders with a high amount of pictures which are zipped while other folders are not zipped.\nAngel | Armor and War | Beach-Swimwear* | Bondage Futa*| Business-Work | Dominant | Goth-Pink Futa | Latex | Lingerie | Maid*| Nightwear | Nun Futa | Nurse | Nylons | Qipao | Royalty | School (36 pics) | Futa Glasses*\n\nIf you haven't read my last torrent description or readme, I normally sort futa by the artist name or it's influence (what game, anime, or show it parodies) and then any &quot;loose&quot; pics that I can't sort by artist or parody goes into one of my category folders. There are many category with sub categories.\n\nFI pt3 has less content than the last. I apparently skipped this folder. &gt;.&lt; Otherwise, I'm gradually increasing the size of the torrents I offer, to see if people are really liking this enough to download large folders, as some folders exceed 1GB or more. Looks like people are digging it.\n\nThis is just a small collection, but other categories might have gigs of content. I hope you enjoy this and be sure to leave feedback (Comments, Votes, Thanks, Seeds)\n\nPart 1: http://www.thepiratebay.se/torrent/5275304/Futanari_Insanity_-_Part_One\nPart 2: http://www.thepiratebay.se/torrent/5282529/Futanari_Insanity_Part_Two_-_Futa_Fluids","torrent":{"xt":"urn:btih:6525d42d9ab0816af69bf21873e86b812b2ba77a","amp;dn":"Futanari+Insanity+Part+3+-+Costume+Futa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6525d42d9ab0816af69bf21873e86b812b2ba77a","infoHashBuffer":{"type":"Buffer","data":[101,37,212,45,154,176,129,106,246,155,242,24,115,232,107,129,43,43,167,122]},"announce":[],"urlList":[]}}