{"title":"Sexually Broken--Hot Asian skull fucked Mia Rider  Matt Williams","uid":7865185,"size":1165200350,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:656860ae9cdaded5eb1fbbac0d91f76bbc5923f0&amp;dn=Sexually+Broken--Hot+Asian+skull+fucked+Mia+Rider++Matt+Williams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1354038728,"description":"Hot Asian with huge natural tits, gets brutally skull fucked, tight bondage, and squirting orgasm! | Mia Rider | Matt Williams\n\nNovember 26, 2012 \n\n\nMP4 only.\n  \n \nWelcome Mia Rider to Sexually Broken. This cute big titted Asian is going to be bound and helpless for the first time, LETS WATCH! \n\nMia is nervous, so we start simple. We bind her wrists firmly behind her back, pull out her huge tits and then proceed to tightly bind them into a huge bulbous bulbs of joy. Mia does not like her boobs tied, but the tight binds stay and a huge cock is jammed down her throat, a fair trade of in our opinion.\n\nWith her monster breasts tightly bound and her hands tied behind her back we skull fuck this Asian beauty in to subspace. We are relentless with the hard deep throat skull fucking. Mia can take a dick down her throat with ease, but even we get to her. We push her so hard even she can't keep up. The cock is winning, breath control at it's finest. She is punished with cock, her throat deeply fucked without a break. Once we &quot;flash&quot; Mia's brain with extreme throat fucking and before she can fully recover, we jam the cock deep into her wet cunt. She cums, and we continue to fuck her deeper into subspace. \n\nWe knock her on her ass and bind her neck to the beam. Now completely helpless, Mia finds out what &quot;Throat Boarding&quot; is. With her head trapped against the beam we can deeply fuck her face and she has no place to hide. The cock slides all the way down her throat over and over. She steals air when she can, while we use her throat like a pussy. Mia is distressed, she can do nothing to stop the cock from abusing her throat. \n\nWhile she's dazed, we quickly bind both her legs up and Mia finds herself in the perfect &quot;fuck me&quot; position. We make her cum with the vibrator, then blast her pussy with fingers, making Mia squirt as she has a brutal screaming orgasm. We leave her totally exposed and covered in her own squirt and drool, waiting for our return to train her further. \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/11_26mrider/SexuallyBroken-Mia-Rider-Matt-Williams-Hot-Asian-with-huge-natural-tits-gets-brutally-skull-fucked-tight-bondage-and-squirting-orgasm.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/11_26mrider/SexuallyBroken-Mia-Rider-Matt-Williams-Hot-Asian-with-huge-natural-tits-gets-brutally-skull-fucked-tight-bondage-and-squirting-orgasm.php&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:656860ae9cdaded5eb1fbbac0d91f76bbc5923f0","amp;dn":"Sexually+Broken--Hot+Asian+skull+fucked+Mia+Rider++Matt+Williams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"656860ae9cdaded5eb1fbbac0d91f76bbc5923f0","infoHashBuffer":{"type":"Buffer","data":[101,104,96,174,156,218,222,213,235,31,187,172,13,145,247,107,188,89,35,240]},"announce":[],"urlList":[]}}