{"title":"Wrox - Professional.CSS.Cascading.Style.Sheets.for.Web.Design.Ju","uid":3438176,"size":13790956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:65ea2b0c789b6768edc5074939331e4707c5153a&amp;dn=Wrox+-+Professional.CSS.Cascading.Style.Sheets.for.Web.Design.Ju&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"macbabe","files":1,"time":1138705691,"description":"Professional CSS: Cascading Style Sheets for Web Design\nby Christopher Schmitt, Mark Trammell, Ethan Marcotte, Dunstan Orchard, Todd Dominey\nISBN: 0-7645-8833-8\nJuly 2005\n456 pages \n\n\nAs the preferred technology for Web design, cascading style sheets (CSS) enable Web designers and developers to define consistent styles on multiple pages. Written by leading CSS authors who are also professional programmers and designers, this is the first book to showcase examples of high-profile, real-world Web sites created by world-famous designers using CSS.\n\nEach chapter offers an exploratory look at each designer&amp;#039;s process from start to finish and how he overcame each site&amp;#039;s unique set of challenges. You&amp;#039;ll learn what each designer would have done differently as well as various CSS tips and techniques that were used for each site. This is a resource to which you can turn regularly for more know-how and insights into designing large-scale, professional-level Web sites with CSS.\n\nWhat you will learn from this book\n* The preliminaries you need to iron out before you begin a site in order to avoid problems later\n* How to tackle browser-compatibility issues\n* Best practices for using XHTML with CSS\n* How to successfully integrate Flash content into an XHTML and CSS site\n* Using drop shadows, drop-down menus, bounding boxes, and rollovers\n* Ways to develop a site that can reliably handle constant streams of up-to-date information\n\nWho this book is for\n\nThis book is for designers who understand CSS at an intermediate to advanced level, but who are looking to learn how to effectively develop CSS-enabled designs at a professional level.\n\nWrox Professional guides are planned and written by working programmers to meet the real-world needs of programmers, developers, and IT professionals. Focused and relevant, they address the issues technology professionals face every day. They provide examples, practical solutions, and expert education in new technologies, all designed to help programmers do a better job.","torrent":{"xt":"urn:btih:65ea2b0c789b6768edc5074939331e4707c5153a","amp;dn":"Wrox+-+Professional.CSS.Cascading.Style.Sheets.for.Web.Design.Ju","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65ea2b0c789b6768edc5074939331e4707c5153a","infoHashBuffer":{"type":"Buffer","data":[101,234,43,12,120,155,103,104,237,197,7,73,57,51,30,71,7,197,21,58]},"announce":[],"urlList":[]}}