{"title":"Vajont.Dam.Disaster.Movie.[English Subtitles]","uid":7899491,"size":1113464154,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:668c6db1a88f7ae55a604039f8dd6ca878194212&amp;dn=Vajont.Dam.Disaster.Movie.%5BEnglish+Subtitles%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jason210","files":1,"time":1354927393,"description":"Adding this because it's almost impossible to find with English subtitles.\n\nOn the whole I think the film's portrayal of the lives of those\ninvolved in the Vajont disaster -- and of the events leading up to it\n-- was good. However, there are quite a few technical inaccuracies and\nsome of the characters are partially fictionalised.\n\nThe film twists the facts a bit to follow a more stereotypical disaster\nmovie plot &amp; build up the tension, portraying the engineers as worried\nand afraid when in fact they were calm and confident that they were in\ncontrol of the situation right until the end. The film makes a drama\nabout the water level, and that the water level was slightly over the\ncritical 700m mark when the landslide took place, suggesting this was\nthe cause of the disaster. In reality the engineers had already taken\nthe water down to SADE's critical level - 25m blow the dam crest.\nHowever, the probelm was that the &quot;critical&quot; level simply didn't apply - the flood was caused by the speed of the landslide when if finally happened, which no-one had predicted correctly.\n\nThe special effects are best when they are subtle - for example in\nvisualisations of the dam and the village of Longerone during the first\nninety minutes or so of the movie. However, in the finale, they failed\nto convey a sense of the awesome power this flood really had. We are\ntalking about a 150m high wave of solid water coming over the top of\nthe dam, then being funnelled down the narrow gorge beyond at 140 km/h.\nIn the film it initially looked like buckets of water being thrown at a\nmodel in slow motion. The spray particles were too large, and there was\nno dark mass of water behind the spray. The only time it looked\nfrightening was when we were given a glimpse of the wave racing down\nthe narrow gorge, preceded by an enormous, howling rush of air tearing\nthe valley sides apart and carrying debris along with it. This air\nblast was also depicted arriving in the village below, like a sudden\nhurricane falling upon the bewildered villagers. Another nice touch was\nthe blue flashes seen by the villages up in the valley at night, at the\nmoment of the landslide, caused by the collapse of powerlines. This was\na frightening premonition of the destruction that followed.\t\t","torrent":{"xt":"urn:btih:668c6db1a88f7ae55a604039f8dd6ca878194212","amp;dn":"Vajont.Dam.Disaster.Movie.%5BEnglish+Subtitles%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"668c6db1a88f7ae55a604039f8dd6ca878194212","infoHashBuffer":{"type":"Buffer","data":[102,140,109,177,168,143,122,229,90,96,64,57,248,221,108,168,120,25,66,18]},"announce":[],"urlList":[]}}