{"title":"Salad - Singles Bar [1994]","uid":9419101,"size":260677002,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6691cbb680cd0db4f85b3ba7c6b62a8cc7bd35e2&amp;dn=Salad+-+Singles+Bar+%5B1994%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1388522909,"description":"Salad were a UK-based pop music group formed in London in 1992, that included Dutch vocalist/keyboardist Marijne van der Vlugt, bassist Pete Brown, drummer Rob Wakeman (ex-Colenso Parade), and guitarist Paul Kennedy.[1] In 1996, Charley Stone (later of Gay Dad) joined the band as a live guitarist, keyboard player and backing vocalist.\n\nVan der Vlugt had previously worked as a model, and as a video jockey for MTV Europe.[1] The band started performing as The Merry Babes but changed to Salad in 1992, when Pete Brown was recruited on bass. Their first two releases, the Kent EP and &quot;Diminished Clothes&quot;, were released on their own Waldorf label, gaining them significant music press coverage and leading to a deal with Island Records, initially on the 'indie' sub-label Island Red.[1] Early singles reached the top 75 of the UK Singles Chart, with &quot;Motorbike to Heaven&quot; just missing out on a top 40 placing. First album, Drink Me (1995), reached No. 16 of the UK Albums Chart. The next three singles were all minor chart hits, but second album Ice Cream (1997) failed to match the success of the first. The band were dropped by Island Records and ultimately disbanded in 1998.\nVan der Vlugt now writes and sings with Cowboy Racer, whose song &quot;Yellow Horse&quot; featured on the U.S. television show, Grey's Anatomy. Pete Brown and Rob Wakeman established the popular entertainment site, BoreMe, which Pete Brown now runs on his own. Charley Stone played guitar with Spy51, but their website has not been updated since 2001. She also performed some live dates with Fosca in Sweden in March 2008. Rob Wakeman released a few Tech House and Techno singles between 1999 and 2002, including Legs With Wings on City Rockers (2002). Rob Wakeman, together with Jo Addison, formed the band Lapwing in 1999, appearing on various compilation albums from labels including Mind Horizon Recordings and Dishy.","torrent":{"xt":"urn:btih:6691cbb680cd0db4f85b3ba7c6b62a8cc7bd35e2","amp;dn":"Salad+-+Singles+Bar+%5B1994%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6691cbb680cd0db4f85b3ba7c6b62a8cc7bd35e2","infoHashBuffer":{"type":"Buffer","data":[102,145,203,182,128,205,13,180,248,91,59,167,198,182,42,140,199,189,53,226]},"announce":[],"urlList":[]}}