{"title":"Jim Norton - I hate your guts  [OCR - DOC, PDF, Scans]","uid":5156957,"size":82650765,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66cc126112c7f01e75fdf76aa9ab7f8347219c8a&amp;dn=Jim+Norton+-+I+hate+your+guts++%5BOCR+-+DOC%2C+PDF%2C+Scans%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"yerk55","files":139,"time":1257907382,"description":"When New York Times bestselling author and comedian Jim Norton isn't paying for massages with happy endings, or pretending to be fooled by transsexuals he picks up, he spends his time wondering what certain people would look like on fire...\n\nWhat do Heather Mills, the Reverend Al Sharpton, and Dr. Phil have in common? Jim Norton hates their guts. And he probably hates yours, too, especially if you're a New York Yankee, Starbucks employee, or Steve Martin.\n\nIn thirty-five hilarious essays, New York Times bestselling author and comedian Jim Norton spews bile on the people he loathes. Enjoy his blistering attacks on Derek Jeter, Hillary Clinton, fatso Al Roker, and mush-mouthed Jesse Jackson. It's utterly hilarious -- and utterly relatable if you've ever bitten a stranger's face or thrown a bottle through the TV screen while watching the news.\n\nBut don't think Jim just dishes loads of shit on his self-proclaimed enemies; he is equally atrocious to himself. He savages himself for his humiliating days as a white homeboy, his balletlike spins in the outfield during a little league game, and his embarrassingly botched attempt at a celebrity shout-out while taping his new HBO stand-up series.\n\nUncomfortably honest, I Hate Your Guts is probably the best example of emotional vomiting you'll ever read. But there is hope; at the end of each essay, Jim generously offers helpful suggestions as to how the offender can make things right again: Eliot Spitzer: If you run for re-election, instead of shaking hands with voters, let them smell your fingers.\n\nReverend Al Sharpton: The next time you feel the need to protest, do so dressed as an elk in Ted Nugent's backyard.\n\nHillary Clinton: When you absolutely must make a point of laughing publicly, don't fake it. Just think of something that genuinely makes you laugh, like lowering taxes or any random male having his penis cut off.\n\nFor the legions of devoted fans who know Jim Norton for his raw, sometimes brutal comedy, I Hate Your Guts is what you've been waiting for. But even more important -- it's a great book to read while taking a shit. ","torrent":{"xt":"urn:btih:66cc126112c7f01e75fdf76aa9ab7f8347219c8a","amp;dn":"Jim+Norton+-+I+hate+your+guts++%5BOCR+-+DOC%2C+PDF%2C+Scans%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66cc126112c7f01e75fdf76aa9ab7f8347219c8a","infoHashBuffer":{"type":"Buffer","data":[102,204,18,97,18,199,240,30,117,253,247,106,169,171,127,131,71,33,156,138]},"announce":[],"urlList":[]}}