{"title":"Why Civil Resistance Works - Dartmouth - Erica Chenoweth","uid":10083932,"size":756958556,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:68aa75b7e6959278ff2357d1fd2d6864b207fa43&amp;dn=Why+Civil+Resistance+Works+-+Dartmouth+-+Erica+Chenoweth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":2,"time":1399060821,"description":"\n\nA Rockefeller &amp; Dickey Center Lecture by Erica Chenoweth, Asst. Professor of Government &amp; Founder, Program on Terrorism &amp; Insurgency Research, Wesleyan University\nFriday, February 3\n4:30--6 pm, Rockefeller Center 003\n\nProfessor Erica Chenoweth will discuss her book, co-authored with Maria Stephan, Why Civil Resistance Works: The Strategic Logic of Nonviolent Conflict, which argues that between 1900 and 2006, campaigns of nonviolent resistance were more than twice as effective as violent insurgencies. Nonviolent resistance presents fewer obstacles to moral and physical involvement, information and education, and participator commitment, leading to enhanced resilience, a greater probability of tactical innovation, increased opportunity for civic disruption, and shifts in loyalty among opponents' erstwhile supporters. Moreover, nonviolent resistance movements tend to usher in more durable and internally peaceful democracies.\nPresented by the Rockefeller Center and Dickey Center as part of the Martin Luther King Jr. Celebration and Black History Month\n\nSpeaker Bio\nErica Chenoweth, Ph.D., is an assistant professor of government at Wesleyan University and director of Wesleyan's Program on Terrorism and Insurgency Research. She also currently serves as a visiting scholar at both the Institute of International Studies at the University of California at Berkeley and the Center for International Security and Cooperation at Stanford University. Previously, she has held fellowships at Harvard University's Kennedy School of Government, UC-Berkeley, and the University of Maryland.\n\nChenoweth is an authority on terrorism, nonviolent resistance, and counterterrorism. She has written three books: Why Democracy Encourages Terrorism (under contract with Columbia University Press); Why Civil Resistance Works: The Strategic Logic of Nonviolent Conflict (Columbia University Press, 2011) with Maria J. Stephan of the U.S. State Department; and Rethinking Violence: States and Non-State Actors in Conflict (MIT Press, 2010) with Adria Lawrence of Yale. The author of dozens of scholarly and popular articles, she hosts the blog Rational Insurgent and is an occasional blogger at The Monkey Cage and Duck of Minerva. Chenoweth teaches courses on international relations, terrorism, civil war, and contemporary warfare. She was honored as the 2010 recipient of the Carol Baker Memorial Prize for junior faculty excellence in teaching and research at Wesleyan.","torrent":{"xt":"urn:btih:68aa75b7e6959278ff2357d1fd2d6864b207fa43","amp;dn":"Why+Civil+Resistance+Works+-+Dartmouth+-+Erica+Chenoweth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68aa75b7e6959278ff2357d1fd2d6864b207fa43","infoHashBuffer":{"type":"Buffer","data":[104,170,117,183,230,149,146,120,255,35,87,209,253,45,104,100,178,7,250,67]},"announce":[],"urlList":[]}}