{"title":"New Marvel I Like 11/21/2012 (darkhomr) [TPB]","uid":7854176,"size":218408470,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:69187ad554a828fe154349a505130bedef6df815&amp;dn=New+Marvel+I+Like+11%2F21%2F2012+%28darkhomr%29+%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":11,"time":1353694719,"description":"These are the Marvel comics I got from the week beginning 11/21/2012.  These are not a complete list of what Marvel put out this week.  There are other torrents for that. There are 10 titles in this week's offering. All comics are either in CBR or CBZ format and are labeled individually.  Please do not share my descriptions or torrent ads with anyone without messaging me first.  If this torrent has no seeds please msg me privately.  I will be glad to reup anything that has no seeds.  I sincerely ask that if you like what you get, please purchase them in some way.  We cannot do what we do if there is nothing being made to scan and upload.\n\nStarting with the first week of November, I will be releasing a new pack with only the Marvel Now comics.  I will still carry this torrent as well as my DC Universe 52, Zero Day, and Independent comics packs.  If you would like to help, please let me know.  \n\nStarting with the first week of December, this particular torrent will change its name to Total Marvel.  I will be changing the format of this release to include all &quot;Marvel Universe&quot; releases.  This means books from the Marvel Universe, Marvel NOW! line, but not anything from Disney or any of the children's lines.  Those will still be released in the Zero Day torrent.  This means that I will be releasing five packs a week including:\n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Thursday, based on scanners release times)\nZero Day (Marvel, DC and Independent comics, released between Saturday night and Sunday afternoon)\nIndependent Scanners (from scanners not affiliated with groups, released on Mondays)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n[IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/ca1.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/dd20.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/im2.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/usm17.jpg[/IMG]\n\nAmazing Spider-Man #698 (CBR 11/21/2012)\n\nDYING WISH PRELUDE  The end of Spider-Man's world begins when Doctor Octopus discovers who Peter Parker really is. (Fifty years goes by much...too...fast.) \n\nAstonishing X-Men #56 (CBR 11/21/2012)\n\nThe shocking conclusion to WEAPONIZED! A teammate returns, but is he friend or foe? Will Kyle and Northstar survive their first married mission? \n\nAvengers #34 (CBR 11/21/2012)\n\nOne of the most controversial and spectacular eras of the Avengers comes to a spectacular and controversial extra-sized, All-Star conclusion! \n\nCaptain America #1 (CBR 11/21/2012)\n\nThrust into a bizarre, inhospitable world far from home, the all-new, high-adventure, mind-melting, tough-as-nails, sci-fi, pulp-fantasy era of Captain America is NOW!  With no country and no allies, what's left for the Sentinel of Liberty to protect? The Saga of Dimension Z begins here! \n\nDaredevil #20 (CBR 11/21/2012)\n\nThe year's most critically acclaimed comic book is back as BLIND MAN BLUFFED continues!  Daredevil's newest threat, The Coyote, is not what Matt expects. Say Goodbye to NYC, Matt Murdock. \n\nDark Avengers #183 (CBR 11/21/2012)\n\nTHE END OF THE THUNDERBOLTS!  Bid farewell to Ghost, Centurius, Man-Thing and the gang forever!  Jeff Parker and Neil Edwards plot a dark new course for Earth's Deadliest Heroes! \n\nHawkeye #4 (CBR 11/21/2012)\n\nYou won't believe what is on The Tape! S.H.I.E.L.D. recruits Clint to intercept incriminating evidence-before he becomes the most wanted man in the world. Superstar artist Javier Pulido joins Matt Fraction in a Hawkeye thriller that spans the globe...and the darkest parts of Clint Barton. \n\nIndestructible Hulk #1 (CBR 11/21/2012)\n\nHulk - Indestructible force more weapon than man. Banner - smartest man alive. Combined they are the Strongest, Smartest Weapon on the planet! And NOW! the INDESTRUCTIBLE HULK is an Agent of S.H.I.E.L.D.! \n\nUltimate Comics Spider-Man #17 (CBR 11/21/2012)\n\nUNITED WE STAND! With the nation at war, young Spider-Man heeds the call of Super Hero duty! The secret connection between Miles Morales and Spider-Woman revealed? \n\nUltimate Comics X-Men #18.1 (CBR 11/21/2012)\n\nMeet MACH TWO, former Morlock tunnel refugee turned mutant resistance fighter! Will she side with Kitty Pryde or become a dangerous new enemy? A brave new world for the nation's surviving mutants starts here! \n\n","torrent":{"xt":"urn:btih:69187ad554a828fe154349a505130bedef6df815","amp;dn":"New+Marvel+I+Like+11%2F21%2F2012+%28darkhomr%29+%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69187ad554a828fe154349a505130bedef6df815","infoHashBuffer":{"type":"Buffer","data":[105,24,122,213,84,168,40,254,21,67,73,165,5,19,11,237,239,109,248,21]},"announce":[],"urlList":[]}}