{"title":"Sandy Lopicic Orkestar - Balkea","uid":4799326,"size":105899793,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:69575bb51dc236a5d7a047b47a6954422779a118&amp;dn=Sandy+Lopicic+Orkestar+-+Balkea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ill88eagle","files":-1,"time":1237991755,"description":"BALKAN FEVER : BY BIG BAND EXTRAORDINAIRE SANDY LOPICIC ORKESTAR\n\n| MP3 320 kbps | Incl.Full Covers &amp; Booklet | 100 MB |\nTRACK LISTINGS \n[01]. Balkea \n[02]. Bugarka \n[03]. Rampiri \n[04]. Cocek 4 \n[05]. Djavolce \n[06]. Hurry Up \n[07]. Makedonsko Devojce \n[08]. Ka Pom Ja \n[09]. Kupi Mi Majko Top \n[10]. Maja \n[11]. Crven Fesic \n[12]. Vranje \n[13]. More Soko Pije \n[14]. Los Ne Svice Rujna Zora\n\nIt has taken three years for this multi-cultural big-band to follow up their widely ce-lebrated debut CD Border Confusion. In that time, they have received numerous awards, given countless concerts and been lauded by critics and audiences alike: &quot;These musicians from the Balkans perform their repertoire with a lot of humour: a marvellous alternative to Emir Kustrica's No Smoking Orchestra!&quot; (Le Monde). And their new repertoire is brim-full of imaginativeness. Besides numerous compositions of their own, it includes exciting renderings of great traditional Balkan music. And it again crosses borders, playing about with themes from Macedonia, Serbia, Bosnia, Albania and Turkey. The band, consisting of a five-man brass section, drums, violin, hurdy-gurdy, accordion and three fantastic female vocalists, sways it audiences with a well-defined big-band sound, jazzy solos, and virtuoso arrangements in smaller line-ups. And above all this hover the &quot;magic voices&quot; (taz) and filigree harmonies of the three singers, one from Serbia, one from Bosnia and one from Kosovo, &quot;each of whom adds her own particular touch, in terms of charisma and timbre: full of joie de vivre and soul, fragile and melancholic, elegant and erotic&quot; (Badische Zeitung). The trail-blazing Balkan DJ Shantel (Bucovina Club/Electric Gypsyland) is wild about these new recordings: &quot;Balkan Groove of the highest order, at the interface between East and West&quot;.","torrent":{"xt":"urn:btih:69575bb51dc236a5d7a047b47a6954422779a118","amp;dn":"Sandy+Lopicic+Orkestar+-+Balkea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69575bb51dc236a5d7a047b47a6954422779a118","infoHashBuffer":{"type":"Buffer","data":[105,87,91,181,29,194,54,165,215,160,71,180,122,105,84,66,39,121,161,24]},"announce":[],"urlList":[]}}