{"title":"Embedded: A Marine Corps Advisor Inside the Iraqi Army","uid":9217374,"size":3315341,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6af8c3125dd55e81061b86a3d3f6aac0a0957b2b&amp;dn=Embedded%3A+A+Marine+Corps+Advisor+Inside+the+Iraqi+Army&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1384881848,"description":"Embedded: A Marine Corps Advisor Inside the Iraqi Army\nby Wesley R. Gray\n\nDESCRIPTION:\n\nIn his November 19, 2005 presidential address, President George W. Bush summarized U.S. military policy as, &quot;Our situation can be summed up this way: as the Iraqis stand up, we will stand down.&quot; EMBEDDED offers a firsthand account by a young Marine military advisor serving on the frontlines with the Iraqi Army of the effectiveness of America's efforts to help the Iraqis stand on their own. As a Division I track athlete and a magna cum laude graduate of the University of Pennsylvania's Wharton School, Wes Gray was given a full scholarship to the Ph.D. program in finance at the University of Chicago, the top ranked program in the world. However, after passing his comprehensive exams and while weighing offers from Wall Street, he had an epiphany: the right thing to do before taking on the challenges of the business world was to serve his nation and fulfill a lifelong dream of becoming a United States Marine. In 2006, 1st. Lt. Gray was deployed as a Marine Corps military advisor to live and fight with an Iraqi Army battalion for two hundred and ten days in the Haditha Triad, a small population center in the dangerous and austere al-Anbar Province of western Iraq.What he encountered was an insurgent fire pit recently traumatized by the infamous &quot;Haditha Massacre,&quot; in which 24 Iraqi civilians - men, women and children - were shot at close range by U.S. Marines at close range in retaliation for the death of a Marine lance corporal in a roadside bombing. Despite the tensions triggered by the shootings, Gray was able to form a bond with the Iraqi soldiers because he had an edge that very few U.S. service members possess 3/4 the ability to communicate because of his proficiency in Iraqi Arabic. His language skills and deep understanding of Iraqi culture were quickly recognized by the Iraqi soldiers who considered him an Arab brother and fondly named him &quot;Jamal.&quot; By the end of his advisor tour, he was a legend within the Iraqi Army. During his time in Iraq, Wes kept a detailed record of his observations, experiences, and interviews with Iraqi citizens and soldiers in vivid and brutally honest detail. Ranging from tension filled skirmishes against the insurgents to insights into the dichotomy between American and Iraqi cultures, he offers a comprehensive portrait of Iraq and the struggles of its people and soldiers to stand up and make their country a nation once again. His book is a Marine intelligence officer's compelling report about the status and prospects of America's strategy for success in Iraq\n\nAmazon.com title link: &lt;a href=&quot;\nhttp://www.amazon.com/Embedded-Marine-Corps-Adviser-Inside/dp/1591143403&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Embedded-Marine-Corps-Adviser-Inside/dp/1591143403&lt;/a&gt;","torrent":{"xt":"urn:btih:6af8c3125dd55e81061b86a3d3f6aac0a0957b2b","amp;dn":"Embedded%3A+A+Marine+Corps+Advisor+Inside+the+Iraqi+Army","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6af8c3125dd55e81061b86a3d3f6aac0a0957b2b","infoHashBuffer":{"type":"Buffer","data":[106,248,195,18,93,213,94,129,6,27,134,163,211,246,170,192,160,149,123,43]},"announce":[],"urlList":[]}}