{"title":"Rodney Crowell...Fate's Right Hand(2003)[flac]---","uid":5261661,"size":338260675,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6b46f7d10be114ef63ad62657033d70ee1eb4170&amp;dn=Rodney+Crowell...Fate%5C%27s+Right+Hand%282003%29%5Bflac%5D---&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":12,"time":1262754465,"description":"Rodney Crowell is, hands down, one of the greatest songwriters from any genre. Light and fluffy are two words that will not describe him ninety nine percent of the time. With eleven tracks, Fate's Right Hand serves up introspective and interesting lyrics to hear throughout various musical sounds on each song.\n\nAccording to the song, &quot;Still Learning How to Fly,&quot; life is what you make of it despite things that might have happened in the past. You can eventually learn to move on and do better to make up for them. When you are on your death bed you reflect on things and also wonder where you will end up in the next life and in this story the man never wants to slow down because he does not want to go away from what he has grown so accustomed to but he winds up coming to terms with what is about to happen.\n\nTitle track, &quot;Fate's Right Hand,&quot; is raw and has a wonderful flow to the lyrics as Rodney deals with seemingly everything that is wrong or bad in the world today whether it a statement about not needing another news channel, people drinking cappuccinos all of the time, or families living on the street finding for bits of food to eat. He just does not understand why the world has come to its current state.\n\n&quot;The Man in Me&quot; could take on various meanings to different people but to me it sounds like someone that is not comfortable in his own skin. Being tired of having a mind full of four letter words, the man seeks out a means of changing himself as just one example found in the tune's lyrics. Everyone should listen to their inner voice and take a chance on being who they really are without telling lies that way if people like you or not, at least they know where you really are coming from.\n\nRodney wrote &quot;It's a Different World Now&quot; while in Belfast and the mellow song came about after he got to thinking about September 11, 2001. Everything has turned around from the way it was, instead of focusing on the beauty of things we focus on the negative. Instead of protecting children we put them up on pedestals and force them to grow up too fast only to throw them away when they start showing signs of age. Not only that but Mother Nature also suffering because we have failed to protect her from harsh conditions.\n\nNot wanting to face the fact that a loved one had been taken from them far too soon is the subject of &quot;Adam's Song.&quot; Each new day is the toughest thing to go through but in time they will learn how to handle their fragile and broken heart because memories remain in forever and with every beautiful star in the sky they will know that the loved one is still with them.\n\nIf you are craving songs with multiple layers and lyrics that really have a message, Fate's Right Hand is perfect for you. Rodney is an expert at writing thinking songs and the eleven songs on this album will make you want to listen to them all over and over again.\n\nSong List:\n\nStill Learning How To Fly\nFate's Right Hand\nEarthbound\nTime To Go Inward\nThe Man In Me\nRiding Out The Storm\nPreaching To The Choir\nIt's A Different World Now\nCome On Funny Feeling\nAdam's Song\nThis Too Will Pass","torrent":{"xt":"urn:btih:6b46f7d10be114ef63ad62657033d70ee1eb4170","amp;dn":"Rodney+Crowell...Fate%5C%27s+Right+Hand%282003%29%5Bflac%5D---","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b46f7d10be114ef63ad62657033d70ee1eb4170","infoHashBuffer":{"type":"Buffer","data":[107,70,247,209,11,225,20,239,99,173,98,101,112,51,215,14,225,235,65,112]},"announce":[],"urlList":[]}}