{"title":"Sandals - Rite to Silence [1994]","uid":9526113,"size":400501866,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6c110553761f3c68f1bfede673dd8f4ffa54a36c&amp;dn=Sandals+-+Rite+to+Silence+%5B1994%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"GenXRock","files":-1,"time":1390754203,"description":"Review by Stewart Mason\nThe sole full-length album by the London groove collective the Sandals (a second was recorded, but rejected by the record company and unreleased) is, in retrospect, a prescient look at where post-ambient house electronica would go in the mid-'90s. The jazzy grooves, largely courtesy of bassist Ian Simmonds, who would go on to make some sublime solo records under his own name and as Juryman, and percussion-heavy arrangements have an organic quality that had been missing from most of the dance records of the early '90s, and the slow-moving, vaguely druggy rhythms are a clear forerunner to trip-hop. John Harris' flute, sax, and clarinet predominate over the electronics (interestingly, the group didn't have a full-time keyboardist or guitarist; friends like Jamiroquai's Nick Van Gelder and Julian Cope's guitarist Donald Ross Skinner pitched in). Between that and the shuffling, layered percussion, parts of this album sound like Herbie Mann or Rahsaan Roland Kirk's '70s work given a Tricky remix. Though the hit single &quot;Feet&quot; is an obvious highlight, it's tracks like the otherworldly opener &quot;Profound Gas&quot; and the slinky &quot;Lovewood&quot; that really put this album over. (4.5/5)","torrent":{"xt":"urn:btih:6c110553761f3c68f1bfede673dd8f4ffa54a36c","amp;dn":"Sandals+-+Rite+to+Silence+%5B1994%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c110553761f3c68f1bfede673dd8f4ffa54a36c","infoHashBuffer":{"type":"Buffer","data":[108,17,5,83,118,31,60,104,241,191,237,230,115,221,143,79,250,84,163,108]},"announce":[],"urlList":[]}}