{"title":"Toy Story 3 FullRip Portable","uid":9065307,"size":1153411875,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6c32c0da69e552af4f0f6a83d3734ab279e652b5&amp;dn=Toy+Story+3+FullRip+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1382101677,"description":"Hi and play this nice animation game from 2010 ...\n\nFILE INFO : FullRip with a less than 10 minutes precompression work and with total portability\n\n\nPlot\n\nWoody, Jessie, Bullseye, Buzz Lightyear, Slinky, Rex, Hamm, the three squeak toy aliens, Buttercup, the Peas-in-a-Pod, Mr. Pricklepants, Chuckles, Dolly and Trixie are the toys of a girl named Bonnie. But among them, Woody, Jessie, Buzz, Slinky, Bullseye, Rex, Hamm and the alien toys used to belong to a boy named Andy Davis. Hamm, Rex and Slinky tell the original toys of Bonnie about an adventure they had before they went to Bonnie and how they ended up in Bonnie's.\n\nIt all starts when Andy is about to go off to college. The toys have not been played by Andy for years, so they make a plan to have Andy play with them one last time. But they fail, so the toys hide in a box headed for daycare, although Woody is reluctant. They are welcomed warmly into Sunnyside by a strawberry scented teddy bear called Lotso, who holds a &quot;New Toys Welcome&quot; carnival. Although Woody has a good time, he still thinks he should be with Andy, and attempts to escape from Sunnyside, but ends up being taken home by Bonnie, who found him in on the ground. Meanwhile, the other toys back at the daycare discover that Sunnyside is &quot;not sunny&quot; for everyone. It turns out that Sunnyside had been turned into a toy prison by Lotso, after he had been replaced by his original owner. The toys are locked in cages and guarded by security toy trucks and helicopters, while Buzz is reprogrammed by Lotso and now thinks his friends are &quot;minions of Zurg&quot; and guards their cages. Woody finds out about this and rushes to Sunnyside the save his friends. After freeing his friends, they manage to set Buzz back to normal and they escape by sliding down a rubbish chute and land on some dumpsters. Before they can escape, they fall into a garbage truck and end up in the dump. Even worse, they are pushed onto a conveyor belt headed for a few giant shredders, and Woody, Buzz and Jessie are separated from the others. After saving themselves, they go to save the other toys, who are also heading for a shredder. Working together, they jam the shredder, and it explodes, saving the other toys. The toys make it back home and are entrusted by Andy to Bonnie. \n\n\n\n\n* enjoy ...","torrent":{"xt":"urn:btih:6c32c0da69e552af4f0f6a83d3734ab279e652b5","amp;dn":"Toy+Story+3+FullRip+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c32c0da69e552af4f0f6a83d3734ab279e652b5","infoHashBuffer":{"type":"Buffer","data":[108,50,192,218,105,229,82,175,79,15,106,131,211,115,74,178,121,230,82,181]},"announce":[],"urlList":[]}}