{"title":"Skin Diamond in Oral Cream Pie #3 - Ebony Porn XXX","uid":8922972,"size":125166762,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6d1295d9a9c475d2b3e628715280556eddc0e7fa&amp;dn=Skin+Diamond+in+Oral+Cream+Pie+%233+-+Ebony+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KidAtomic","files":-1,"time":1379299072,"description":"Skin Diamond (born Raylin Christensen, February 18, 1987) is an American pornographic actress and nude model.\n\nDiamond was born in Ventura, California, and raised in Dunfermline, Scotland, where her parents moved as missionaries. She is of Ethiopian, Danish, Czech, Yugoslav, and German descent. Her father is American actor Rodd Christensen. She appeared in the TV series Balamory as a child, alongside her only sister, Heather\n\nDiamond started her career as a mainstream model and posed, among others, for Louis Vuitton, American Apparel and Atsuko Kudo. She made her pornographic debut in a 2009 Burning Angel film. In that film, she was originally only supposed to perform a girl/girl scene, but, in the end, she shot two boy/girl scenes. In 2012, Diamond posed for comic book artist David Mack, who portrayed her as Echo in the Marvel Comics miniseries Daredevil: End of Days\n\nDiamond currently resides in Los Angeles, California, where she shares a place with fellow adult star Asphyxia Noir. She has several tattoos, including a Phoenix on her back, which she got to cover an accidental burn. She also has piercings in her navel, right nostril, and both nipples. She is also well known for her distinctive shaved-on-one-side haircut; because of this, she has been featured in the column &quot;Beauty Showdown&quot; in the magazine Cosmopolitan.","torrent":{"xt":"urn:btih:6d1295d9a9c475d2b3e628715280556eddc0e7fa","amp;dn":"Skin+Diamond+in+Oral+Cream+Pie+%233+-+Ebony+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d1295d9a9c475d2b3e628715280556eddc0e7fa","infoHashBuffer":{"type":"Buffer","data":[109,18,149,217,169,196,117,210,179,230,40,113,82,128,85,110,221,192,231,250]},"announce":[],"urlList":[]}}