{"title":"Barrett Martin Group - Zenga  (2009)","uid":10626913,"size":82636160,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6db16c1b54f3d35d0dbb627906c44483fcd590ad&amp;dn=Barrett+Martin+Group+-+Zenga++%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stoned139","files":12,"time":1406247965,"description":"Zenga is the third solo album from Screaming Trees/Tuatara drummer Barrett Martin, and it is a seminal work in the evolution of this percussionist-composer. A collection of eleven original compositions recorded with a classic jazz quintet, Zenga (a Japanese word for spontaneous Zen painting) captures the spirit of a fiery group of players who play as one focused combo. The album features some of the top Jazz players from the Seattle and New Mexico Jazz scenes, and is anchored by Barrett's powerful, hypnotic drumming, which is based on a hybrid mix of the American drum set, with African, Brazilian and Cuban drums. Recorded over the course of one calendar year in New Mexico and Seattle, Zenga pulses with rhythm and shimmers with melody. The album features the elegant piano, muscular upright bass, and buoyant trumpet and saxophone melodies. Grammy-nominated Iraqi master musician Rahim Alhaj contributes Arabic oud, creating a kind of 'Jazz Arabesque' feel on two of the tracks. Barrett will be hitting the road later in the fall with his own solo group, in support of Zenga, as well as his previous two albums, The Painted Desert and Earthspeaker.","torrent":{"xt":"urn:btih:6db16c1b54f3d35d0dbb627906c44483fcd590ad","amp;dn":"Barrett+Martin+Group+-+Zenga++%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6db16c1b54f3d35d0dbb627906c44483fcd590ad","infoHashBuffer":{"type":"Buffer","data":[109,177,108,27,84,243,211,93,13,187,98,121,6,196,68,131,252,213,144,173]},"announce":[],"urlList":[]}}