{"title":"How.to.Cook.Your.Life[2007]DvDrip[ENG]-nachiketa","uid":4260444,"size":731766784,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6dde49863ec0c581d24af7b5f3bd85ebe8198c00&amp;dn=How.to.Cook.Your.Life%5B2007%5DDvDrip%5BENG%5D-nachiketa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nachiketa","files":1,"time":1214436821,"description":"This documentary profiles Zen Master Edward Espe Brown and shows the art of Zen and cooking. Espe Brown first became interested in baking as an 11-year kid when he realized the startling difference between mass-produced supermarket bread and the fresh homemade stuff. When he asked his mother to teach him how to bake, however, she said &quot;No, yeast makes me nervous.&quot;\n\nBrown became the head cook at the Tassajara Mountain Centre in California when he was in his early 20s, and has been practicing the art of Zen Buddhism and cooking for more than 40 years. As a chef, he is typically short-tempered and exacting, but as a Buddhist master he is exactly the opposite. Director DÃƒÂ¶rrie (Men, Naked) sets her camera on Espe Brown as he travels from the Scheibbs Buddhist Centre in Austria to Tassajara, offering cooking seminars based upon the principles established 800 years ago by Master Eihei Dogen Zenji, the founder of the Japanese Soto-Zen school. Master Dogen wrote about the necessity of treating food as if it was as valuable as your eyesight. From washing rice, to preparing vegetables, every action could be a path to Zen. Or as the master said, &quot;When you&amp;#039;re washing the rice, wash the rice.&quot; A charming taskmaster who regularly punctures his holiness with moments of self-deprecation and humour, Espe Brown&amp;#039;s observations on modern culture, cooking and human foibles are often as acerbic and hilarious as they are profound. \n                                                           \n                                                           --Brett-Lloyd (IMDB)","torrent":{"xt":"urn:btih:6dde49863ec0c581d24af7b5f3bd85ebe8198c00","amp;dn":"How.to.Cook.Your.Life%5B2007%5DDvDrip%5BENG%5D-nachiketa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dde49863ec0c581d24af7b5f3bd85ebe8198c00","infoHashBuffer":{"type":"Buffer","data":[109,222,73,134,62,192,197,129,210,74,247,181,243,189,133,235,232,25,140,0]},"announce":[],"urlList":[]}}