{"title":"UDEMY-Welch Way Managing Change","uid":9345635,"size":418336219,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6f038604649b42d6039812af25a8938c7147826c&amp;dn=UDEMY-Welch+Way+Managing+Change&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Endroid","files":-1,"time":1387036201,"description":" &lt;a href=&quot;https://www.udemy.com/welch-way-managing-change/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;https://www.udemy.com/welch-way-managing-change/&lt;/a&gt;\n\n&quot;Change is constant&quot;, &quot;change is never done&quot;, &quot;change is what keeps things fresh.&quot;  \n\nWe've heard all these and more about change.  And in business, perhaps more than anywhere else, we need to keep changing to stay competitive and to grow, but how do we do it?  Or more accurately - how do we do it well?\n\nJack Welch has probably done more to drive change initiatives in business than any other CEO.  This course explores the methodologies and models that Jack uses.  It covers everything from taking an honest, hard look at &quot;why&quot; you should even be considering making a change, how to define the right scope of the change, what steps to put in place to get the right change team in place, and most important of all - how to put steps in place to make sure the change lasts.\n\nIn this course, you'll hear directly from Jack.  You'll hear him explain how to do it right as well as provide guidance on the pitfalls that are waiting for those who don't have a comprehensive plan.\n\nWhether you are about to embark on a large change initiative in your organization or whether you have simply been curious about what steps are part of an effective change model, there will be plenty in this course to get you thinking - and acting.  In addition to keynotes from Jack and the structured lessons, the course includes a series of Playbooks that give participants the tools they need to put these teachings into practice.\n","torrent":{"xt":"urn:btih:6f038604649b42d6039812af25a8938c7147826c","amp;dn":"UDEMY-Welch+Way+Managing+Change","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f038604649b42d6039812af25a8938c7147826c","infoHashBuffer":{"type":"Buffer","data":[111,3,134,4,100,155,66,214,3,152,18,175,37,168,147,140,113,71,130,108]},"announce":[],"urlList":[]}}