{"title":"Stalaggh Discography","uid":4686432,"size":193092519,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6f83cb8d7328990817c92d4c45e11fc5f57cb80d&amp;dn=Stalaggh+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xerxes020","files":12,"time":1233249968,"description":"from their myspace:\nLittle is known about this group of extreme musicians who hail from parts of the Netherlands and Belgium. Stalaggh comes from the German word &quot;stalag&quot; which was a WWII concentration camp. The extra G and H stands for global holocaust. The real names and faces of the members involved will never be revealed and they will never perform live. The most extreme factor most commonly known for Stalaggh is that they actually have mental patients do the vocals for their albums. One in particular &quot;guest&quot; vocalist was locked away for brutally stabbing his own mother over 30 times to death at the age of 16. One of the &quot;musicians&quot; was almost murdered during the recording process and it was all recorded. The reasoning for recording the mental patients is because the band really wanted the hatred and painful emotions to be REAL and truly felt. It's almost hard to believe but these are the facts of this sick band. One thing is certain, Stalaggh truly represents the total annihilation of all human life...\n\n\nBasically, if you're into Diagnose:Lebensgefahr or Burzum, or any sort of Dark Ambient, Noise or Black Metal stuff you'll love this.\nComplete works included as far as i know.","torrent":{"xt":"urn:btih:6f83cb8d7328990817c92d4c45e11fc5f57cb80d","amp;dn":"Stalaggh+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f83cb8d7328990817c92d4c45e11fc5f57cb80d","infoHashBuffer":{"type":"Buffer","data":[111,131,203,141,115,40,153,8,23,201,45,76,69,225,31,197,245,124,184,13]},"announce":[],"urlList":[]}}