{"title":"Successful Snooker - Steve Davis","uid":3546458,"size":13317088,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ffbdd22aae2b6f00455d4f575f513a1ff06629c&amp;dn=Successful+Snooker+-+Steve+Davis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"theMatd","files":3,"time":1161939971,"description":"Successful Snooker - Steve Davis\n\nFirst published in 1982 by Charles Letts Books Ltd.\n\n\nThis book was one of my favourite books as a kid. The techniques I picked up from this book at such an early age have enabled me to progress and gain enjoyment out of picking up the game again 20 years later.\nEach page has been electronically scanned, tidied up with Photoshop CS2 and OCRd with Omnipage Pro 15. The 13MB file size isn't a bad result considering the size of each scanned page was about 40MB. Not perfect but these software have their limitations.\n\n\n\nLetts Sports Guides\n-------------------\nAt last ? a series of instructional books which start where so many end. Letts' Successful Sports books have been written, not for the absolute beginner, but for the enthusiast who has achieved a basic competence in a sport and who wants to achieve excellence.\nProduced in association with television's World of Sport programme this invaluable new series attractively presents information vital to the keen competitor. In Successful Snooker there are many pages of full-colour action shots featuring author Steve Davis, plus colour diagrams and specially taken photographs.\nThe top coaches and players who have written these books have been particularly selected for their teaching skills so that you can learn from them the techniques perfected by world-class stars.\nThe series consultant is John Crooke, Secretary of the British Association of National Coaches. With his inside knowledge of modern coaching methods, he has provided advice and guidance in the creation of this exciting new range of instructional guides.\n\n\nThe Author\n----------\nSteve Davis started playing snooker as a 14 year old on holiday with his parents and by the time he left school at the age of 17 he was already being groomed for the top of the snooker profession.\nHe won the prestigious Pontins Pro-Am in 1978 and 1979, the first time as an amateur and the second as a professional. Steve is the resident professional for the Lucania snooker clubs where his manager Barry Hearn is Chairman and where Steve has recorded many Pro-Am successes.\nIn November 1980 Steve's triumphs followed rapidly one on another, starting with the Coral UK Professional Championship in Preston where he defeated magnificently both Alex. Higgins and former World Champion Terry Griffiths. Two days later he won the Wilson Classic in Bolton beating the current World Champion Cliff Thorburn. His next successes, were the Yamaha International Masters Tournament and the first John Courage English Professional Championship. This season of success culminated in April when Steve Davis, aged 23, became Embassy World Professional Snooker Champion 1981.\n\n\nAmazon\n------\n\n&quot;This book is an excellent companion to the video Try Snooker. In fact, it's almost as if this book contains the script from that video.\n\nI'd been playing snooker for a few years before I bought video and then this book. Both have improved my game tremendously.\n\nIt's aimed at both the complete novice as well as more accomplished players. Especially strong club players who aren't progressing any further with their game. It helps you analyse your technique and cue action to make it as correct as possible. This of couse must lead to a higher level of consistency. There are plenty of other tips to help with overall matchplay and approach to the game.\n\nWell worth having.&quot;\n\n\n","torrent":{"xt":"urn:btih:6ffbdd22aae2b6f00455d4f575f513a1ff06629c","amp;dn":"Successful+Snooker+-+Steve+Davis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ffbdd22aae2b6f00455d4f575f513a1ff06629c","infoHashBuffer":{"type":"Buffer","data":[111,251,221,34,170,226,182,240,4,85,212,245,117,245,19,161,255,6,98,156]},"announce":[],"urlList":[]}}