{"title":"Richard L. Bushman - Joseph Smith's Relationship to God","uid":3947614,"size":86969373,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:700374b7a590c1fad65d78a5997f1b0c4c599b7c&amp;dn=Richard+L.+Bushman+-+Joseph+Smith%5C%27s+Relationship+to+God&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thevoiceofreason84","files":56,"time":1198610954,"description":"Great 2cd lecture series by Richard L. Bushman, author of Joseph Smith: Rough Stone Rolling.  At the end of each lecture is a Q&amp;A with his valuable insights into Joseph Smith&amp;#039;s life...\n\nFrom Deseretbook.com:\n\n When Richard Bushman, American historian and author of the bestselling biography, Joseph Smith: Rough Stone Rolling, first began writing the book, he wanted to present the prophet in a historical context. This daunting task was made difficult, says Brother Bushman, &quot;because there are so many passions obscuring our view of Joseph Smith.&quot; Most historians don&amp;#039;t take Joseph Smith seriously because he asked people to believe the unbelievable . . . visions, angels, gold plates, etc. With this jaundiced eye it is hard to really try to understand what Joseph thought or what he accomplished as a historical figure. In this exclusive two-CD set, Richard Bushman provides a fascinating look into the life of Joseph Smith from the perspective of a historian and a faithful member of the Church. Because he is a historian of the time in American history when Joseph lived, Bushman is schooled in the social and cultural currents of that time period and can connect these to his account of Joseph&amp;#039;s history, character, and even personality. At the end of each talk, Brother Bushman entertains questions from the audience, sharing insights gleaned from his decades of scholarship. Joseph Smith&amp;#039;s Relationship with God will be a valuable tool in your study of this beloved Prophet of God.","torrent":{"xt":"urn:btih:700374b7a590c1fad65d78a5997f1b0c4c599b7c","amp;dn":"Richard+L.+Bushman+-+Joseph+Smith%5C%27s+Relationship+to+God","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"700374b7a590c1fad65d78a5997f1b0c4c599b7c","infoHashBuffer":{"type":"Buffer","data":[112,3,116,183,165,144,193,250,214,93,120,165,153,127,27,12,76,89,155,124]},"announce":[],"urlList":[]}}