{"title":"Away from Her (2006)  2Lions-Team","uid":5247067,"size":4676186754,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7043b703bcb290ee8a09291d6895b4a352e5ec69&amp;dn=Away+from+Her+%282006%29++2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wietseherman","files":-1,"time":1262026592,"description":"\n\nAway from Her (2006)       \n\n \n  Canada\nDrama\n110 minuten\n\ngeregisseerd door Sarah Polley\nmet Julie Christie, Gordon Pinsent en Olympia Dukakis\n\nGrant (Gordon Pinsent) en Fiona (Julie Christie) zijn reeds vele jaren getrouwd. Nu zijn ze beide op oudere leeftijd en leiden een comfortabel leven op het platteland. Tot Fiona plots problemen krijgt met haar geheugen. Vastbesloten om Grant niet op te zadelen met haar problemen, laat ze zich opnemen in een rusthuis. Daar wordt ze echter verliefd op Aubrey, een andere patient. \n\n\nEnglish\n\nFiona and Grant are an Ontario couple who have been married for over 40 years. Now, in the oncoming twilight of their years, they are forced to face the fact that Fiona's &quot;forgetfulness&quot; actually is Alzheimer's Disease. After Fiona wanders away and is found after being lost, they agree she must go into a nursing home. For the first time in the five decades their relationship has spanned, they are forced to undergo a long-time separation since the nursing home has a &quot;no-visitors&quot; policy for the first 30 days of a patient's stay, so they can adjust to their new surroundings. When Grant visits Fiona after the orientation period, he is devastated to find out that not only has she seemingly forgotten him, Fiona has transferred her affections to another man. The other man is Aubrey, a wheelchair bound mute patient at the nursing home. As the distance between husband and wife grows, Grant must draw upon his love for Fiona to perform an act of self-sacrifice in order to ensure her happiness\n \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nSubs : NL FR (instelbaar)\nGenre : Drama\nMenu: Yes\nAudio: English 5.1\n \nWeblink : http://www.moviemeter.nl/film/39197\nWeblink : http://www.imdb.com/title/tt0491747 \n\n \n\n***************************************** \n\nBrought to you by\n\n\n2Lions Team \n\n       &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\t\n \n \n","torrent":{"xt":"urn:btih:7043b703bcb290ee8a09291d6895b4a352e5ec69","amp;dn":"Away+from+Her+%282006%29++2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7043b703bcb290ee8a09291d6895b4a352e5ec69","infoHashBuffer":{"type":"Buffer","data":[112,67,183,3,188,178,144,238,138,9,41,29,104,149,180,163,82,229,236,105]},"announce":[],"urlList":[]}}