{"title":"Aaron Marino - Alpha Man Style Tips","uid":9941088,"size":3964146514,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:70ba6a28565c807311395af4e7b2d44fcad1565b&amp;dn=Aaron+Marino+-+Alpha+Man+Style+Tips&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"volesutee","files":-1,"time":1397244173,"description":"We are an international men's image, style and personal development firm based out of Atlanta, Georgia. Six years ago, after helping a friend get ready for a hot date and then doing a ton of research, Aaron Marino realized there were no resources for average guys to get solid, simple, real-world advice on how to look their best. Sure, there are a handful of men's fashion magazines, but they are not realistic for 95% of the men out there. We don't care what the latest and greatest brand of overpriced designer jeans are... that, truthfully, don't look good on anyone other than the 6'2&quot; 145 lb. model who is wearing them. This is not reality for guys like me, guys like my father and your brother, and probably not for guys like you. We don't care what is happening on the runways of Milan and Paris. We simply want to know if the chicks will dig it!\n\nAs men, we are taught to study hard, get a good job, marry a pretty girl, and raise 2.5 reasonably well adjusted kids. No one ever teaches or encourages us to look good or value the importance of image. And when we do, we are called names like Metro-sexual. As if taking pride in our appearance is something to be ashamed of. Well, to those people, we say sit back and watch as we pass you going up the corporate ladder, and get the women you were just rejected by!\nIn 2006\n\nWe started alpha m. Image Consulting to help others realize their true potential, both professionally and socially. The response was immediate and remarkable, and confirmed our belief that men needed help in this arena. In an attempt to reach a larger audience, Aaron began posting YouTube videos, which was a game changer for alpha m. Our image and style advice was now being viewed by guys throughout the globe. Men from around the world began flying in for the day or weekend for the alpha m. Makeover. They would, and still do, arrive an average Joe and leave an Alpha Male! Eventually, in order to accommodate even more men, we added Virtual Grooming Sessions to our services, which offers men another means to receive personal attention and guidance with improving their image.\n\nWhat we have learned is that we may live in different countries with different styles and traditions, but we all want to look and feel the best we possibly can. Confidence is universal!\n\nalpha m. Image Consulting has helped thousands of men throughout the world look and feel incredible. My question to you is... are you next?\nYou never knew what you were missing until you get it!\n\nCareer\n\n&quot;Aaron Marino I need to put you on my payroll. Thanks to you and the Style System I was just promoted to VP of international sales. I was talking with my new boss and asked him how he decided between me and the other candidates, he said it was a tough choice but came down to me always looking polished and professional!&quot; ~Danny S.\nDating\n\n&quot;I went out with some friends, and for the first time I wore one of my new outfits from my new wardrobe. I felt great and apparently I looked great. I say this because for the first time in my life the most beautiful women in the bar came up to me and initiated conversation. I left with her number, a kiss, and the best compliment I have ever gotten... &quot;I love a man with style.&quot; I'm on cloud 9! Thank you Aaron.&quot; ~Brandon G.\nConfidence\n\n&quot;I don't know when it happened or how it happened but it did happen and that is all that matters. All of my life I have struggled with self esteem and confidence. One day I found one of your video's and the next thing I knew I was ordering your Style System. A month later I look better than all my friends and most importantly I feel like I can achieve anything. You have changed my life.&quot; Tommy S.","torrent":{"xt":"urn:btih:70ba6a28565c807311395af4e7b2d44fcad1565b","amp;dn":"Aaron+Marino+-+Alpha+Man+Style+Tips","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70ba6a28565c807311395af4e7b2d44fcad1565b","infoHashBuffer":{"type":"Buffer","data":[112,186,106,40,86,92,128,115,17,57,90,244,231,178,212,79,202,209,86,91]},"announce":[],"urlList":[]}}