{"title":"City - A Guidebook for the Urban Age (gnv64)","uid":7476058,"size":41058031,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70f0a52128dcfe9b9bdd5227a2b9f1ecb4a26558&amp;dn=City+-+A+Guidebook+for+the+Urban+Age+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1343294786,"description":"City: A Guidebook for the Urban Age\nby P. D. Smith\nBloomsbury Press | June 2012 | ISBN-10: 1608196763 ePUB/PDF | 13.6/25.4 mb &lt;a href=&quot;\nhttp://www.amazon.com/City-A-Guidebook-Urban-Age/dp/1608196763&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/City-A-Guidebook-Urban-Age/dp/1608196763&lt;/a&gt;\nPDF conversion is mine.\n\nFor the first time in the history of our planet, more than half the population-3.3 billion people-is now living in cities. City is the ultimate guidebook to our urban centers-the signature unit of human civilization. With erudite prose and carefully chosen illustrations, this unique work of metatourism explores what cities are and how they work. It covers history, customs and language, districts, transport, money, work, shops and markets, and tourist sites, creating a fantastically detailed portrait of the city through history and into the future.\n\nThe urban explorer will revel in essays on downtowns, suburbs, shantytowns and favelas, graffiti, skylines, crime, the theater, street food, sport, eco-cities, and sacred sites, as well as mini essays on the Tower of Babel, flash mobs, ghettos, skateboarding, and SimCity, among many others. Drawing on a vast range of examples from across the world and throughout history, City is extensively illustrated with full-color photographs, maps, and other images. Acclaimed author and independent scholar P. D. Smith explores what it was like to live in the first cities, how they have evolved, and why in the future, cities will play an even greater role in human life.\n\nAbout the Author\nP. D. Smith is an independent researcher and writer. He has taught at University College London where he is an Honorary Research Fellow in the Science and Technology Studies Department and has contributed to the Guardian and writes for other publications including The Times, Independent and the Times Literary Supplement and regularly contributes to the acclaimed website 3 Quarks Daily. His books include Doomsday Men: The Real Dr Strangelove and the Dream of the Superweapon. Author's website:  &lt;a href=&quot;\nhttp://www.peterdsmith.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.peterdsmith.com&lt;/a&gt;","torrent":{"xt":"urn:btih:70f0a52128dcfe9b9bdd5227a2b9f1ecb4a26558","amp;dn":"City+-+A+Guidebook+for+the+Urban+Age+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70f0a52128dcfe9b9bdd5227a2b9f1ecb4a26558","infoHashBuffer":{"type":"Buffer","data":[112,240,165,33,40,220,254,155,155,221,82,39,162,185,241,236,180,162,101,88]},"announce":[],"urlList":[]}}