{"title":"The Black Terror!  1941-1949 Almost complete","uid":8397152,"size":2466776398,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:72677c971cba8073bd8d7a8bd543eda42bbf466e&amp;dn=The+Black+Terror%21++1941-1949+Almost+complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"Mothra67","files":-1,"time":1366602141,"description":"After reading and rereading Masks 1-5 and Alex Ross's Project Superpowers stuff, I have taken it upon myself to track down the original comics of all those wonderful Public Domain superheroes from the golden age of comics, starting here with The Black Terror!\n\nhere's some info on the 3 books he was in:\n\nTHE BLACK TERROR\n(1942 Series)\n1942 - June, 1949\n\nIssues published: #1-27 (Issue V2 #1 is actually #4)\n\nNotes: The Black Terror originally appeared in Exciting Comics #9, 1941.\n\nArtists on this title include Stan Asch, Ken Battefield, Al Camy (Cammarata), Don Christiansen, Jim Davis, Frank Frazetta, August Froehlich, Art Helfant, Helen Houghton, E. R. Kintsler, Mort Lawrence, Ralph Mayo, Rusty Meredith, Mort Meskin, Shelly Moldoff, Ruben Moreira, Ed Moritz, Bob Oksner, Victor Pazmino, Jerry Robinson, George Rousssos, Alex Schomburg, Harris Steinbrook, Jules Steiner, Mike Suchorsky, &amp; George Tuska\n\nEXCITING COMICS\n(1940 series)\nApril 1940 - September 1949\n\nIssues: #1-69\n\nNotes: Standard imprint on cover of #67-69.\n\nArtists on this title include Ken Battefield, Dave Berg, Ken Browne, Al Camy (Cammarata), John Chaffin, Pete Costanza, Frank Frazetta, Dave Gabrielson, Art Gates, Ed Good, Maurice Gutwirth, Al Hartley, Mort Lawrence, Ray Lowry, George Mandel, Ralph Mayo, Ruben Moreira, Leo Morey, Ed Moritz, Klaus Nordling, Bob Oksner, Max Plaisted, Kin Platt, Charles Quinlan, Jerry Robinson, George Roussos, Art Saaf, Leonard Sansone, Alex Schomburg, Lin Streeter, Mike Suchorsky, Ray Thayer, George Tuska, Elmer Wexler, &amp; C. A. Winter\n\nAMERICA'S BEST COMICS\n(1942 series)\nFebruary 1942 - July 1949\n\nIssues #1-31\n\nNotes: Publishing gap between #1 (February 1942) and #2 (September 1942). Publisher in indicia: Better, 1-2; Nedor, 3-17; Visual Editions, 18-31 (Per Keltner Index), Standard imprint on cover of #31.\n\nArtists on this title include Ken Battefield, Jack Binder, Jack Bradbury, Al Camy (Cammarata), John Celardo, August Froelich, Maurice Gutwirth, Al Hartley, Thurston Harper, E. R. Kintsler, Dan Loprino, Ralph Mayo, Mort Meskin, Ruben Moreira, Ed Moritz, Bob Oksner, Kin Platt, Jerry Robinson, Art Saaf, Alex Schomburg, Hal Sherman, Jules Steiner, Lin Streeter, Mike Suchorsky, Ray Thayer, George Tuska &amp; Elmer Wexler\n\n\n\nCOMING  SOON FROM MOTHRA67: Wondercomics Starring the Grim reaper and Spectro, and Air Fighter comics starring Airboy, as well as a ton of Golden age Airboy comics!\n\nso don't miss out!  Keep your radio tuned in some time, same channel!","torrent":{"xt":"urn:btih:72677c971cba8073bd8d7a8bd543eda42bbf466e","amp;dn":"The+Black+Terror%21++1941-1949+Almost+complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72677c971cba8073bd8d7a8bd543eda42bbf466e","infoHashBuffer":{"type":"Buffer","data":[114,103,124,151,28,186,128,115,189,141,122,139,213,67,237,164,43,191,70,110]},"announce":[],"urlList":[]}}