{"title":"DJ Z-Trip: Obama Mix","uid":4431451,"size":89034684,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:75153afd622b08299b797be7ede1ef9063c7b715&amp;dn=DJ+Z-Trip%3A+Obama+Mix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"photogeek","files":2,"time":1223312561,"description":"Recently, Shepard Fairey and I threw some fundraisers for the Obama campaign. We called them The Party For Change.\n\nI've been wanting to put the mix I've been doing at these shows online, in hopes of spreading the word to people who need to hear it most.\n\nI encourage you to download it and pass it along to anyone you think should hear it. Feel free to burn copies, share it with friends, family, co-workers, strangers, and especially anyone you know is on the fence about this election. I'm also putting out a radio friendly version, in case anyone wants to broadcast it.\n\nPlease share the message. Educate those who may not know what is really going on. There is still time.\n\nIf you, or anyone you know, isn't registered to vote, I encourage you to make it a priority and fix that before it's too late. This election is WAY too important for anyone to not get involved. If you need more information on how and where to register, vote, or participate, please check the links below.\n\nI honestly feel if we make our voices heard, this time WILL be different.\n\nPeace,\n\nZ-TRIP","torrent":{"xt":"urn:btih:75153afd622b08299b797be7ede1ef9063c7b715","amp;dn":"DJ+Z-Trip%3A+Obama+Mix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75153afd622b08299b797be7ede1ef9063c7b715","infoHashBuffer":{"type":"Buffer","data":[117,21,58,253,98,43,8,41,155,121,123,231,237,225,239,144,99,199,183,21]},"announce":[],"urlList":[]}}