{"title":"David J. Lieberman-Find Out Who's Normal and Who's Not (shailab)","uid":12985178,"size":11670411,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7631300f2766ee53d664ea8f63ce32e4707322f9&amp;dn=David+J.+Lieberman-Find+Out+Who%27s+Normal+and+Who%27s+Not+%28shailab%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shailab","files":3,"time":1450069937,"description":"David J. Lieberman - Find Out Who's Normal and Who's Not\r\nPublished: 10 March 2010 | ISBN(10): 1596593601 | PDF | 240 pages | 11.1 MB | Publisher: Your Coach In A Box; Unabridged edition (10 March 2010)\r\n\r\nLanguage: English\r\nISBN-10: 1596593601\r\nISBN-13: 978-1596593602\r\n\r\n\r\nThe Stability Quotient (SQ) is the measure a person's emotional health, or lack therefore. In these ever-chaotic times, you need to protect yourself from those who are a few cards short of a full deck. Unstable people are more likely to try take advantage of you, lie, cheat, abuse, or just plain make your life miserable. Find out if anyone from your date, nanny, coworker, neighbor, potential employee, client, or fiancé-is normal, neurotic, or worse! In person, on line, or over the phone, discover near fool-proof tactics that quickly disclose to you, whether someone in your life is a few fries short of a Happy Meal, or worse and your seemingly normal Dr. Jekyll is really a Mr. Hyde.\r\n\r\n\r\n\r\n-How close to snapping is she? \r\n-How will he perform in a crisis? \r\n-Is she a danger to herself or to others? \r\n-Am I in a relationship with a stable person? \r\n-Can she handle this news? \r\n-Is he going to turn violent? \r\n-Can I trust her with my kids? \r\n-Will he make an unfit guardian? \r\n-Is he unstable or just a bit eccentric? \r\n-Is he joking or he's serious about the idea? \r\n-What is she capable of? \r\n-Is my coworker troubled or just plain moody? \r\n-Is my friend in danger of hurting herself, or others? \r\n-Is my date stable? \r\n-How delicate do I need to be in firing this employee?\r\n\r\n\r\n\r\n\r\n\r\nAbout the Author-\r\nDavid J. Lieberman Ph.D. is an award-winning author and internationally recognized leader in the fields of human behavior and interpersonal relationships. Techniques based on his six books, which have been translated into eighteen languages and include two New York Times bestsellers, are used by the FBI, the Dept. of the Navy, Fortune 500 companies, and by governments, corporations and mental health professionals in more than 25 countries. Dr. Lieberman's work has been featured in publications around the world and he has appeared as a guest expert on more than 200 programs such as: The Today Show, Fox News, PBS, The Montel Williams Show and The View. Dr. Lieberman, who has a Ph.D. in psychology, lectures and holds workshops across the country on a variety of topics. He lives in New Jersey.\r\n\r\n\r\nenjoy...\r\n\r\nYOURs INsincerely...\r\n \r\n----------------------------------------------------------------------\r\n\r\n                                       .:.Shailab.:.\r\n\r\n\t\t\t   https://thepiratebay.la/user/shailab/\r\n\r\n      \t\t\t        https://kat.cr/user/shailab/","torrent":{"xt":"urn:btih:7631300f2766ee53d664ea8f63ce32e4707322f9","amp;dn":"David+J.+Lieberman-Find+Out+Who%27s+Normal+and+Who%27s+Not+%28shailab%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7631300f2766ee53d664ea8f63ce32e4707322f9","infoHashBuffer":{"type":"Buffer","data":[118,49,48,15,39,102,238,83,214,100,234,143,99,206,50,228,112,115,34,249]},"announce":[],"urlList":[]}}