{"title":"The Facebook Diet - spanikopita","uid":7949915,"size":12214270,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:765d5baaaa7b363e4392d84edf16cb66c417e734&amp;dn=The+Facebook+Diet+-+spanikopita&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"spanikopita","files":-1,"time":1356240710,"description":"Publication Date: January 30, 2013 | Series: The Unplug Series\n\nA humorous gift book that takes a tongue-in-cheek look at our love of social media through a series of 50 hilarious cartoons that complete the question &quot;You Know You're a Facebook Addict When...?&quot; by identifying the more idiotic, embarrassing and cringe-worthy behaviors of our social networking excess.\n\n\nWith over 1 billion people now on Facebook (that's 1 in every 7 people on the planet) and 34% of all users checking their account before brushing their teeth or hair in the mornings, it seems most can confess to an addictive Facebook habit; whether it's stalking an ex, faking bathroom breaks to read news, checking-in wherever they go, or art-directing photo's for the perfect profile pic.\n\n\nMany get frustrated with the screen-centric behaviors of their Facebook junkie friends, partners, colleagues or family members. Yet telling others to break the habit--or at least tame it--isn't easy.\n\n\nAuthor and illustrator, Gemini Adams, inspires them to examine the health of their high-tech habits and possibly consider taking The Facebook Diet by following the funny tech-detox tips that encourage readers to unplug once in a while.\n\n\nAn entertaining gift book for the Facebook junkie in every family.\n\n---\n\nDRM free: EPUB, MOBI, PDF\n\n---\n\nSeed. Diet.","torrent":{"xt":"urn:btih:765d5baaaa7b363e4392d84edf16cb66c417e734","amp;dn":"The+Facebook+Diet+-+spanikopita","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"765d5baaaa7b363e4392d84edf16cb66c417e734","infoHashBuffer":{"type":"Buffer","data":[118,93,91,170,170,123,54,62,67,146,216,78,223,22,203,102,196,23,231,52]},"announce":[],"urlList":[]}}