{"title":"Gnomoria v0.9","uid":9035360,"size":210950713,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:76cdcca672ac93beb034d78a8dbfd2a1bd9983d2&amp;dn=Gnomoria+v0.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aedziex23","files":-1,"time":1381452624,"description":"Gnomoria is a sandbox village management game where you help lead a small group of gnomes, who have set out on their own, to thrive into a bustling kingdom! Anything you see can be broken down and rebuilt elsewhere. Craft items, build structures, set traps and dig deep underground in search of precious resources to help your gnomes survive the harsh lands. Build your kingdom and stockpile wealth to attract wandering gnomads to your cause, but be wary of also attracting enemies!\n\nKey Features:\n\n- Procedurally generated world - Every game is different\n- Fully destructible environment - Everything can be mined, dug, chopped and rebuilt or used for crafting\n- Open sandbox gameplay - Play how you want - manage a peaceful town or build up military and fend off invasions.\n- Crafting - Tons of items to craft at different workshops\n- Mechanisms - Construct elaborate contraptions using parts like hatches, levers, steam engines\n\nv0.9 Beta\n\nAudio\n\n- Added sound effects for the following jobs: Mining/Digging, Till soil, Forage, Cut Clipping, Fell Tree and Plant Tree\n- Added sound effects when selecting most workshops\n\n\nFixed\n\n- Deconstructing floors not properly updating tiles as outside\n- Deconstructing hatch not properly updating the map\n\n\nToday's patch marks the start of Beta!\n\nThere will be some development changes but it won't be very different from what you're used to.  For starters, I'm changing the patch schedule from every week to every other week.  This will go a long way towards letting me work on things that are too difficult to fit in a one week patch as well as spending some time getting it right before going live.\n\nThere will also be some balance patches where a lot of work will go into seemingly not a lot of changes.  There will probably be less large sweeping game changing patches as there were in Alpha but I wouldn't rule it out completely.  The focus during Beta will be on rounding out the gameplay experience - filling in anything missing, expanding on existing content and polish.  After Release, you can expect to see &quot;addon&quot; type gameplay systems like magic, etc.\n\n\nSystem requirements:\n\nOS: Windows XP, Vista, 7, 8\nProcessor: 2.0 GHz\nMemory: 1 GB\nHard Disk Space: 200 MB\nVideo Card: 128 MB Video Memory\nDirectX: 9.0c or Greater\n\nInstallation:\n\n1. Unzip\n2. Place Gnomoria folder anywhere on your drive\n3. PLAY!\n\nXNA Framework 4.0 and .NET Framework 4.0 are included in the _CommonRedist folder. (Install these first)\n\nYou can help the developer and buy the game on steam here:  &lt;a href=&quot;\nhttp://store.steampowered.com/app/224500/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/224500/&lt;/a&gt;","torrent":{"xt":"urn:btih:76cdcca672ac93beb034d78a8dbfd2a1bd9983d2","amp;dn":"Gnomoria+v0.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76cdcca672ac93beb034d78a8dbfd2a1bd9983d2","infoHashBuffer":{"type":"Buffer","data":[118,205,204,166,114,172,147,190,176,52,215,138,141,191,210,161,189,153,131,210]},"announce":[],"urlList":[]}}