{"title":"FALCO   -   JEANNY-VIRUSOFSATEN","uid":4676446,"size":14218110,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:77db8acf6b18f4d63eefb2a1370e7fb7900a56cb&amp;dn=FALCO+++-+++JEANNY-VIRUSOFSATEN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virusofsaten","files":-1,"time":1232915039,"description":"FALCO  -  MP4  .\n\n\n\n\n\n\n\n\n\n\n\n\nBiography\nFalco\nFalco was the most internationally successful pop artist ever to come out of Austria, best known for his 1986 chart-topping hit &quot;Rock Me Amadeus.&quot; Born Johann Holzel in Vienna on February 19, 1957, he was a classically trained child prodigy, but after graduating from the Vienna Conservatoire, he relocated to West Berlin and began fronting a jazz-rock band. Rechristening himself Falco in honor of the German skier Falko Weissflog, he returned to Vienna in time to play bass on the punk outfit Drahdiwaberl's 1979 album Psycho Today, penning their best-known song, &quot;Ganz Wein.&quot; Falco began his solo career in 1982 with the LP Einzelhaft; his &quot;Der Kommissar,&quot; which fused techno-pop with rapped German lyrics, became a major European hit and a club favorite in the U.S., with a cover version by the group After the Fire reaching the Top Five in 1983. The follow-up, &quot;Jeanny,&quot; was banned outright by radio as a result of its theme of prostitution, but nevertheless went on to top the German charts. While 1984's Junge Roemer attracted little attention, in 1986 Falco issued Falco 3, highlighted by the single &quot;Rock Me Amadeus,&quot; a campy blend of classical music and synth pop which topped both the American and British charts. While the rock ballad &quot;Vienna Calling&quot; was a minor hit, Falco's subsequent efforts, including 1986's Emotional and 1988's Wiener Blut, fared poorly; he had been long out of the spotlight when he died in a car accident on February 6, 1998 at the age of 40. ...\n\n\n\n\n\n\n\n     \n\n\n\n     * AFTER DOWNLOADING PLEASE SEED SO OTHERS CAN DOWNLOAD THIS TORRENT AS WELL*\n\n\n  {IF EVERY ONE SEEDS TO A 3.0 % RATIO THE NEXT PERSON WILL GET THERE FILE QUICKER}\n\n                {THE MORE SEEDERS THERE ARE THE FASTER THE DOWNLOAD}\n\n\n                         {PLEASE ENJOY FROM THE VIRUSOFSATEN}\n          \n\n                                {LETS SHARE THE FILES}\t\n\n\n                         {SUPPORT THE BAY DOWNLOAD AND SEED}\n\n","torrent":{"xt":"urn:btih:77db8acf6b18f4d63eefb2a1370e7fb7900a56cb","amp;dn":"FALCO+++-+++JEANNY-VIRUSOFSATEN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77db8acf6b18f4d63eefb2a1370e7fb7900a56cb","infoHashBuffer":{"type":"Buffer","data":[119,219,138,207,107,24,244,214,62,239,178,161,55,14,127,183,144,10,86,203]},"announce":[],"urlList":[]}}