{"title":"Are Cops Racist? (2010) by Heather Lynn Mac Donald","uid":10120028,"size":2465715,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:782f4304d3da19d9f3fe4f26e0dcf45484b8fdce&amp;dn=Are+Cops+Racist%3F+%282010%29+by+Heather+Lynn+Mac+Donald&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZoPunde","files":-1,"time":1399660977,"description":"Are Cops Racist - How the War Against the Police Harms Black Americans (2010) by Heather Lynn Mac Donald.pdf\n\n&quot;The anti-profiling crusade thrives on an ignorance of policing and a willful blindness to the demographics of crime,&quot; writes Heather Mac Donald in this powerful and persuasive examination of racial profiling. Noting that crime has dropped in urban areas over the past decade, she writes that &quot;The last ten years should have been a time of triumph for law enforcement, not an occasion for frenzied cop-bashing.&quot; Yet an anti-police stance has pervaded the media in recent years, particularly in The New York Times, she says. This bias, combined with suffocating federal regulations, brought about by both the Clinton and the Bush Justice Departments, threaten to reverse the progress made. It also causes unnecessary friction between police and the public, makes neighborhoods less safe, and even dissuades officers from fighting crime aggressively for fear of being labeled a racist. In instances where the police were clearly in the wrong--most notably the much-publicized and tragic Amadou Diallo shooting--Mac Donald posits that these are isolated cases of poor judgment and failure to follow procedure rather than evidence of systemic racism.\n\nSince much of the profiling issue revolves around highway patrolling, Mac Donald looks closely at the misleading statistics that have been used to back up such practices as tabulating the race of drivers pulled over by the police. Mac Donald punches so many holes in the statistics that it's difficult not to concur with her. She further attacks the &quot;collective fairy tale that all groups commit drug crimes at equal rates,&quot; arguing that the police are simply going to where the crime is, not willfully picking on one group while ignoring others. She also does extensive field work: interviewing cops around the country, particularly black officers who find the race-bias argument specious; reporting from urban neighborhoods; and witnessing firsthand how the New York Police Department trains its rookie officers. She also points out that local police are &quot;the first line of defense against terrorism&quot; and makes a particularly compelling argument that racial-profiling should be used as a tool in combating such threats. Overall, this forceful book is sure to arouse controversy--which is exactly the point. \n\n192 pages\nPublisher: Ivan R. Dee; Reprint edition (June 16, 2010)\nLanguage: English\nISBN-10: 1566638674\nISBN-13: 978-1566638678","torrent":{"xt":"urn:btih:782f4304d3da19d9f3fe4f26e0dcf45484b8fdce","amp;dn":"Are+Cops+Racist%3F+%282010%29+by+Heather+Lynn+Mac+Donald","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"782f4304d3da19d9f3fe4f26e0dcf45484b8fdce","infoHashBuffer":{"type":"Buffer","data":[120,47,67,4,211,218,25,217,243,254,79,38,224,220,244,84,132,184,253,206]},"announce":[],"urlList":[]}}