{"title":"Le Corps Subtil (Chakras.Biologie.Medecine)","uid":13622620,"size":7362073,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78dde184ffce37593d1e2a84388c60cfa76c72ed&amp;dn=Le+Corps+Subtil+%28Chakras.Biologie.Medecine%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asperge","files":1,"time":1455981106,"description":"Cyndi Dale, &quot;Le Corps Subtil : La Grande Encyclopédie de l'anatomie énergétique&quot;\r\nPublisher: Macro | 2013 | ISBN : 8862292988 | French | EPUB | 464 pages | 7 Mb\r\n\r\nUne référence dont ne devrait se passer aucune bibliothèque personnelle ou spécialisée dans les soins de santé – un guide approfondi et illustré de ces énergies invisibles de l’esprit, du psychisme et de la conscience qui influencent chaque aspect de notre bien-être. Que vous cherchiez à appuyer votre pratique thérapeutique par une médecine complémentaire, à sonder la nature énergétique de votre corps en interrogeant la sagesse éternelle des traditions du monde ou à examiner les traitements basés sur l’intention sous l’angle quantique, Le Corps Subtil s’impose en compagnon indispensable pour explorer quasiment toutes les facettes de la guérison holistique. Destiné tant aux thérapeutes professionnels qu’aux patients, ce volume fournit un lexique de termes, des illustrations et des articles fouillés sur notre biologie énergétique et les relations qu’elle entretient avec notre être physique.\r\n\r\n\r\nLes principes de guérison énergétique des traditions thérapeutiques du monde – dont l’Ayurvéda, le Qigong, le Reiki, la Kabbale et bien d’autres ;\r\n\r\nLa science de l’anatomie subtile : les anciens modèles et les recherches les plus récentes sur ces champs invisibles qui déterminent notre état physique ;\r\n\r\nLes soins intégrés : comment engendrer des résultats optimaux en combinant les méthodes énergétiques orientales et la rigueur scientifique occidentale ;\r\n\r\nLes méridiens, les champs et les chakras : des informations et schémas détaillés sur le rôle que ces structures énergétiques jouent dans notre santé globale ;\r\n\r\nLe rôle de l’intention en thérapie : comment les croyances d’un thérapeute, d’un patient ou de toute personne concernée affectent l’issue d’un traitement","torrent":{"xt":"urn:btih:78dde184ffce37593d1e2a84388c60cfa76c72ed","amp;dn":"Le+Corps+Subtil+%28Chakras.Biologie.Medecine%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78dde184ffce37593d1e2a84388c60cfa76c72ed","infoHashBuffer":{"type":"Buffer","data":[120,221,225,132,255,206,55,89,61,30,42,132,56,140,96,207,167,108,114,237]},"announce":[],"urlList":[]}}