{"title":"U2 - Rattle &amp; Hum - The Live, The Studo, The Singles (by }{e","uid":9088864,"size":1541524202,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7b0dd34d84800dc46827ab80c1aa3cd3f0905c19&amp;dn=U2+-+Rattle+%26amp%3B+Hum+-+The+Live%2C+The+Studo%2C+The+Singles+%28by+%7D%7Be&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"}{eywood","files":65,"time":1382553417,"description":"I got into U2 around the time of Rattle &amp; Hum, and although I think its a pretty good album I always thought it seemed disconnected with the back and forth between live and studio stuff. Then there's the movie, which has more material in it than what's on the album. Add to that all the b-sides and you've got a pretty big package, but its all a jumble. I've seen collections where people have gathered it all together on one set, but no one has tried to make sense of it. Hell if you just take the studio stuff off the album and the b-sides you have a very strong record there, better than Joshua tree.\n\nSo here it is in a package that makes sense: a live album, a studio album, and a singles album. The live album is made from both the CD and the film. I put it all together into one continuous concert that loosely follows the setlists from the tour ( I say loosely because the setlist changed often) and gives a decent picture of what went on on stage in that period. Sure its shorter than a real show, not like the Dublin New Year's shows, but its everything released for R&amp;H.\n\nThe studio album is made up of the stuff from the CD, all the B-sides that are not remixes or edits of songs on the album, and a couple more recently released gems.\n\nAs a bonus the studio album contains a folder with all the remixed and edited B-sides. This is strictly a bonus, and there are 4 mp3s in there, songs that I'm not sure if they are really official releases or not (I lean toward not) but I like them, and although I scoured the internet for quite some time (I've been holding out on posting this for months; it was going to be my first upload if I found all of it) I never found them lossless. Since they're not officially a part of the album project, please don't be offended. Sometimes you have to accept what's out there.\n\nI threw in the setlists for the shows the live album was recorded at, and even tossed in a few live songs from 89 that didn't fit within the context of the compilation. This is about as complete as this can get, I hope.\n\nMore to come. Enjoy!","torrent":{"xt":"urn:btih:7b0dd34d84800dc46827ab80c1aa3cd3f0905c19","amp;dn":"U2+-+Rattle+%26amp%3B+Hum+-+The+Live%2C+The+Studo%2C+The+Singles+%28by+%7D%7Be","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b0dd34d84800dc46827ab80c1aa3cd3f0905c19","infoHashBuffer":{"type":"Buffer","data":[123,13,211,77,132,128,13,196,104,39,171,128,193,170,60,211,240,144,92,25]},"announce":[],"urlList":[]}}