{"title":"Germans Against Hitler: The Stauffenberg Plot and Resistance Und","uid":11708255,"size":2670067,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b2b2c312dc1abed72a9d787afcaef2d6f129633&amp;dn=Germans+Against+Hitler%3A+The+Stauffenberg+Plot+and+Resistance+Und&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424224209,"description":"Those Germans, such as Count Claus von Stauffenberg, who fought the Third Reich from within have often been mythologized as heroes in the fight against tyranny but the truth is far more complex. Germans Against Hitler traces the history of the German resistance, from the ascent of the Nazi party to the July 1944 attempted assassination of Hitler. Informed by more than four decades of research and written by the premier historian of the German Resistance, this book offers the most authoritative history of the tens of thousands of Germans who tried to resist Nazism. \n\nHans Mommsen considers the full spectrum of opposition, from small but still dangerous acts of political disobedience to large-scale conspiracies - such as the incredible Count Claus von Stauffenberg plot.  He analyzes the ideologies of the Kreisau Circle and the conservative, socialist, church and military oppositions. These resistance groups all tried to find a viable alternative to Hilter to achieve a moral renewal of politics and society. Yet many of them rejected democracy and had a sometimes ambivalent attitude towards the persecution of the Jews. An honest, thought-provoking look at the WWII German resistance movement","torrent":{"xt":"urn:btih:7b2b2c312dc1abed72a9d787afcaef2d6f129633","amp;dn":"Germans+Against+Hitler%3A+The+Stauffenberg+Plot+and+Resistance+Und","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b2b2c312dc1abed72a9d787afcaef2d6f129633","infoHashBuffer":{"type":"Buffer","data":[123,43,44,49,45,193,171,237,114,169,215,135,175,202,239,45,111,18,150,51]},"announce":[],"urlList":[]}}