{"title":"Great little war game Android","uid":6840416,"size":45306755,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:7b2fcf5f6f125194016716b6c17367e98ee578f6&amp;dn=Great+little+war+game+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cad40","files":-1,"time":1322146088,"description":"Command your army and battle enemies on land, sea and air. Select your units wisely and deploy them to take full advantage of higher ground, natural choke points and defensive walls.\n\nTactical decisions will be made on every turn. Where should your reinforcements go? Does your base have adequate defences? Do you have time to capture that enemy Factory? Can you afford an aerial strike? Should you make another cup of tea before starting the next round?\n\nIt's a Great Little War out there, and you'd better be ready for it!\n\nVaried missions are the order of the day here - Capture the enemy HQ, Escort the Generalissimo to safety, Guide small squads behind enemy lines, Defend your base... it's going to be one crazy ride!\n\nBut fear not - the Great (and definitely NOT cowardly) Generalissimo is here to save the day, along with his indefatigable aide Jenkins. If the Great Little War doesn't get to you, their puns and hi-jinks certainly will.\n\nSo tell us, Trooper. Have you got what it takes to win this Great Little War?\n\nWat's new:\n1. Fix for &quot;Call of Booty&quot; campaign pack map bug.\n2. Fix for a start-up crash on some devices.\n3. Application will try to install on external storage first, unless there isn't enough space\n\nRead more: http://www.everfreetech.com/2011/10/great-little-war-game-v101101-android.html#ixzz1ed7UgGOL","torrent":{"xt":"urn:btih:7b2fcf5f6f125194016716b6c17367e98ee578f6","amp;dn":"Great+little+war+game+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b2fcf5f6f125194016716b6c17367e98ee578f6","infoHashBuffer":{"type":"Buffer","data":[123,47,207,95,111,18,81,148,1,103,22,182,193,115,103,233,142,229,120,246]},"announce":[],"urlList":[]}}