{"title":"Ritchie Valens - The Very Best Of [192Kbps]","uid":4061530,"size":84920394,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7b5c106a48e6f25d3f507f7cf96b1323a17f44dd&amp;dn=Ritchie+Valens+-+The+Very+Best+Of+%5B192Kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pubfood22","files":28,"time":1204589359,"description":"Ritchie Valens - The Very Best Of. Enoded in 192Kbps.\n\nEnjoy and remember to keep seeding after downloading, thank you.\n\nPlaylist files:\n\n1. Ritchie Valens - Very Best Of - 01 - Come on let&amp;#039;s go\n2. Ritchie Valens - Very Best Of - 02 - La Bamba\n3. Ritchie Valens - Very Best Of - 03 - That&amp;#039;s my little Suzie\n4. Ritchie Valens - Very Best Of - 04 - Boney Maronie\n5. Ritchie Valens - Very Best Of - 05 - Ooh! My head\n6. Ritchie Valens - Very Best Of - 06 - Framed\n7. Ritchie Valens - Very Best Of - 07 - Cry cry cry\n8. Ritchie Valens - Very Best Of - 08 - Paddi-wack song\n9. Ritchie Valens - Very Best Of - 09 - Hurry up\n10. Ritchie Valens - Very Best Of - 10 - Fast freight\n11. Ritchie Valens - Very Best Of - 11 - Dooby-dooby wah\n12. Ritchie Valens - Very Best Of - 12 - Bluebirds over the mountain\n13. Ritchie Valens - Very Best Of - 13 - Big baby blues\n14. Ritchie Valens - Very Best Of - 14 - Rockin&amp;#039; all night\n15. Ritchie Valens - Very Best Of - 15 - Hi-tone\n16. Ritchie Valens - Very Best Of - 16 - In a Turkish town\n17. Ritchie Valens - Very Best Of - 17 - Donna\n18. Ritchie Valens - Very Best Of - 18 - Little girl\n19. Ritchie Valens - Very Best Of - 19 - We belong together\n20. Ritchie Valens - Very Best Of - 20 - Stay beside me\n21. Ritchie Valens - Very Best Of - 21 - Ritchie&amp;#039;s blues\n22. Ritchie Valens - Very Best Of - 22 - My darling is gone\n23. Ritchie Valens - Very Best Of - 23 - Now you&amp;#039;re gone\n24. Ritchie Valens - Very Best Of - 24 - That&amp;#039;s my little Suzie (alternate)\n25. Ritchie Valens - Very Best Of - 25 - Rhythm song\n26. Ritchie Valens - Rock little darlin&amp;#039; (1:17)\n27. Ritchie Valens - Let&amp;#039;s rock and roll (1:29)\n28. Ritchie Valens - Malaguena (3:00)\n\n\nAbout Ritchie Valens\nFrom Wikipedia, the free encyclopedia\nJump to: navigation, search\nFor other persons named Valenzuela, see Valenzuela (disambiguation).\nRitchie Valens \n\n\nRitchie Valens album cover \nBackground information \nBirth name Ricardo Steven Valenzuela \nBorn May 13, 1941(1941-05-13) \nOrigin Pacoima, California, USA \nDied February 3, 1959 (aged 17)\nnear Clear Lake, Iowa, USA \nGenre(s) Rock and roll \nOccupation(s) Singer \nInstrument(s) Guitar \nYears active 1958???1959 \nLabel(s) Del-Fi Records \nRitchie Valens (Ricardo Steven Valenzuela, May 13, 1941 ??? February 3, 1959) was a pioneer of rock and roll and a forefather to the Chicano rock movement. His professional career lasted a period of only eight months, during which time he recorded some of the most influential songs of the 1950s rock and roll era. His best known song, &quot;La Bamba,&quot; is one of the very first Latin Rock songs to become a hit[1] [2], making Valens the father of the Spanish rock and roll movement. On February 3, 1959, on what has become known as The Day the Music Died, Valens was killed in a small-plane crash in Iowa, a tragedy which also claimed the lives of fellow musicians Buddy Holly and J.P. &quot;The Big Bopper&quot; Richardson.\n\nContents [hide]\n1 Career \n2 The Day The Music Died \n3 Legacy \n4 Tributes \n5 Original albums \n6 Compilation albums \n7 Singles \n8 See also \n9 References \n10 External links \n \n\n\n[edit] Career\nRitchie Valens was born in Pacoima, a neighborhood in the San Fernando Valley region of Los Angeles, on May 13, 1941. Brought up hearing traditional Mexican mariachi music, as well as flamenco guitar, R&amp;B and jump blues, he expressed an interest in making music of his own by the age of 5. He was encouraged by his father to take up guitar and trumpet, and later taught himself the drums. One day, a neighbor came across Ritchie trying to play a guitar that had only two strings. He re-strung the instrument, and taught Ritchie the fingerings of some chords. While Ritchie was left-handed, he was so eager to learn the guitar that he mastered the traditionally right-handed version of the instrument. By the time he was attending Pacoima Junior High School, his proficiency on the guitar was such that he brought the instrument to school and would sing and play songs to his friends on the bleachers.\n\nWhen he was sixteen years old, he was invited to join a local band named The Silhouettes as a guitarist. Later on, the main vocalist left the group and Ritchie assumed this position as well. In addition to the performances with The Silhouettes, he would play solo at parties and other social gatherings.\n\n \nRitchie Valens album coverA completely self-taught musician, Valens was an accomplished singer and guitarist. At his appearances he often improvised new lyrics and added new riffs to popular songs while he was playing. This is an aspect of his music that is not heard in his commercial studio recordings. Due to his high-energy performances, Valenzuela earned the nickname &quot;The Little Richard of the Valley&quot;.\n\nIn May 1958, Bob Keane, the owner and President of Del-Fi Records, a small Hollywood record label, was given a tip about a young performer from Pacoima by the name of Richard Valenzuela. Keane, swayed by the Little Richard connection, went to see Valenzuela play a Saturday morning matin??e at a movie theater in San Fernando. Impressed by the performance, he invited Ritchie to audition at his home in the Silver Lake area of Los Angeles, where he had a small recording studio in his basement. The recording equipment comprised an early portable tape recorder ??? a two-track Ampex 6012 ??? and a pair of Telefunken U-87 condenser microphones.\n\nAfter this first &amp;#039;audition&amp;#039;, Keane decided to sign Ritchie to Del-Fi, and a contract was prepared and signed on May 27, 1958. It was at this point that he took the name Ritchie, because, as Keane said, &quot;There were a bunch of &amp;#039;Richies&amp;#039; around at that time, and I wanted it to be different.&quot; Similarly, it was Keane who decided to shorten his surname to Valens from Valenzuela, in order to broaden his appeal.\n\nSeveral songs that would later be re-recorded at Gold Star Studios in Hollywood were first demoed in Keane&amp;#039;s studio. The demos were mostly just Ritchie singing and playing guitar. Some of them featured drums. These original demos can be heard on the Del-Fi album Ritchie Valens ??? The Lost Tapes. As well as the aforementioned demos, two of the tracks laid down in Keane&amp;#039;s studio were taken to Gold Star and had additional instruments dubbed over to create full-band recordings. &quot;Donna&quot; was one track (although there are two other preliminary versions of the song, both available on &amp;#039;&amp;#039;The Lost Tapes), and the other was an instrumental entitled &quot;Ritchie&amp;#039;s Blues&quot;.\n\nAfter several songwriting and demo recording sessions with Keane in his basement studio, Keane decided that Ritchie was ready to enter the studio with a full band backing him. Amongst the musicians were Rene Hall and Earl Palmer. The first songs recorded at Gold Star, at a single studio session one afternoon in July 1958, were &quot;Come On, Let&amp;#039;s Go&quot;, an original (credited to Valens/Kuhn, Keane&amp;#039;s real name), and &quot;Framed,&quot; a Jerry Leiber and Mike Stoller tune. Pressed and released within days of the recording session taking place, the record was a success. Valens&amp;#039; next record, a double A-side which was the final record to be released in his lifetime, had the songs &quot;Donna&quot; (written about a real girlfriend), coupled with &quot;La Bamba.&quot;\n\nMusic sample:\n&quot;La Bamba&quot; (1959)\n\n\nProblems listening to the file? See media help.\nAt this point, in the autumn of 1958, Valens quit high school to concentrate on his career. Keane booked appearances at venues all across the United States and performances on television programs. Valens, however, had a fear of flying brought on by a freak accident at his Pacoima Junior High School when two airplanes collided over the playground, killing or injuring several of his friends.[3] Valens was not at school that day as he was attending his grandfather&amp;#039;s funeral. He eventually succeeded in overcoming his fear enough to travel by airplane. One of his first stops was Philadelphia to appear on Dick Clark&amp;#039;s American Bandstand television show on October 6], where he sang &quot;Come On, Let&amp;#039;s Go.&quot; In November, Ritchie traveled to Hawaii and performed alongside Buddy Holly and Paul Anka. Valens found himself a last-minute addition on the bill of legendary discjockey Alan Freed&amp;#039;s Christmas Jubilee in New York City, singing with some of those who had greatly influenced his music, including Chuck Berry, The Everly Brothers, Duane Eddy, Eddie Cochran and Jackie Wilson. December 27th saw a return to American Bandstand, this time for a performance of &quot;Donna.&quot;\n\nUpon his return to Los Angeles, Valens filmed an appearance in Alan Freed&amp;#039;s movie Go Johnny Go!. In the film, he appears in a diner, miming his song &quot;Ooh! My Head,&quot; using a Gretsch guitar borrowed from Eddie Cochran. In between the live appearances, Ritchie returned to Gold Star several times, recording the tracks that would comprise his two albums.\n\nIn early 1959, Valens was traveling the Midwest on a multi-act rock and roll tour dubbed &quot;The Winter Dance Party.&quot; Accompanying him were Buddy Holly with a new back-up band, Tommy Allsup on guitar, Waylon Jennings on bass, and Carl Bunch on drums; Dion and the Belmonts; J.P. &quot;The Big Bopper&quot; Richardson; and Frankie Sardo. None of the other performers had backing bands, so Buddy&amp;#039;s backup band filled in for all the shows.\n\n \nRitchie Valens album coverConditions for the performers on the tour buses were abysmal, and the bitterly cold Midwest weather took its toll on the party; Carl Bunch had to be hospitalized with severely frostbitten feet, and several others (including Valens and The Big Bopper) caught colds. The show was split into two acts, with Ritchie closing the first act. After Bunch was hospitalized, a member of the Belmonts who had some drum experience took over the drumming duties. When Dion and the Belmonts were performing, the drum seat was taken by either Valens or Buddy Holly. There is a surviving color photograph of Ritchie at the drum kit.\n\n\n[edit] The Day The Music Died\nMain article: The Day the Music Died\nThe bus they all were taking on the tour broke down and Buddy Holly decided to charter a small plane for himself and his back-up band (The Crickets name was surrendered to Buddy&amp;#039;s former bandmates Jerry Allison and Joe Mauldin) to get to the next show on time, get some rest, and get their laundry done. After the February 2, 1959, performance at the Surf Ballroom in Clear Lake, Iowa, Holly, Richardson (who pleaded with Waylon Jennings for his seat because he was stricken with flu), and Valens (who had won Tommy Allsup&amp;#039;s seat after a coin toss), were taken to Clear Lake airport by the manager of the Surf Ballroom.\n\nThe plane, a four-passenger Beechcraft Bonanza, departed for Fargo, North Dakota, into a blinding snowstorm and crashed into farmer Albert Juhl&amp;#039;s cornfield shortly after takeoff. The crash ended the lives of all three passengers, as well as that of the 21-year-old pilot, Roger Peterson. This event is said to have inspired singer Don McLean&amp;#039;s popular 1971 ballad &quot;American Pie&quot;, and immortalized February 3 as &quot;The Day the Music Died.&quot; The event also inspired the Eddie Cochran song &quot;Three Stars&quot;, which specifically mentions Holly, the Big Bopper, and Valens.\n\n\n[edit] Legacy\nValens was a pioneer of Chicano rock, Latin rock and was an inspiration to many musicians of Latino heritage. He influenced the likes of Los Lobos, Los Lonely Boys, and Carlos Santana among countless others at a time when there were very few Latinos in American rock and pop music. He is considered the first Latino to ever successfully cross over into Rock mainstream.\n\n&quot;La Bamba&quot; would prove to be his most influential recording; not only by becoming a pop chart hit sung entirely in Spanish but also because of its successful blending of traditional Latin American music with rock. He was a pioneer and was an inspiration for many after his tragic death. Valens was the first to capitalize on this formula which would later be adopted by such varied artists as Selena, Caifanes, Cafe Tacuba,Circo, El Gran Silencio, Aterciopelados, Gustavo Santaolalla and many others in the Latin Alternative scene. Ironically, the Valenzuela family spoke only English at home, and Ritchie had to learn the lyrics of &quot;La Bamba&quot; phonetically in order to record the song in Spanish.\n\n&quot;Come on Let&amp;#039;s Go&quot; has been covered by Los Lobos, The Ramones and &quot;The Paley Brothers;&quot; (jointly, The Ramones on guitar, bass, and drums and The Paley Brothers on vocals), Tommy Steele, The Huntingtons and The McCoys.\n\n&quot;Donna&quot; has been covered by artists as diverse as MxPx, Cliff Richard, The Youngbloods, Clem Snide, Cappadonna, and The Misfits among many others.\n\nRobert Quine has cited Valens&amp;#039; guitar playing as an early influence on his style.\n\nDonna Ludwig, Ritchie&amp;#039;s girlfriend, is today still recognized as &quot;Ritchie&amp;#039;s Donna&quot;. Her personalized license plate reads &quot;ODONNA&quot;.\n\nRitchie&amp;#039;s nephew, Ernie Valens, has toured worldwide playing his uncle&amp;#039;s songs, including a new version of the &quot;Winter Dance Party&quot; tour with Buddy Holly impersonator John Mueller. This tour has taken place at many of the original 1959 venues in the midwest.\n\nValens is interred in the San Fernando Mission Cemetery in Mission Hills, California. He has a star on the Hollywood Walk of Fame at 6733 Hollywood Blvd. in Hollywood, California. He was inducted into the Rock and Roll Hall of Fame in 2001 and his pioneering contribution to the genre has been recognized by the Rockabilly Hall of Fame. Ritchie&amp;#039;s mother Connie died in 1995 and is buried alongside him.[4]\n\nThe 1987 biopic film La Bamba introduced Lou Diamond Phillips as Valens and co-starred Esai Morales as his older half-brother, Bob Morales. Los Lobos performed most of the music in the film.\t\t","torrent":{"xt":"urn:btih:7b5c106a48e6f25d3f507f7cf96b1323a17f44dd","amp;dn":"Ritchie+Valens+-+The+Very+Best+Of+%5B192Kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b5c106a48e6f25d3f507f7cf96b1323a17f44dd","infoHashBuffer":{"type":"Buffer","data":[123,92,16,106,72,230,242,93,63,80,127,124,249,107,19,35,161,127,68,221]},"announce":[],"urlList":[]}}