{"title":"Avril Lavigne - Girlfriend","uid":4316768,"size":127379460,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7b7e6b5718a45515c6fa423e7db9975a2ead0ec1&amp;dn=Avril+Lavigne+-+Girlfriend&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":1,"time":1217129474,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nThis video has no logo or titles.\n\n\n\n&quot;Girlfriend,&quot; a song by Canadian singer Avril Lavigne, is the lead single from her third album, The Best Damn Thing (2007). It was produced by Lukasz &quot;Dr. Luke&quot; Gottwald. &quot;Girlfriend&quot; became Lavigne&amp;#039;s biggest hit in the United States, where it reached number one on the U.S. Billboard Hot 100. It topped the chart in Australia for 6 weeks, and reached number two in the United Kingdom.\n\nThe world premiere of the music video was announced to be on MTV&amp;#039;s Total Request Live and MuchMusic&amp;#039;s MuchOnDemand on February 26. However, it premiered in New Zealand on Music Station C4 on February 20. It was in heavy rotation on European music TV channel VIVA Polska on February 23 as well.\n\nThe music video was directed by The Malloys and filmed at Golf &amp;#039;n&amp;#039; Stuff in Norwalk, California. It features two girls: one with an innocent persona, glasses and red hair (Lavigne), and one with an evil persona and black hair (also Lavigne) The black-haired rocker fights over the man with the red-haired girl and tries to outdo her repeatedly. She finally hits the girl in the head with a golf ball, causing her to fall into water at the golf course, and then finally wins the youth&amp;#039;s affections. Lavigne then takes her boyfriend into a bathroom stall and slightly opens the door after a moment and gives a thumbs up. Lavigne&amp;#039;s boyfriend in the video is played by American model Bryan McMullin and dresses similarly to the &quot;rocker&quot; Lavigne in the video. The video features Lavigne&amp;#039;s previous guitarist Evan Taubenfeld, and Lavigne&amp;#039;s brother Matt on bass. \n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:7b7e6b5718a45515c6fa423e7db9975a2ead0ec1","amp;dn":"Avril+Lavigne+-+Girlfriend","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b7e6b5718a45515c6fa423e7db9975a2ead0ec1","infoHashBuffer":{"type":"Buffer","data":[123,126,107,87,24,164,85,21,198,250,66,62,125,185,151,90,46,173,14,193]},"announce":[],"urlList":[]}}