{"title":"SMPlayer 0.6.7 Portable","uid":4770912,"size":12627891,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7c51fc73c0243e5d898603a8056e7e61fa7b6d7b&amp;dn=SMPlayer+0.6.7+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1237038441,"description":"Copied from SMPlayer Homepage:\n\n\nSMPlayer intends to be a complete front-end for MPlayer, from basic features like playing videos, DVDs, and VCDs to more advanced features like support for MPlayer filters and more.\n\n\nOne of the most interesting features of SMPlayer: it remembers the settings of all files you play. So you start to watch a movie but you have to leave... don't worry, when you open that movie again it will resume at the same point you left it, and with the same settings: audio track, subtitles, volume...\n\n\nOther additional interesting features:\n\nConfigurable subtitles. You can choose font and size, and even colors for the subtitles.\n\nAudio track switching. You can choose the audio track you want to listen.\nWorks with avi and mkv. And of course with DVDs.\n\nSeeking by mouse wheel. You can use your mouse wheel to go forward or backward in the video.\n\nVideo equalizer, allows you to adjust the brightness, contrast, hue, saturation and gamma of the video image.\n\nMultiple speed playback. You can play at 2X, 4X... and even in slow motion.\n\nFilters. Several filters are available: deinterlace, postprocessing, denoise... and even a karaoke filter (voice removal).\n\nAudio and subtitles delay adjustment. Allows you to sync audio and subtitles.\n\nAdvanced options, such as selecting a demuxer or video &amp; audio codecs.\n\nPlaylist. Allows you to enqueue several files to be played one after each other. \n\nAutorepeat and shuffle supported too.\n\nPreferences dialog. You can easily configure every option of SMPlayer by using a nice preferences dialog.\n\nPossibility to search automatically for subtitles in opensubtitles.org.\n\nTranslations: currently SMPlayer is translated into more than 20 languages, including Spanish, German, French, Italian, Russian, Chinese, Japanese....\n\nIt's multiplatform. Binaries available for Windows and Linux.\n\nSMPlayer is under the GPL license.\n\n\nMost important changes since 0.6.6:\n\n\n* Added experimental (and uncomplete) support for dvd menus.\n  Requires a mplayer build compiled with dvdnav support.\n  Please read dvdmenus.txt to know how to enable it.\n\n* Now loading an external subtitle file doesn't require to restart the mplayer\n  process (except for idx/sub subtitles).\n\n* (Playlist) When a file is added to the playlist, if it was already in the \n  list, it's moved to the end of the list.\n\n* Options for mplayer: finally spaces in arguments between quotes are handled \n  properly.\n\n* Added two options (in the audio and subtitle menus) to allow the user to \n  enter the audio and subtitle delay (in milliseconds).\n\n* (ASS subtitles) The outline and shadow options now accept values with \n  decimals.\n\n* (ASS subtitles) Possibility to change the color of the border and shadow.\n\n* Now the default value for the &quot;correct pts&quot; option is auto.\n\n* (Windows) Now the screensaver is allowed to turn on if the file is paused \n  or it's an audio file.\n\n* (Windows) The direct3d video output is now the default for Windows Vista.\n\n\nComments from the uploader (olofolleola4):\nYou will need 7-Zip to extract the file.\n\nI have uploaded it here on TPB:\n\n\n7-Zip 4.65 (32-bit)\nhttp://thepiratebay.se/torrent/4700615/7-Zip_4.65_(32-bit)\n\n7-Zip 4.65 (64-bit)\nhttp://thepiratebay.se/torrent/4716954/7-Zip_4.65_(x64)\n\n7-Zip 4.65 (64-bit Itanium)\nhttp://thepiratebay.se/torrent/4716951/7-Zip_4.65_x64_(IA_%5BItanium%5D_64-bit)","torrent":{"xt":"urn:btih:7c51fc73c0243e5d898603a8056e7e61fa7b6d7b","amp;dn":"SMPlayer+0.6.7+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c51fc73c0243e5d898603a8056e7e61fa7b6d7b","infoHashBuffer":{"type":"Buffer","data":[124,81,252,115,192,36,62,93,137,134,3,168,5,110,126,97,250,123,109,123]},"announce":[],"urlList":[]}}