{"title":"Taking Up The Slack - Article","uid":4568928,"size":108465,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d56a44549fcee8966c6ee3596d6b33139a3a360&amp;dn=Taking+Up+The+Slack+-+Article&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SwissLos","files":1,"time":1228986267,"description":"AUTHOR: David Miller\n\nABSTRACT:\nMy aim in this paper is to investigate what justice requires of agents who find themselves in situations that have the following general form. There are many agents who by acting together can avert some anticipated harm. Together, then, they share responsibility for avoiding that harm, but furthermore this collective responsibility can be divided fairly between them so that each knows what he or she must do to discharge that fair share. Despite this, however, some comply but others do not; the ones who do not comply could have chosen to do so, but they have shirked their share of the responsibility, and in doing so have acted unfairly. The question then arises: how should we understand the position of those who have already complied or those who have yet to decide what to do? What are their responsibilities now, in the face of partial compliance? Must they take up the slack, by doing more than they were required to do according to the original fair division of responsibility? What does justice demand in this situation?","torrent":{"xt":"urn:btih:7d56a44549fcee8966c6ee3596d6b33139a3a360","amp;dn":"Taking+Up+The+Slack+-+Article","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d56a44549fcee8966c6ee3596d6b33139a3a360","infoHashBuffer":{"type":"Buffer","data":[125,86,164,69,73,252,238,137,102,198,238,53,150,214,179,49,57,163,163,96]},"announce":[],"urlList":[]}}