{"title":"Little Snitch 2.2.3 + Serial #","uid":5560667,"size":6438383,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:7d754ea1f46ef49bab55b912f9d8bfbe20c943ba&amp;dn=Little+Snitch+2.2.3+%2B+Serial+%23&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analoggeek","files":-1,"time":1273826814,"description":"DESCRIPTION\nLittle Snitch... A firewall protects your computer against unwanted guests from the Internet. But who protects your private data from being sent out? Little Snitch does!\nAs soon as you're connected to the Internet, applications can potentially send whatever information they want to wherever they want.\n\nSometimes they do this for good reason, on your explicit request. But often they don't. Little Snitch allows you to intercept these unwanted connection attempts, and lets you decide how to proceed.\n\nLittle Snitch informs you whenever a program attempts to establish an outgoing Internet connection. You can then choose to allow or deny this connection, or define a rule how to handle similar, future connection attempts. This reliably prevents private data from being sent out without your knowledge. Little Snitch runs inconspicuously in the background and it can also detect network related activity of viruses, trojans and other malware.\n\nWHAT'S NEW\nVersion 2.2.3:\nFixed an issue when creating rules by dragging an application into the Little Snitch rules window.\nFixed a localization issue in the preferences window.\nFixed: Some applications were not shown with their correct app icon.\nImproved detection of invalid rules.\nSome minor UI improvements.\n\nREQUIREMENTS\nMac OS X 10.4 or later.\n\n\nSerial number thanks go to Special K and still working after 10 hours","torrent":{"xt":"urn:btih:7d754ea1f46ef49bab55b912f9d8bfbe20c943ba","amp;dn":"Little+Snitch+2.2.3+%2B+Serial+%23","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d754ea1f46ef49bab55b912f9d8bfbe20c943ba","infoHashBuffer":{"type":"Buffer","data":[125,117,78,161,244,110,244,155,171,85,185,18,249,216,191,190,32,201,67,186]},"announce":[],"urlList":[]}}