{"title":"Free For All - Season 1 + Extras (Complete)","uid":4563038,"size":1852563279,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7dc1342b8babc3c2737c87b3a1c39465126708e4&amp;dn=Free+For+All+-+Season+1+%2B+Extras+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"BloodLogic","files":16,"time":1228758264,"description":"Free For All (2003) - Season 1 + Extras (Complete)\n(Showtime, Animated Adult-Comedy)\n\nSeason 1 Delivered to the MySpleen.Net network by handsomeboy\nBonehead was the Source\nExtras Gathered by BloodLogic\nDelivered to the Public by BloodLogic\n\n[This torrent includes Brett Merhar's other mini-series, &quot;Beverly Hills Anger Management,&quot; complete season 1.]\n\nImage 1 (Free For All): http://bayimg.com/HaOkFaaBH\nImage 2 (Free For All): http://bayimg.com/kaokfAAbh\nImage 3 (Beverly Hills Anger Management): http://bayimg.com/kaOKiaabh\n\nDescription (from the Showtime site): FREE FOR ALL features the enduring &quot;cool&quot; of multimillionaire and wheeler-dealer, Clay Zeeman, and his best friend, community college student, Johnny G. Jenkins - a nice guy with a Jiminy Cricket conscience. Johnny and Clay's unique adventures are always further complicated by the antics of Clay's pet ferret, Angus - a former drug company laboratory research animal with an addiction to illicit substances. Not to be left out are Johnny's sex obsessed Grandma, his strangely comical abusive alcoholic father, Dougie Jenkins, and the love of Johnny's life, his neighbor Paula. Supported by a cast of pop culture icons mercilessly plucked from today's headlines, FREE FOR ALL drags its characters through its shocking, hilarious and often absurd take on life. Striking a balance between biting satire and harmless slapstick in the tradition of &quot;South Park,&quot; FREE FOR ALL is an animated comedy series pushing the boundaries of normal TV fare.\n\nWiki: http://en.wikipedia.org/wiki/Free_for_All_(series)\nIMDB: http://www.imdb.com/title/tt0356258/\nShowtime Page: http://www.sho.com/site/freeforall/home.do\n\nCreator: Brett Merhar.\nWriters: Jeffrey Poliquin, Merriwether Williams.\nStarring: Brett Merhar, Jonathan Silverman, Juliette Lewis, Sam McMurray, Mitzi McCall, John Kozeluh, Jonah Convy, Dee Bradley Baker, Grey DeLisle.\n\nVLC Player Compatible (verson # 0.8.6f): {Tested and Confirmed}\n\nSeason 1...\n\nS1E01 - The Deal\nS1E02 - Tootsie\nS1E03 - Sterile Angus\nS1E04 - Hostage Johnny\nS1E05 - Scammer Clay\nS1E06 - Nude Johnny\nS1E07 - Tall Tails\n\nExtras...\n\nMini-Episode\nBeverly Hills Anger Management - Season 1\n--- S1E01 - Episode 1\n--- S1E02 - Episode 2\n--- S1E03 - Episode 3\n--- S1E04 - Episode 4\n--- S1E05 - Episode 5\n--- S1E06 - Episode 6\n\n[BLX Comment: Comcast appealed the decision by the FCC that ruled that packet-shaping is prohibited. What!? They can appeal!?!? Okay, then I want to appeal all executive-empowered departments this instant -- I appeal the conclusion by the FDA that Marijuana research is prohibited, the NIDA and NIH conclusion that Marijuana causes cancer, and the DEA deduction that Marijuana users/growers/sellers should be arrested! I appeal everything! I appeal the executive department's use of ghost flights to fly prisoners to third world nations where they are &quot;legally&quot; tortured! I appeal the national defense department's funding of terrorist groups by the US in the Middle East, the Caribbean, South America, Africa, Europe, and Asia! I appeal the trial of Mumia Abu Jamal, the illegal annexation of Arabian land for Israel, and the Supreme Court's decision that concentration camps are constitutional! ..... Oh, wait, for a moment I was thinking this was a democracy, where my rights as a citizen are completely equal in every way to the rights of massive, well-funded, capitalist organizations. This is exactly as Lenin described: the Dictatorship of the Bourgeoisie. He was 100% correct there -- but 100% wrong that another dictatorship could solve the issue. My right to effect those who make decisions in my life is non-existent. Appealing an executive department's decision? In the Republican-model of government, that is clearly a right that exists only with the elite, privileged, empowered classes, but the common, average, ordinary worker is completely tossed aside and ignored. The state has sided with the class of aristocrats, nobles, and capitalists; it has made them first class citizens in this government, and has reduced the rest of us varying degrees of second-class citizens. Kill all Capitalists, and their armed thugs, the state!! My right to democracy and liberty is more important than their right to exploitation and oppression!]\n\n[Episode Guide Included.]\n\nThis torrent is a part of Operation: Massive Information Leak, Wave Two.\nBloodLogic","torrent":{"xt":"urn:btih:7dc1342b8babc3c2737c87b3a1c39465126708e4","amp;dn":"Free+For+All+-+Season+1+%2B+Extras+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dc1342b8babc3c2737c87b3a1c39465126708e4","infoHashBuffer":{"type":"Buffer","data":[125,193,52,43,139,171,195,194,115,124,135,179,161,195,148,101,18,103,8,228]},"announce":[],"urlList":[]}}