{"title":"&quot;There She Is, Miss America&quot;: The Politics of Sex, Bea","uid":8640857,"size":10880660,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ec1d367686d9dbd72e3e49e3b5c0703bfa8597c&amp;dn=%26quot%3BThere+She+Is%2C+Miss+America%26quot%3B%3A+The+Politics+of+Sex%2C+Bea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"blackatk","files":-1,"time":1372877571,"description":"Publication Date: August 21, 2004 | ISBN-10: 1403963029 | ISBN-13: 978-1403963024 | Edition: First Edition\n\nWhile some see the Miss American Pageant as hokey vestige of another era, many remain enthralled by the annual Atlantic City event. And whether you love it or hate it, no one can deny the impact the contest has had on American popular culture-indeed, many reality television shows seem to have taken cues from the pageant. Founded in 1921, the Miss America Pageant has provided a fascinating glimpse into how American standards of femininity have been defined, projected, maintained, and challenged. At various times, it has been praised as a positive role model for young American women, protested as degrading to women by feminists, and shamed by scandals, such as the one caused by the Penthouse photos of Vanessa Williams in 1984. In this first interdisciplinary anthology to examine this uniquely American event, scholars defend, critique, and reflect on the pageant, grappling with themes like beauty, race, the body, identity, kitsch, and consumerism. &quot;There She Is, Miss America&quot; provides a fascinating examination of an enduring American icon.\n\n\nReview\n&quot;This book is a significant exploration of the dilemma of American women in our modern consumer culture between glamour as objectification and standardization and, conversely, as a means of self-expression. These essays edited by Elwood Watson and Darcy Martin encompass issues of gender, race, and nationality as manifested in the history of the Miss America pageant in an exciting manner to show the power of popular culture in the national consciousness.&quot;\n-- Lois Banner, Professor of History and Gender Studies, University of Southern California\n\n&quot;'There She Is, Miss America' is an insightful yet sobering examination of the identity politics surrounding the Miss America Pageant. It is essential reading for those interested in developing their understanding of issues of body, beauty, racial, and sexual identity.&quot;\n--Robin R. Means Coleman, Associate Professor of Communication, University of Pittsburgh, and author of Say It Loud!: African Americans, Media, and Identity\nAbout the Author\nElwood W. Watson is associate professor of history at East Tennessee State University. Darcy Martin is an adjunct assistant professor in the Women's Studies Department at East Tennessee State University.\n\nPaperback: 224 pages\nPublisher: Palgrave Macmillan; First Edition edition (August 21, 2004)\nLanguage: English\nISBN-10: 1403963029\nISBN-13: 978-1403963024\n &lt;a href=&quot;\nhttp://www.amazon.com/There-She-Miss-America-Politics/dp/1403963029/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1372870010&amp;sr=1-1&amp;keywords=there+she+is+miss+america&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/There-She-Miss-America-Politics/dp/1403963029/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1372870010&amp;sr=1-1&amp;keywords=there+she+is+miss+america&lt;/a&gt;","torrent":{"xt":"urn:btih:7ec1d367686d9dbd72e3e49e3b5c0703bfa8597c","amp;dn":"%26quot%3BThere+She+Is%2C+Miss+America%26quot%3B%3A+The+Politics+of+Sex%2C+Bea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ec1d367686d9dbd72e3e49e3b5c0703bfa8597c","infoHashBuffer":{"type":"Buffer","data":[126,193,211,103,104,109,157,189,114,227,228,158,59,92,7,3,191,168,89,124]},"announce":[],"urlList":[]}}