{"title":"Economic Development: What... (2014) Marcelo M Giugale (multi)","uid":9506141,"size":5808274,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f17ab8bb96d200728ddb0371151b43b2b62a576&amp;dn=Economic+Development%3A+What...+%282014%29+Marcelo+M+Giugale+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1390320469,"description":"Economic Development: What Everyone Needs to Know (2014) Marcelo M Giugale (multi)\n\nEconomic Development: What Everyone Needs to Know by Marcelo M Giugale\n\n\nFormat: mobi/epub/azw3\nLength: 176 pages\nGenre: Non-Fiction/Economics\nDate: 8 January 2014\n\nThere is much discussion about global poverty and the billions of people living with almost nothing. Why is it that governments, development banks, think-tanks, academics, NGOs and many others can't just fix the problem? Why is it that seemingly obvious reforms never happen? Why are prosperity and equity so elusive?\n\nEconomic Development brings readers right into the trenches of economic development to show what practitioners are actually doing and explains the issues, dilemmas, options, frustrations and opportunities they face, day in and day out. In straightforward language and a question-and-answer format, Marcelo M. Giugale outlines the frontier of the development practice or, as he puts it, &quot;...the point at which knowledge stops and ignorance begins.&quot;\n\nHe takes readers from why it is so difficult to get governments to function, to the basic policies that economies need to work well, the powerful new tools for social assistance, and the challenges of inclusion, education, health, infrastructure, technology, data, and foreign aid. The book draws examples from the world over, but pays particular attention to the region that represents development, and the need for it, better than any other: Africa.\n\nAuthor:\n\nMarcelo M. Giugale is the Director of Economic Policy and Poverty Reduction Programs for Africa at the World Bank. A development expert and writer, his twenty-five years of experience span Africa, Central Asia, Eastern Europe, Latin-America and the Middle-East. He received decorations from the governments of Bolivia and Peru, and taught at American University in Cairo, the London School of Economics, and Universidad Catolica Argentina.","torrent":{"xt":"urn:btih:7f17ab8bb96d200728ddb0371151b43b2b62a576","amp;dn":"Economic+Development%3A+What...+%282014%29+Marcelo+M+Giugale+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f17ab8bb96d200728ddb0371151b43b2b62a576","infoHashBuffer":{"type":"Buffer","data":[127,23,171,139,185,109,32,7,40,221,176,55,17,81,180,59,43,98,165,118]},"announce":[],"urlList":[]}}