{"title":"Fracking - A Reference Handbook - David E. Newton","uid":15100515,"size":2136007,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f738086ccc05960bb60182de0ba972915e0f5c2&amp;dn=Fracking+-+A+Reference+Handbook+-+David+E.+Newton&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466952732,"description":"Fracking - A Reference Handbook - David E. Newton (ABC-CLIO, 2015).pdf\r\n\r\nISBN 978–1–61069–691–3\r\n\r\nHydraulic fracturing of oil and gas wells—known commonly as &quot;fracking&quot;—has been in use in the United States for more than half a century. In recent years, however, massive expansion of shale gas fracturing across the nation has put fracking in the public eye. Is fracking a &quot;win win&quot; like its proponents say, or are there significant costs and dangers associated with the use of this energy production technology?\r\n\r\nThis book examines fracking from all angles, addressing the promise of the United States becoming energy independent through the use of the process to tap the massive amounts of natural gas and oil available as well as the host of problems associated with fracking—groundwater contamination and increased seismic activity, just to mention two—that raise questions about the long-term feasibility of the process as a source of natural gas.\r\n\r\nThe first part of the book provides a historical background of the topic; a review of technical information about fracking; and a detailed discussion of the social, economic, political, legal, and other aspects of the current fracking controversy. The second part of the book provides a host of resources for readers seeking to learn even more in-depth information about the topic, supplying a chronology, glossary, annotated bibliography, and profiles of important individuals and organizations. Written specifically for students and young adults, the content is accessible to readers with little or no previous knowledge regarding fracking","torrent":{"xt":"urn:btih:7f738086ccc05960bb60182de0ba972915e0f5c2","amp;dn":"Fracking+-+A+Reference+Handbook+-+David+E.+Newton","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f738086ccc05960bb60182de0ba972915e0f5c2","infoHashBuffer":{"type":"Buffer","data":[127,115,128,134,204,192,89,96,187,96,24,45,224,186,151,41,21,224,245,194]},"announce":[],"urlList":[]}}