{"title":"Democracy Now - 15 nov 2011","uid":6820707,"size":459152302,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7fa4d22b4c02a6d2b8164489ee93f47eed39fd27&amp;dn=Democracy+Now+-+15+nov+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1321376415,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 15, 2011\n\n-  NYPD Raid Occupy Wall Street Encampment Evict Protesters, Clear Zuccotti Park\n-  32 Arrested in Occupy Oakland Raid; 2 City Officials Resign\n-  Supreme Court to Rule on Healthcare Law in 2012\n-  69 Killed in Syria as Jordanian King Calls For Assad to Step Down\n-  Study: Radioactive Levels Too High For Safe Farming\n-  Herman Cain Struggles With Question About Libya\n-  Senate-hopeful Elizabeth Warren Targets Big Banks in First TV Ad\n-  Palestinian Activists Launch Freedom Rides in West Bank\n-  Ex-Penn State Coach Maintains Innocence to Child Rape Charge\n-  D.C. Occupy Protesters Disrupt Health Insurance CEO at Chamber of Commerce\n\n\nSpecial reports\n\n- Occupy Wall Street Evicted in Late Night Raid; Lawyers Secure Injunction to Reopen Zuccotti Park\n\nNearly two months into Occupy Wall Street, New York City police have carried out a major crackdown on the protesters' Lower Manhattan encampment - dismantling tents, confiscating belongings, and arresting more than 70 people. At around 1 a.m. local time, police officers in riot gear circled Zuccotti Park - renamed Liberty Plaza by the protesters - ordering them to leave. Although most people complied, a group of around two to three hundred people refused, locking their arms together in the middle of the park. They were eventually detained after a tense standoff that saw police use pepper spray and hit protesters with batons. Police also dismantled the protesters' encampment, tearing down tents and tossing the sea of belongings, clothing, tarps and equipment into large dump trucks. During our live broadcast, a judge issued a restraining order prohibiting the city and police from evicting the protesters the Occupy Wall Street encampment. We get an update from longtime civil rights attorney, Danny Alterman, who helped file the injunction as part of the Liberty Park Plaza Legal Working Group. &quot;We put together a set of papers on the fly, working nonstop throughout the night, and around 3 o'clock in the morning, contacted Judge Lucy Billings of the New York State Supreme Court who agreed to meet us between 5 and 6 a.m. to review our request for a temporary restraining order, restraining the police from evicting the protesters at Liberty Park, exclusive of lawful arrest for criminal offenses, and - most importantly - enforcing the rules published after the occupation began almost two months ago - - or otherwise preventing protesters from re-entering Liberty Park with tents and other property utilized therein,&quot; Alterman says. Judge Billings signed the order before 6:30 a.m. and a court hearing is set for today.\n\n\n- Inside Occupy Wall Street Raid: Eyewitnesses Describe Arrests, Beatings As Police Dismantle Camp\n\nThe Democracy Now! team rushed down to Zuccotti Park in the middle of the night to report on the police crackdown on Occupy Wall Street. We were there until the early hours of the morning, witnessing the arrests in the streets in Lower Manhattan and the dismantling of the encampment - and the hauling away protesters' belongings. &quot;They can't pull one over our eyes. They can't put nothing in our eyes that's going to blind [us to] what's going on here. And the same goes for all the people who are out there,&quot; a protester told Democracy Now! after the police twice pepper-sprayed him in the face.\n\n\n- Arundhati Roy: Occupy Wall Street is &quot;So Important Because it is in the Heart of Empire&quot;\n\nRenowned Indian writer and global justice activist Arundhati Roy is preparing to address Occupy Wall Street on Wednesday. She recently joined us in the studio to talk about the Occupy movement. &quot;What they are doing becomes so important because it is in the heart of empire, or what used to be empire,&quot; Roy said. &quot;And to criticize and to protest against the model that the rest of the world is aspiring to is a very important and very serious business. So... it makes me very, very hopeful that after a long time you are seeing some nascent, real political anger here. She also discussed her new book, &quot;Walking With The Comrades,&quot; a chronicle of her time in the forests of India alongside rebel guerillas who are resisting a brutal military campaign by the Indian government.\n\n\n- Top Aide to Oakland Mayor Resigns Over Occupy Raid: Mayors, Police Are Doing Wall Street's Business\n\nThe raid in New York City came one day after police officers cleared the Occupy Oakland encampment in California and arrested 32 people. Two prominent members of Oakland Mayor Jean Quan's team have resigned over the past day. Hours before Monday's raid, legal advisor to the mayor's office Dan Siegel resigned to protest the city's crackdown on the Occupy movement. Last night, Deputy Oakland Mayor Sharon Cornu also stepped down. &quot;I am horrified as to what happened in Oakland yesterday and in New York today,&quot; Siegel tells us during our live broadcast. &quot;The people who are working for these mayors and police and so on are doing Wall Street business for them, and we need to stand up against it.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7fa4d22b4c02a6d2b8164489ee93f47eed39fd27","amp;dn":"Democracy+Now+-+15+nov+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fa4d22b4c02a6d2b8164489ee93f47eed39fd27","infoHashBuffer":{"type":"Buffer","data":[127,164,210,43,76,2,166,210,184,22,68,137,238,147,244,126,237,57,253,39]},"announce":[],"urlList":[]}}