{"title":"Wondershare Quiz creator 1.5.0","uid":4193887,"size":9705554,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:810c5638ba822f43d936c5718950d9ce64bf9b46&amp;dn=Wondershare+Quiz+creator+1.5.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zks2gw","files":1,"time":1211119373,"description":"Wondershare QuizCreator is a robust solution designed for teachers, testers, researchers and evaluators to create interactive flash-based quizzes, online surveys and web assessments. This is one of the easy yet effective ways to access knowledge and get valuable opinions. 1. Create a Flash Quiz within Minutes Easily and effectively build a quiz in flash within minutes. No complicated flash expertise and No drudgery any more. 2. Customize with Comprehensive Properties Make a unique quiz of different question types (8 types to choose) to meet exact evaluation needs. Add pictures (with description and URL), flash and question notes to appending clarity and fun to a quiz. Custom flash player gives a theme-based look to a quiz. And more properties to offer users full control to design a quiz. 3. Publish with Flexible Quiz Export Options Quizzes can be directly published to web or even for LMS (SCORM/AICC, QuizCreator is an ADL SCORM Adopter). For data reuse and analysis, users can track test results by using the samples (ASP/PHP) we build for collecting data. CD and email deliveries are another two options for the convenient purpose. Upload a quiz is easy with the FTP upload feature","torrent":{"xt":"urn:btih:810c5638ba822f43d936c5718950d9ce64bf9b46","amp;dn":"Wondershare+Quiz+creator+1.5.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"810c5638ba822f43d936c5718950d9ce64bf9b46","infoHashBuffer":{"type":"Buffer","data":[129,12,86,56,186,130,47,67,217,54,197,113,137,80,217,206,100,191,155,70]},"announce":[],"urlList":[]}}