{"title":"Semiconducting Chalcogenide Glass II: Properties of Chalcogenide","uid":6526810,"size":4658887,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:820e889aa55145647f9d12c1f82e92a2faefd7ac&amp;dn=Semiconducting+Chalcogenide+Glass+II%3A+Properties+of+Chalcogenide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"_F1_","files":-1,"time":1310196005,"description":"Semiconducting Chalcogenide Glass II: Properties of Chalcogenide Glasses By Robert Fairman, Boris Ushkov\n Publisher: Aca..de..mic Press 2005 | 323 Pages | ISBN: 0127521887 | PDF | 14 MB\n\n\n\n Chalcogenide glass is made up of many elements from the Chalcogenide group. The glass is transparent to infrared light and is useful as a semiconductor in many electronic devices. For example, chalcogenide glass fibers are a component of devices used to perform laser surgery. \n\n The properties of chalcogenide glass result not only from their chemical composition and atomic structure, but also from the impact of numerous external factors. A comprehensive survey is presented of the properties of chalcogenide glass under various external impacts. Practical recommendations are presented for a wide range of applications. \n\n Part II is the second part of a three-volume work within the Semiconductors and Semimetals series. \n The first collective monograph written by Eastern European scientists on the electrical and optical properties of chalcogenide vitreous semiconductors (CVS).\n Contributions by B.G. Kolomiets, who discovered the properties of chalcogenide glass in 1955!\n Provides objective evidence and discussion by authors from opposing positions.","torrent":{"xt":"urn:btih:820e889aa55145647f9d12c1f82e92a2faefd7ac","amp;dn":"Semiconducting+Chalcogenide+Glass+II%3A+Properties+of+Chalcogenide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"820e889aa55145647f9d12c1f82e92a2faefd7ac","infoHashBuffer":{"type":"Buffer","data":[130,14,136,154,165,81,69,100,127,157,18,193,248,46,146,162,250,239,215,172]},"announce":[],"urlList":[]}}