{"title":"Comm Check - The Final Flight Of Shuttle Columbia","uid":8819549,"size":1141717,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8434c9ecc99541419504c0dce3c32412866bf394&amp;dn=Comm+Check+-+The+Final+Flight+Of+Shuttle+Columbia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flexy321","files":5,"time":1376668344,"description":"Comm Check...: The Final Flight of Shuttle Columbia\n\nMichael Cabbage, William Harwood\n\nTags: Space Shuttle, NASA, Columbia, Astronomy &amp; Astrophysics, Astronomy &amp; Space Science, Astrophysics &amp; Space Science, History &amp; Philosophy, Physics, Political Science, Professional &amp; Technical, Transportation\n\nEPUB / MOBI\n\n\nDESC:\n\nOn February 1, 2003, the unthinkable happened. The space shuttle Columbia disintegrated 37 miles above Texas, seven brave astronauts were killed and America's space program, always an eyeblink from disaster, suffered its second catastrophic in-flight failure. Unlike the Challenger disaster 17 years earlier, Columbia's destruction left the nation one failure away from the potential abandonment of human space exploration. Media coverage in the immediate aftermath focused on the possible cause of the disaster, and on the nation's grief. But the full human story, and the shocking details of NASA's crucial mistakes, have never been told -- until now.\n\nBased on dozens of exclusive interviews, never-before-published documents and recordings of key meetings obtained by the authors, Comm Check takes the reader inside the conference rooms and offices where NASA's best and brightest managed the nation's multi-billion-dollar shuttle program -- and where they failed to recognize the signs of an impending disaster. It is the story of a space program pushed to the brink of failure by relentless political pressure, shrinking budgets and flawed decision making. The independent investigation into the disaster uncovered why Columbia broke apart in the sky above Texas. Comm Check brings that story to life with the human drama behind the tragedy.\n\nMichael Cabbage and William Harwood, two of America's most respected space journalists, are veterans of all but a handful of NASA's 113 shuttle missions. Tapping a network of sources and bringing a combined three decades of experience to bear, the authors provide a rare glimpse into NASA's inner circles, chronicling the agency's most devastating failure and the challenges that face NASA as it struggles to return America to space.\n","torrent":{"xt":"urn:btih:8434c9ecc99541419504c0dce3c32412866bf394","amp;dn":"Comm+Check+-+The+Final+Flight+Of+Shuttle+Columbia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8434c9ecc99541419504c0dce3c32412866bf394","infoHashBuffer":{"type":"Buffer","data":[132,52,201,236,201,149,65,65,149,4,192,220,227,195,36,18,134,107,243,148]},"announce":[],"urlList":[]}}