{"title":"Collateral (2004)","uid":4524890,"size":1561778676,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8456e74e8a72446ec3382e8ae188dde0fe1d62f5&amp;dn=Collateral+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"maike_spjp","files":1,"time":1227315566,"description":"Please share and comment. \nThe continuity of peer-to-peer depends on you. \nVisit http://www.finalshare.net\n\nEnglish\n-------\nA taxi driver is unexpectedly taken on the ride of his life in this stylish thriller from acclaimed director Michael Mann. Max (Jamie Foxx) is a cab driver who hopes to some day open his own limo company; one night behind the wheel begins promisingly when he picks up Annie (Jada Pinkett Smith), an attorney working with the federal government who is attractive, friendly, and gives him her business card after paying her fare. Max thinks his luck is getting even better when his next fare, Vincent (Tom Cruise), offers him several hundred dollars in cash if he&amp;#039;ll be willing to drop him off, wait, and pick him up at five different spots over the course of the evening. Max agrees, but he soon realizes Vincent isn&amp;#039;t just another guy with errands to run -- Vincent is an assassin who has been paid to murder five people who could put the leaders of a powerful drug trafficking ring behind bars in an upcoming trial. As circumstances force Max to do Vincent&amp;#039;s bidding, the cabbie has to find a way to prevent Vincent from killing again and save his own skin, a task that becomes especially crucial when he discovers Annie is one of the names on Vincent&amp;#039;s hit list. Collateral also stars Mark Ruffalo, Peter Berg, and Bruce McGill as police detectives hot on Vincent&amp;#039;s trail.\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nPortuguÃƒÂªs\n---------\nMax (Jamie Foxx) trabalha como motorista de tÃƒÂ¡xi hÃƒÂ¡ 12 anos, jÃƒÂ¡ tendo levado os mais diversos passageiros a todos os locais de Los Angeles. PorÃƒÂ©m, em uma noite aparentemente tranquila, ele encontra Vincent (Tom Cruise), um homem que pega o tÃƒÂ¡xi como se fosse um passageiro qualquer. PorÃƒÂ©m Vincent ÃƒÂ© um assassino de aluguel, que estÃƒÂ¡ na cidade para completar o plano de um cartel do narcotrÃƒÂ¡fico, que estÃƒÂ¡ prestes a ser condenado por um jÃƒÂºri federal. Vincent precisa matar 5 testemunhas-chave do processo e conta com Max para fugir da polÃƒÂ­cia local e do FBI, logo apÃƒÂ³s cometer os assassinatos. Obrigado a seguir as ordens de Vincent, Max precisa ainda lidar com a possibilidade de ser morto por seu passageiro a qualquer momento, jÃƒÂ¡ que Vincent pode usÃƒÂ¡-lo para proteÃƒÂ§ÃƒÂ£o pessoal. ","torrent":{"xt":"urn:btih:8456e74e8a72446ec3382e8ae188dde0fe1d62f5","amp;dn":"Collateral+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8456e74e8a72446ec3382e8ae188dde0fe1d62f5","infoHashBuffer":{"type":"Buffer","data":[132,86,231,78,138,114,68,110,195,56,46,138,225,136,221,224,254,29,98,245]},"announce":[],"urlList":[]}}