{"title":"SystemTools Hyena v10.5 (x86-x64) Incl Keymaker-CORE [TorDigger]","uid":9298017,"size":22293692,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8482975a0fbf26f70302b5d046ad81f1f474b6b4&amp;dn=SystemTools+Hyena+v10.5+%28x86-x64%29+Incl+Keymaker-CORE+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":12,"time":1386189312,"description":"SystemTools Hyena\n\nUsing the built-in Windows administration tools to manage a medium to large Windows 200x network or Active Directory environment can be a challenge. Add multiple domains, hundreds or thousands of servers, workstations, and users, and before you know it, things can get out of hand. Hyena is designed to both simplify and centralize nearly all of the day-to-day management tasks, while providing new capabilities for system administration. This functionality is provided in a single, centralized, easy to use product. Used today by tens of thousands of system administrators worldwide, Hyena is the one tool that every administrator cannot afford to be without.\n\nHyena uses an Explorer-style interface for all operations, including right mouse click pop-up context menus for all objects. Management of users, groups (both local and global), shares, domains, computers, services, devices, events, files, printers and print jobs, sessions, open files, disk space, user rights, messaging, exporting, job scheduling, processes, and printing are all supported. \n\nIn fact, Hyena can be used on any Windows client to manage any Windows NT, Windows 2000, Windows XP/Vista, Windows 7, Windows 8 or Windows Server 2003/2008/2012 installation.\n\nIn addition to supporting standard Windows system management functions, Hyena also includes extensive Active Directory support and management tools.\n\nThe key new feature in v10.0 is the 'Active Editor' : a tabular-like window which lets you freely move around and modify directory information as easily as if it were in a spreadsheet. The Active Editor (the 'Editor') builds its initial data contents from any Active Directory query results in Hyena's right window. Since any AD query can be created or customized in Hyena, you are in complete control over which directory attributes (fields) are displayed and can be modified in the Editor. The Editor can be accessed from the context menu of any Active Directory object, or from a toolbar button.\n\nHyena also includes full exporting capabilities and both Microsoft Access and Excel reporting and exporting options. All of these features are part of the Standard Edition of Hyena. The Enterprise Edition adds support for:\n\nTerminal Server user properties and session administration.\nExchange 2000/2003/2007*/2010 Server mailbox integration and properties management.\nWMI integration.\n\n*Exchange 2007: mailbox properties management only.\n\nHyena's cost effective licensing policy is based on the number of administrators actually using the product, regardless of the number of end-users or servers. \n\nSystem Requirements:\n\nWindows NT, Windows 2000, Windows XP/Vista, Windows 7, Windows 8 or Windows Server 2003/2008/2012\n\nHomepage: http://www.systemtools.com/hyena/index.html\n\nInstallation Instructions: \n\n- Install program.\n- Use keygen to get valid serial to register application.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:8482975a0fbf26f70302b5d046ad81f1f474b6b4","amp;dn":"SystemTools+Hyena+v10.5+%28x86-x64%29+Incl+Keymaker-CORE+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8482975a0fbf26f70302b5d046ad81f1f474b6b4","infoHashBuffer":{"type":"Buffer","data":[132,130,151,90,15,191,38,247,3,2,181,208,70,173,129,241,244,116,182,180]},"announce":[],"urlList":[]}}