{"title":"Augustana - Life Imitating Life (2014) [FLAC]","uid":10026081,"size":304639184,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:851c73466e20cb8e15e2830ce57561d7e04eb851&amp;dn=Augustana+-+Life+Imitating+Life+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1398270910,"description":"\n  Augustana - Life Imitating Life (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie\n  Source: WEB\n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Ash and Ember\n  02 Need a Little Sunshine \n  03 Love in the Air \n  04 Youth Is Wasted on the Young\n  05 Say You Want Me\n  06 Fit Together\n  07 According to Plan\n  08 I Really Think So\n  09 Alive\n  10 Remember Me \n  11 Long Way to Go\n  12 American Heartbreak\n\n  Augustana's music is the heartland equivalent of Coldplay and Keane, with a touch of mid-'90s adult alternative throwback (think Counting Crows or the Wallflowers) also peppering the band's rootsy, piano-based rock. Although based in California, the group formed in southern Illinois in 2002, while singer/keyboardist Dan Layus and guitarist Josiah Rosen were studying contemporary Christian music at Greenville College. The band's original lineup also included bassist Simeon Lohrmann, second keyboardist David Lamoureaux, and drummer Kyle Baker. This lineup released a pair of self-distributed CDs -- the full-length Midwest Skies and Sleepless Mondays and the EP Mayfield -- in 2003, but the conservative climate of Greenville College proved to be too confining for the band's two co-founders. Choosing music over academia, Layus and Rosen left Greenville for Los Angeles in 2004, jettisoning the rest of the band and re-forming with a new lineup that included keyboardist John Vincent, bassist Jared Palomar, and drummer Justin South.\n\n  The reformulated Augustana signed with Epic Records in 2005 and released their major-label debut, All the Stars and Boulevards, in September of that year. A slow starter, the album gradually rose to national attention on the strength of &quot;Boston,&quot; a heartfelt ballad that was featured on an episode of Scrubs in early 2006. To encourage this increase in Augustana's popularity, a limited-edition reissue of the album (with extra songs and video content) was released in September 2006. By the following year, All the Stars and Boulevards had finally made its way into the Billboard Top 40 -- a whopping 19 months after its initial release. Augustana then returned in 2008 with a new lineup (Josiah Rosen had left the band for a solo career in early 2006, only to be replaced by guitarist/mandolin player Chris Sachtleben) and a new album, Can't Love, Can't Hurt. More rootsy than the band's debut, Can't Love, Can't Hurt produced a pair of modestly successful singles and sold 400,000 copies worldwide. It also laid the foundation for Augustana, the band's self-titled third album, which appeared in 2011 and featured an even more rootsy, anthemic sound. Producer Jacquire King, the man behind Kings of Leon's breakthrough album Only by the Night, oversaw the project.","torrent":{"xt":"urn:btih:851c73466e20cb8e15e2830ce57561d7e04eb851","amp;dn":"Augustana+-+Life+Imitating+Life+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"851c73466e20cb8e15e2830ce57561d7e04eb851","infoHashBuffer":{"type":"Buffer","data":[133,28,115,70,110,32,203,142,21,226,131,12,229,117,97,215,224,78,184,81]},"announce":[],"urlList":[]}}