{"title":"Terminator The Sarah Connor Chronicles S01-S02 Complete DVDRip","uid":6036578,"size":11684852879,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:85a4a87f720735fdc4d4124fdcfe9fd6c07f1b8d&amp;dn=Terminator+The+Sarah+Connor+Chronicles+S01-S02+Complete+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"qwersd","files":864,"time":1292248069,"description":"Terminator: The Sarah Connor Chronicles (sometimes abbreviated as Terminator: TSCC) is an American science fiction television series that aired on Fox. The show was produced by 20th Century Fox Television, Warner Bros. Television and C2 Pictures (C2 Pictures was replaced by The Halcyon Company in season two). It is a spin-off from the Terminator series of films. It revolves around the lives of the fictional characters Sarah and John Connor, following the events of Terminator 2: Judgment Day. The series premiered on Sunday, January 13, 2008, on the U.S. television network Fox. Production for the series was provided by Terminator 2 and Terminator 3 producers and C2 Pictures Sony Pictures Entertainment (International) co-presidents, Mario Kassar and Andrew G. Vajna, C2 Senior Vice President James Middleton, David Nutter, and Josh Friedman, who not only served as Executive Producer but also wrote the script for the first two episodes.\nThe show opened mid-season with a shortened run of nine episodes, January through March 2008. It was the highest-rated new scripted series of the 2007-08 television season[1] and was renewed for a second season,[2] which began on September 8, 2008, and ended April 10, 2009. On May 18, 2009, despite fan efforts,[3] Fox entertainment president Kevin Reilly announced Fox would not renew the show for a third season.[4][5] Bear McCreary said &quot;At the last spotting session, I begged Josh Friedman for the answers to these questions, and he told me enough that I know season 3 would have been our best.&quot;\n\nSeed atleast 1:1 &amp; remember to leave comments about the quality..\n\nUse 7-Zip to extract files..","torrent":{"xt":"urn:btih:85a4a87f720735fdc4d4124fdcfe9fd6c07f1b8d","amp;dn":"Terminator+The+Sarah+Connor+Chronicles+S01-S02+Complete+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85a4a87f720735fdc4d4124fdcfe9fd6c07f1b8d","infoHashBuffer":{"type":"Buffer","data":[133,164,168,127,114,7,53,253,196,212,18,79,220,254,159,214,192,127,27,141]},"announce":[],"urlList":[]}}