{"title":"The Britannica Guide to the 100 Most Influential Scientists - (M","uid":4653410,"size":1284214,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85ce57905c016c4d641bbb2aee4936d99570f54b&amp;dn=The+Britannica+Guide+to+the+100+Most+Influential+Scientists+-+%28M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"malestrom_HH","files":1,"time":1232128016,"description":" &lt;a href=&quot;http://www.image-upload.net/images/w49qfm9o7jtv5jxx3o.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/w49qfm9o7jtv5jxx3o.jpeg&lt;/a&gt;\n\nJohn Gribbin, Britannica, &quot;Britannica Guide to 100 Most Influential Scientists&quot;\nRobinson Publishing | 2008-08-28 | ISBN: 1845298640 | 320 pages | PDF\n\nWho are the most important men and women whose notions and theories have changed the world? When Isaac Newton claimed that he only saw further because he stood on the shoulders of giants, he alluded to the long list of geniuses that came before him. The history of science is the story of great discoveries, flashes of intuition that have changed the way people see the world, hard work and arduous calculation in the laboratory.\n\n&quot;The Britannica Guide to 100 Most Influential Scientists&quot; is a celebration of the lives and work of the men and women who have changed the way we look at the world, the universe, and ourselves.It includes contributions from top name scientists and writers such James Gleick on Richard Feynman; Michio Kaky on Einstein and Sir Harold Kroton on the Fulleriene (for which he won a Nobel Prize). &quot;The Britannica Guide to 100 Most Influential Scientists&quot; is introduced by John Gribbin. He is the author of nearly 100 popular science books, including the best-selling &quot;In Search of Schrodinger's Cat&quot;. He has received awards for his writing both in the United States and in Britain.\n\nThe holder of a PhD in astrophysics from the University of Cambridge, he still maintains links with research as a Visiting Fellow in Astronomy at the University of Sussex, and was a member of a team there that measured the age of the Universe. While still a student, he received the prestigious Annual Award of the Gravity Research Foundation in the United States, the only student, and the first Englishman working in England, ever to receive this award.","torrent":{"xt":"urn:btih:85ce57905c016c4d641bbb2aee4936d99570f54b","amp;dn":"The+Britannica+Guide+to+the+100+Most+Influential+Scientists+-+%28M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85ce57905c016c4d641bbb2aee4936d99570f54b","infoHashBuffer":{"type":"Buffer","data":[133,206,87,144,92,1,108,77,100,27,187,42,238,73,54,217,149,112,245,75]},"announce":[],"urlList":[]}}