{"title":"Unit Converter Plus v1.3.0.2 Android [SRZ]","uid":8244827,"size":1009035,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:8674b8cdbb7bdf6149260d74350a8f7a6e62c905&amp;dn=Unit+Converter+Plus+v1.3.0.2+Android+%5BSRZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IQCool","files":1,"time":1363031914,"description":" &lt;a href=&quot;https://lh4.ggpht.com/IJSZEK2GKMokzgEs54krZZhA9LGiWk6V9V5pOk4N4bfxnujaGl48AFlRAIStcjipdJXv=w705&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;https://lh4.ggpht.com/IJSZEK2GKMokzgEs54krZZhA9LGiWk6V9V5pOk4N4bfxnujaGl48AFlRAIStcjipdJXv=w705&lt;/a&gt;\n\nTest Result !\n---------------\nSamsung Galaxy S II Thats it Tested and Worked Perfectly !\nRequired Android O/S : 2.1+\n\nInstallation Instruction\n---------------------------------\nInstall the APK and Start Converting and Calculating !\n\nScreenShots !\n &lt;a href=&quot;\nhttps://lh4.ggpht.com/9UQ2gJDjyricGU1ce3lbHGGqJtUufVOxfoT9riJGZLUHyJaq6dd_pVilCts-T2X7fvN6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://lh4.ggpht.com/9UQ2gJDjyricGU1ce3lbHGGqJtUufVOxfoT9riJGZLUHyJaq6dd_pVilCts-T2X7fvN6&lt;/a&gt; &lt;a href=&quot;\nhttps://lh4.ggpht.com/TdSF2OqksiVLfI9NSd7E9nf1caDCv4qfHYz5AgyHsmf1RBRuUxY71SdnbluSXZt-Bck&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://lh4.ggpht.com/TdSF2OqksiVLfI9NSd7E9nf1caDCv4qfHYz5AgyHsmf1RBRuUxY71SdnbluSXZt-Bck&lt;/a&gt;\n\nDescription !\n--------------------\nUnit Converter Plus is a simple and friendly unit converter with a clean user interface. Unit Converter Plus has everything you loved about the original Unit Converter and a whole lot more. Some of the new features include:\n* Currency conversions for 165 countries ( vs 60 in the original).\n** NEW - Ability to search for unit by name and show all categories that unit is found in **\n* The ability to create custom units for nearly every category(**) ( so if a unit is missing and you know the conversion factor you can add it yourself). (**) there are a few categories that do not currently allow for custom units... please email me if you have questions.\n* A new Calculator section with a Tip Calculator and a simple 4 function calculator.\n* More preference options including setting the initial start up screen (to be able to jump to your favorite section automatically) and the option to show results in scientific notation.\n* The ability to search and filter units in the drop-down list.\n* Optimized to be faster and more efficient.\n* Works with Android 2.3 and has Apps2SD for Froyo (and above).\nPlease try out and read the 6700+ reviews for the original Unit Converter which has over 1,000,000+ downloads. If you liked the original you will not be disappointed with Unit Converter Plus!\n** Tips &amp; Tricks **:\n** You can filter the main list of conversions to only show the ones you want by going to Preferences -&gt; Filter Main List. Also, you can toggle the filter on/off with menu item.\n** To change or delete &quot;Quick Launch&quot; shortcut, Long Press the icon and a menu will pop-up to allow you to change or remove the shortcut.\n** If your on-screen keypad doesn't show a decimal point, you can try switching back to using the full keyboard layout by going to Preferences -&gt; Use Full Keyboard Layout.\n** By default when you open the currency screen and it's been over a day since the rates have been downloaded, the app will attempt to download the current rates. You can turn this off by going to Preferences -&gt; Auto Update Currency.\n** If you want to delete a particular favorite then on the Favorite conversion list Long-Press the one to delete and a pop-up will allow you to delete it.\n** If you would like to copy the output of a conversion Long-Press the result box and a pop-up will allow you to copy it to the clipboard. Then you can Long-Press the input value box and select paste.\n.\nNote: Internet permission is required for currency conversion. The ONLY internet it uses is to download the currency rates.","torrent":{"xt":"urn:btih:8674b8cdbb7bdf6149260d74350a8f7a6e62c905","amp;dn":"Unit+Converter+Plus+v1.3.0.2+Android+%5BSRZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8674b8cdbb7bdf6149260d74350a8f7a6e62c905","infoHashBuffer":{"type":"Buffer","data":[134,116,184,205,187,123,223,97,73,38,13,116,53,10,143,122,110,98,201,5]},"announce":[],"urlList":[]}}