{"title":"Keil C51 :: uVision 4","uid":11767651,"size":33071238,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8674830af3cb72d617ec3c15c64d2178e836d2e5&amp;dn=Keil+C51+%3A%3A+uVision+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"digdino","files":2,"time":1426925806,"description":"The Keil 8051 Development Tools:\n\nKeil development tools for the 8051 Microcontroller Architecture support every level of software developer from the professional applications engineer to the student just learning about embedded software development.\n\nThe industry-standard Keil C Compilers, Macro Assemblers, Debuggers, Real-time Kernels, Single-board Computers, and Emulators support all 8051 derivatives and help you get your projects completed on schedule.\n\nThe Keil 8051 Development Tools are designed to solve the complex problems facing embedded software developers.\nWhen starting a new project, simply select the microcontroller you use from the Device Database and the ÂµVision IDE sets all compiler, assembler, linker, and memory options for you.\nNumerous example programs are included to help you get started with the most popular embedded 8051 devices.\nThe Keil ÂµVision Debugger accurately simulates on-chip peripherals (IÂ²C, CAN, UART, SPI, Interrupts, I/O Ports, A/D Converter, D/A Converter, and PWM Modules) of your 8051 device. Simulation helps you understand hardware configurations and avoids time wasted on setup problems. Additionally, with simulation, you can write and test applications before target hardware is available.\nWhen you are ready to begin testing your software application with target hardware, use the MON51, MON390, MONADI, or FlashMON51 Target Monitors, the ISD51 In-System Debugger, or the ULINK USB-JTAG Adapter to download and test program code on your target system.\n\n\nThe new Keil ÂµVision4 IDE has been designed to enhance developer's productivity, enabling faster, more efficient program development.\nÂµVision4 introduces a flexible window management system, enabling you to drag and drop individual windows anywhere on the visual surface including support for Multiple Monitors.\n\nÂµVision4 builds on the popular ÂµVision3 IDE with the addition of:\n\nTop New Features\nMultiple Monitor and flexible window management system\nSystem Viewer windows display device peripheral register information\nDebug Restore Views create and save multiple debug window layouts\nMulti-Project Workspace simplify working with numerous projects\n\n\n\nApp Name:  Keil C51 \nFile Size: 30.3 MB\nVersion:   4\n\nEnjoy !! :)\n\nUploaded by digdino on demand by EEYY WAKEYY","torrent":{"xt":"urn:btih:8674830af3cb72d617ec3c15c64d2178e836d2e5","amp;dn":"Keil+C51+%3A%3A+uVision+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8674830af3cb72d617ec3c15c64d2178e836d2e5","infoHashBuffer":{"type":"Buffer","data":[134,116,131,10,243,203,114,214,23,236,60,21,198,77,33,120,232,54,210,229]},"announce":[],"urlList":[]}}