{"title":"Juan Formell &amp; Los Van Van - Havana Si! [FLAC] TQMP","uid":5836894,"size":1054487598,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:86993a52f64b62db92659a5418ed45878f6231f8&amp;dn=Juan+Formell+%26+Los+Van+Van+-+Havana+Si%21+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pastafari","files":-1,"time":1284754098,"description":"Juan Formell &amp; Los Van Van - Havana Si!\n2009\n\nJuan Formell is probably the most influential  figure in Cuban contemporary music. From creating songo, a mix of son montuno, changui, jazz and funk, to leading the best salsa band in the world and laying, along with Irakere, the roots for timba. Juan Formell and Los Van Van changed the course of music and became an essential part of Cuban culture.\n\nHere's an excellent introduction to this band and a chance to discover if you dig salsa. Enjoy!\n\nBrought to you by TQMP\nThe Quality Music Project\n\nReview\n\nWhat to say about a band that have been slaying dancefloors and radio stations for four decades and who have been nicknamed the 'Rolling Stones of Latin Music'? Not much that hasn't already been said, clearly, though this collection of Los Van Van's leanest and meanest does manage to remind us of why this irrepressible Cuban super-group have such a glowing - and lengthy - legacy. \n\nThe first set (CD 1) features a slew of the band's hits from the 70s and 80s, starting with their 1974 Chirrin Chirran. When they released this record, the band - headed up by bassist/songwriter Juan Formell - were one of only two Cuban groups experimenting with such a racy blend of pop, funk, soul, rock, disco and native styles. (The other was Irakere). \n\nLos Van Van called their style songo due to its mix of traditional son montuno and the percussive funk of Washington's Go-Go scene, and this first Disc is crammed with examples of their genre-blending approach, from the mercurial and muscular Dale Dos, the disco bleeps and slinky bassline of Que Palso Es Ese to the fantastic percussion-and-strings Anda, ven y muevete, (later recorded by Ruben Blades as Muevete). \n\nUnlike much music from the 80s, many of the songs here have dated well. Even synth-heavy tunes like La Habana Si, Aqui El Que Baila Gana and Que Sorpresa! maintain a certain charm, mainly due to their provocative percussion and frequent melody and mood changes. \n\nCD2 plucks tunes from the band's 1990s and 2000s output. Los Van Van underwent many changes during these last two decades, incorporating new personnel and embracing more modern styles like hip-hop, funk &amp; reggae. These years also saw the broader success of the timba style, a Cuban form of salsa pioneered alongside Irakere and NG La Banda. \n\nThese changes can be discerned throughout Disc 2, particularly on tunes like Que Tiene Van Van, the punchy Esto Te Pine La Cabeza Mala, the super-slick Soy Todo and...well, the list goes on. There's hardly a bad or boring song here; and since the band have surely put out their fair share of formulaic music over the years, the beauty of Havana Si must lie precisely in its showcasing of only the very best of their bulging oeuvre.\n-- http://www.bbc.co.uk/music/reviews/f825\n\n\nTrack List\n\nDisc 1\n01- Chirrin chirran\n02- Dale dos\n03- Que palo es ese\n04- El buena gente\n05- Anda, ven y muevete\n06- Sera que se acabo\n07- La Habana si\n08- Recaditos no\n09- La titimania\n10- Hoy se cumplen seis semanas\n11- El negro no tiene na\n12- Disco azucar\n13- Aqui el que baila gana\n14- Que sorpresa!\n\nDisc 2\n01- Que Tiene Van Van\n02- De La Habana a Matanzas\n03- Esto te pone la cabeza mala\n04- Soy todo\n05- Ni bombones ni caramelos\n06- Regresamelo todo\n07- Somos cubanos\n08- Permiso que llego Van Van\n09- La bomba soy yo\n10- Timpop con Birdland\n11- La buena\n12- El montuno\n\n\nArtwork and EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\nPastafariCubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:86993a52f64b62db92659a5418ed45878f6231f8","amp;dn":"Juan+Formell+%26+Los+Van+Van+-+Havana+Si%21+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86993a52f64b62db92659a5418ed45878f6231f8","infoHashBuffer":{"type":"Buffer","data":[134,153,58,82,246,75,98,219,146,101,154,84,24,237,69,135,143,98,49,248]},"announce":[],"urlList":[]}}