{"title":"Rudolf Steiner - 44 livres (Esoterisme.Meditation.Zen)","uid":13226073,"size":144524652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:87af8cb7ebe9147f66963774deed314c4ff1043e&amp;dn=Rudolf+Steiner+-+44+livres+%28Esoterisme.Meditation.Zen%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asperge","files":40,"time":1452866170,"description":"Philosophe et pédagogue autrichien, Rudolf Steiner est né le 27 février 1861 à Kraljevi´c (Croatie), et mort le 30 mars 1925 à Dornach, près de Bâle. Attiré dans sa jeunesse pas les œuvres de Goethe, il édite dans un premier temps les travaux scientifiques du poète. Après s'être installé à Weimar, il se penche sur l'édition classique des œuvres complètes du poète (publiées entre 1889 et 1896) et écrit parallèlement Die Philosophie der Freiheit (1894, La Philosophie de la liberté). Il part ensuite à Berlin pour devenir rédacteur en chef de la revue littéraire Magazin für Literatur et donner des conférences.\r\n\r\nSteiner en arrive peu à peu à croire en une perception spirituelle indépendante des sens et baptise le résultat de ses recherches anthroposophie. Cette doctrine repose sur la notion qu'il existe un monde spirituel que la pensée pure peut comprendre mais qui n'est accessible qu'aux facultés supérieures de la connaissance mentale. Steiner pense que l'homme participait autrefois plus pleinement aux processus spirituels du monde par une forme de conscience onirique qui s'est depuis réduite en raison de son attachement aux choses matérielles. Afin de percevoir à nouveau les choses spirituelles, il lui faut ainsi habituer sa conscience à s'élever et à se détacher de la matière. L'aptitude à atteindre cet objectif par un exercice de l'intellect est en théorie innée. Se détachant des théosophes, Steiner fonde la société anthroposophique en 1912.\r\n\r\nEn 1913, il construit à Dornach son premier Goetheanum, qu'il qualifie d'école de science spirituelle. Détruit par un incendie en 1922, le bâtiment est reconstruit. Steiner tire de ses expériences au Goetheanum une pédagogie nouvelle. Le mouvement Waldorf qui voit ainsi le jour regroupe en 1969 près de 80 écoles fréquentées par plus de 25 000 enfants en Europe et aux États-Unis. Les travaux de Steiner lui inspirent également la création d'écoles pour enfants déficients, d'un centre clinique et thérapeutique à Arlesheim (près de Bâle), de centres de recherche scientifique et mathématique ainsi que d'écoles de théâtre, d'élocution, de peinture et de sculpture. Steiner est l'auteur de plusieurs ouvrages de réflexion, tels que Theosophie (1904, Théosophie), Wie erlangt man Erkenntnisse der höheren Welten ? (1904, L'Initiation) et Die Geheimwissenschaft im Umriss (1913, La Science de l'occulte), ainsi que d'une autobiographie (1924).\r\n\r\nListe des livres:\r\n\r\nA propos de la relation juste avec l'anthroposophie\r\nAgriculture\r\nAnthroposophie\r\nAutobiographie 1\r\nAutobiographie 2\r\nChaleur et Matière\r\nChronique de l'Akasha\r\nChute et renaissance spirituelles\r\nConnaissance, logique, pensée pratique\r\nCréer à partir du néant\r\nDe Jésus au Christ\r\nDerrière le voile des Événements\r\nÊtres naturels et spirituels\r\nEveil au Contact du Moi d'Autrui\r\nExpériences Vécues par les Morts\r\nGoethe le Galilée de la Science du Vivant\r\nL'Apocalypse\r\nL'Evangile de Saint Jean\r\nL'Evangile de Saint Luc\r\nL'Evangile de saint Marc\r\nL'Evangile de Saint Matthieu\r\nLa Chute des Esprits des Ténèbres\r\nLa Liberté de Penser et les Mensonges de Notre Epoque\r\nLa pensée humaine et la pensée cosmique\r\nLa Vie entre la Mort et une nouvelle naissance\r\nLe Karma - Tome I\r\nLe Karma - Tome II\r\nLe Karma - Tome III\r\nLe Karma - Tome IV\r\nLe Karma - Tome V\r\nLe Karma - Tome VI\r\nLe seuil du Monde spirituel\r\nLeçons ésotériques Tome I\r\nLeçons ésotériques Tome II\r\nLeçons ésotériques Tome III\r\nLes Guides Spirituels de l'Homme et de l'Humanité\r\nLes Mystères\r\nLes Rapports avec les Morts\r\nLiberté des Idées et Forces Sociales\r\nPsychologie et Vie Intérieure\r\nScience du Ciel, Science de l'Homme\r\nSymptômes Dans l'Histoire\r\nThéosophie\r\nUn chemin vers la connaissance de soi","torrent":{"xt":"urn:btih:87af8cb7ebe9147f66963774deed314c4ff1043e","amp;dn":"Rudolf+Steiner+-+44+livres+%28Esoterisme.Meditation.Zen%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87af8cb7ebe9147f66963774deed314c4ff1043e","infoHashBuffer":{"type":"Buffer","data":[135,175,140,183,235,233,20,127,102,150,55,116,222,237,49,76,79,241,4,62]},"announce":[],"urlList":[]}}