{"title":"Sexually Broken-----Brutal Cock Sucking  Ash Hollywood Matt Will","uid":7514720,"size":708621421,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:87b58f37f819458fbf2eb103ebbb6352991842a0&amp;dn=Sexually+Broken-----Brutal+Cock+Sucking++Ash+Hollywood+Matt+Will&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1344439066,"description":"Brutal Cock Sucking Multiple Orgasms Category 5 | Ash Hollywood | Matt Williams\n\nAugust 6, 2012 \n \n   \nMP4 + Pics.  \n    \n \nAsh Hollywood is back for the second time here on Sexually Broken. This tiny sexy blonde is about to be tested to the edge of her her very limits. Gagging on cock, being fucked to multiple orgasms, her pussy vibrated to the point of mind screaming insanity, and suspended only by rope in the figure four hogtie.\n\nIf you don't follow this sexy girl on twitter, start! Her twitter feed is one of the most interesting feeds for any porn star today. Now let's take our hot little blonde and fuck her up. Again the bondage morphs, what starts as one thing become something incredibly intense by the end. Any one can just tie a girl into a Hogtie, it's the journey in the rope that matters. \n\nAsh starts bound to a table with her legs spread, and her arms back in a strappado. We start out with a rough skull fucking. A long brutal blow job that stresses Ash to the limit of her cock sucking skills. We love to punish girls with cock down their throats! Then we move behind, she is helpless, her pussy is wet, her legs spread wide and we slip the cock right up into her wet hole and fuck her good. There is nothing she can do about it but moan and cum and take it. \n\nWe hike her up on to the table and turn the bondage into a severe hogtie while vibrating Ash to multiple orgasms, the kind that wreck the brain and you have to beg for it to stop because it too much to handle, even for a porn star. These are real, never faked orgasms and most porn stars are completely overwhelmed by them. In the end we simply lift her off the ground, with only rope around her wrist and ankles, the suspension is brutally challenging and she suffers beautifully in it! \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_06ash2/SexuallyBroken-Ash-Hollywood-Matt-Williams-Brutal-Cock-Sucking-Multiple-Orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_06ash2/SexuallyBroken-Ash-Hollywood-Matt-Williams-Brutal-Cock-Sucking-Multiple-Orgasms.php&lt;/a&gt;\n\nAnd if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\nCheers  :-) \n\n","torrent":{"xt":"urn:btih:87b58f37f819458fbf2eb103ebbb6352991842a0","amp;dn":"Sexually+Broken-----Brutal+Cock+Sucking++Ash+Hollywood+Matt+Will","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87b58f37f819458fbf2eb103ebbb6352991842a0","infoHashBuffer":{"type":"Buffer","data":[135,181,143,55,248,25,69,143,191,46,177,3,235,187,99,82,153,24,66,160]},"announce":[],"urlList":[]}}