{"title":"Dexter - Temp.5 [HDTV][Cap.501][Spanish][www.nolesvotes.com].avi","uid":6371677,"size":640679936,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:884d07c186cfd3c11de72c3a1138aae88c1153bf&amp;dn=Dexter+-+Temp.5+%5BHDTV%5D%5BCap.501%5D%5BSpanish%5D%5Bwww.nolesvotes.com%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IBM00","files":1,"time":1304696997,"description":"a serie Dexter trata de precisamente Dexter, un forense especializado en anÃƒÂ¡lisis de salpicaduras de sangre (reconstrucciÃƒÂ³n de la escena del crimen) en el Departamento de PolicÃƒÂ­a de Miami. Dexter tambiÃƒÂ©n es un fiel novio, un divertido padrastro, un hermano confidente y un freak de la sangre para algunos. Pero ademÃƒÂ¡s, Dexter es un psicÃƒÂ³pata que al terminar su turno en la comisarÃƒÂ­a busca a criminales cuestionables para su particular moral y se deshace de ellos: Dexter es un asesino en serie. El ÃƒÂºnico que desde su infancia le conociÃƒÂ³ realmente fue su padre adoptivo, Harry Morgan, quien le dio la ÃƒÂ©tica y el modus operandi con el que lleva a cabo sus crÃƒÂ­menes, o su particular justicia: al darse cuenta de que el instinto asesino de su hijo era imposible de evitar, decidiÃƒÂ³ educarlo para sacar provecho de su \\&quot;personal\\&quot; habilidad y aportarle un cÃƒÂ³digo de actuaciÃƒÂ³n (el cÃƒÂ³digo de Harry) enfocado a perseguir y eliminar a aquellos asesinos que habÃƒÂ­an conseguido eludir la acciÃƒÂ³n de la Justicia. Dexter es una serie de la cadena estadounidense Showtime (televisiÃƒÂ³n) basada en la novela El Oscuro Pasajero (Darkly Dreaming Dexter) de Jeff Lindsay. AdemÃƒÂ¡s de la novela original se han publicado dos secuelas del personaje: Querido Dexter (Dearly Devoted Dexter) y Dexter in the Dark, pero la serie se basa sÃƒÂ³lo en la primera y en algunos puntos de la segunda.","torrent":{"xt":"urn:btih:884d07c186cfd3c11de72c3a1138aae88c1153bf","amp;dn":"Dexter+-+Temp.5+%5BHDTV%5D%5BCap.501%5D%5BSpanish%5D%5Bwww.nolesvotes.com%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"884d07c186cfd3c11de72c3a1138aae88c1153bf","infoHashBuffer":{"type":"Buffer","data":[136,77,7,193,134,207,211,193,29,231,44,58,17,56,170,232,140,17,83,191]},"announce":[],"urlList":[]}}