{"title":"Zanotti Sorkine - Un Coeur de Feu (Homélies)","uid":13942621,"size":1800929688,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:888013508d62ab314ac4514b9580e6f312886f25&amp;dn=Zanotti+Sorkine+-+Un+Coeur+de+Feu+%28Hom%26eacute%3Blies%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Spud17","files":130,"time":1458477517,"description":"On rapporte que le père Lacordaire commença l'une de ses célèbres prédications par cette apostrophe : &quot;Mes frères je vous apporte le bonheur !&quot;\r\nLe père Michel-Marie Zanotti-Sorkine, par son art oratoire mis au service de l'éloquence sacrée, nous offre à son tour et à sa façon, ce même bonheur que procure la joie d'écouter l'Évangile. Les formes variées de sa voix si chaleureuse sont étonnantes et donnent un éclat saisissant au contenu finement ciselé de ses homélies. Certaines prédications ont un ton éclatant qui fascine, d'autres ont des accents très évocateurs qui restituent pleinement la réalité évangélique.\r\nCertaines font naître un vrai coeur à coeur avec le Christ, d'autres plus narratives captent et ravissent l'attention. Sans oublier l'émouvante intensité de ces conversations fulgurantes que le père Zanotti-Sorkine instaure avec Jésus et Marie ! En écoutant ces homélies, on comprend parfaitement que le pape François puisse écrire que la prédication est &quot;le moment le plus élevé du dialogue entre Dieu et son peuple&quot;, et que le prédicateur a la mission de le faire sentir notamment &quot;par la proximité de coeur, la chaleur de son ton de voix, la douceur du style de ses phrases&quot;. Sur le difficile mais exaltant chemin de la foi, le père Zanotti- Sorkine est un incomparable compagnon de route. Écoutez-le. d'autant plus que &quot;la foi naît de ce que l'on entend ; et ce que l'on entend, c'est la parole du Christ&quot; &quot;!","torrent":{"xt":"urn:btih:888013508d62ab314ac4514b9580e6f312886f25","amp;dn":"Zanotti+Sorkine+-+Un+Coeur+de+Feu+%28Hom%26eacute%3Blies%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"888013508d62ab314ac4514b9580e6f312886f25","infoHashBuffer":{"type":"Buffer","data":[136,128,19,80,141,98,171,49,74,196,81,75,149,128,230,243,18,136,111,37]},"announce":[],"urlList":[]}}