{"title":"Disney Movie - Charlie, the Lonesome Cougar (1967)","uid":4512345,"size":1047152731,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:89716d3c131f98e989900dd835cbbf01eb2183e3&amp;dn=Disney+Movie+-+Charlie%2C+the+Lonesome+Cougar+%281967%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cowboy23","files":4,"time":1226835718,"description":"Released to theaters the fall after Walt Disney&amp;#039;s death, Charlie, the Lonesome Cougar was the Disney studio&amp;#039;s first film without Walt&amp;#039;s direct involvement. Yet, the film remains true to Walt&amp;#039;s spirit, since Charlie is so clearly in the vein of his &quot;True Life Adventures&quot; series of nature films.\n\nAt the same time, this makes the film markedly different from the types of live action films the studio was releasing at the time, as it lacks the humor and humans of the light family comedies. And though animals figured so heavily in a number of Disney films, here the focus is more about observing natural behavior and less about their playful cuteness.\n\nSet in America&amp;#039;s scenic Northwest, Charlie follows the development of a cougar, from his orphaned youth. The cougar is discovered by Jess Bradley (Ron Brown), a woodsman and bachelor who takes in the animal and names him &quot;Good Time Charlie.&quot; From this young age, Charlie is domesticated, but the cougar still sets out on a number of adventures, which are documented here.\n\nAs a young orphaned cougar, Charlie is taken in and nursed. Jess Bradley, the man who takes in Charlie.\n\nOut in the wild, Charlie shares a nap with a black bear and then, from the safety of a tree, he watches a bear-to-bear duel ensue. For his meals, though, Charlie relies on the kindness of Potlatch (Brian Russell), a cook whose dog Chainsaw tries and often succeeds at outwitting the cougar.\n\nAnother encounter has Charlie threatened on a log travelling downstream, with Jess trying to come to the rescue. Charlie&amp;#039;s adventures require Jess to cook dinner for the foresting crew, a position that becomes his for the time being.\n\nAt all times, the focus remains on Charlie as the film features the cougar and other animals getting into mayhem, with barely-defined human characters as merely background elements. There are situations of mild peril, but none too exciting, with Charlie&amp;#039;s growth being the thin thread which serves to tie it all together. Still, the episodic nature of the film is undeniable; the film is less a story about Charlie than a montage of some of his outdoor escapades.\n\nThere&amp;#039;s some comic relief such as when Charlie competes in an improptu log-rolling contest with the logging boys. But for the most part, the film maintains an austere face, brightened only by Rex Allen&amp;#039;s stately narration and an active score which alternates between playful and dramatic.\n\nCharlie snuggles with a bear. Jess is now a cook, and Charlie&amp;#039;s got him in a mess!\n\nSeasons change and Charlie grows into a fierce creature. By the film&amp;#039;s final scenes (which, with the short running time, is less than an hour in), we start the sharp transformation. Having endured lessons from his new cougar playmate, Miss Patty Paws, and others he encounters, Charlie finally understands how to be a wildcat and hunt for himself.\n\nThe climactic adventure one night has Charlie getting locked into the storage closet at the very dining quarters where good ole&amp;#039; Potlatch used to feed the cougar. The logging crew that used to play around with Charlie is now trying to catch the animal, with some even reaching for guns. Only Jess can hope to reason with his pal, but after Charlie reaches safety, Jess decides that a wildlife refuge is the best place for the cougar.\n\nThough Charlie, the Lonesome Cougar is released as such, it&amp;#039;s tough to view it as a Disney feature film. It doesn&amp;#039;t really work as a feature film, but as a hybrid of nature documentary and scripted drama, Charlie remains engaging and with a type of charm that made the basis of Walt&amp;#039;s &quot;True Life Adventures&quot; series. With a supporting cast of flat human performances, the real star is the cougar and the nature of the Pacific Northwest, and those who are fascinated by either will find this a rewarding experience.","torrent":{"xt":"urn:btih:89716d3c131f98e989900dd835cbbf01eb2183e3","amp;dn":"Disney+Movie+-+Charlie%2C+the+Lonesome+Cougar+%281967%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89716d3c131f98e989900dd835cbbf01eb2183e3","infoHashBuffer":{"type":"Buffer","data":[137,113,109,60,19,31,152,233,137,144,13,216,53,203,191,1,235,33,131,227]},"announce":[],"urlList":[]}}