{"title":"Udemy - Intro to Brainstorming &amp; Creative Thinking","uid":12160346,"size":721082228,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8a6ed7fe01126f17e95634ece2be7576bec82bce&amp;dn=Udemy+-+Intro+to+Brainstorming+%26amp%3B+Creative+Thinking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NepsterJay","files":9,"time":1437892448,"description":"This course is a basic overview of creative thinking and brainstorming. The course starts with a brief history of the study of creativity and some background into the inception of brainstorming. It also takes a critical look at the potential negatives of group thinking and discusses ways to minimize those in your thinking sessions. The course outlines a series of best practices for planning, facilitating and capturing the ideas from a creative thinking session, as well as several easy-to-implement brainstorm methods that will encourage new and different thinking. The course features 7 different video lectures that are supported by 4 information-packed, downloadable presentations. Overall, this class should take about 1-1.5 hours of watching time, as well as a few hours of prep time to prepare for your brainstorm.\n\nWhat are the requirements?\n\nA basic of the concept of brainstorming\nAn interest in applying creative thinking and brainstorming tools to your school, organization or business.\nThe ability to facilitate or find someone to facilitate your brainstorm meetings.\nWhat am I going to get from this course?\n\nOver 13 lectures and 2.5 hours of content!\nIn this course, you will gain a better understanding of creative thinking and brainstorming\nYou will learn the basics of meeting facilitation\nYou will learn multiple brainstorm methods to encourage new and different thinking\nBy the end of this course you will be able to plan and host a successful brainstorm\nWhat is the target audience?\n\nThis course is for anyone who is interested in spurring creative thinking within their school, organization or business. It offers simple, practical advice on how to improve your creative thinking and brainstorming skills\nBusiness professionals interested in professional development of their creative thinking skills","torrent":{"xt":"urn:btih:8a6ed7fe01126f17e95634ece2be7576bec82bce","amp;dn":"Udemy+-+Intro+to+Brainstorming+%26amp%3B+Creative+Thinking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a6ed7fe01126f17e95634ece2be7576bec82bce","infoHashBuffer":{"type":"Buffer","data":[138,110,215,254,1,18,111,23,233,86,52,236,226,190,117,118,190,200,43,206]},"announce":[],"urlList":[]}}