{"title":"Chariots of Fire (1981) English subs [H264]","uid":4234841,"size":936840977,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8a8dad1ba624fa6d2ac8b981ba58617e939284b0&amp;dn=Chariots+of+Fire+%281981%29+English+subs+%5BH264%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pakmenu","files":3,"time":1213247360,"description":"Encoded in H264 (=mpeg4-10 AVC), for 20% smaller file for same quality quality!\nNB: if you download without uploading atleast 100%\nyou are denying the next person to watch this movie!\nsome people seem to be too afraid to upload...\nremember it it more blessed to give then to receive!\n\nInfo:\n\nDVD9rip using DVD decrypter 3.5.4.0 from 720x480 NTSC DVD9\nWriting application  : MediaCoder 0.6 (soundforge open source)\n\nPlayTime: 2hr 03mn  File size: 893 MiB  TotalBitrate: 1000 Kbps\nVideoCodec: H264  Constant Quality (50) VBR\nDimentions: 854 x 480 pixels  Aspect ratio: 16/9\nFramerate: 29.970 fps progressive  Bitrate: 931 Kbps\nAudioCodec: mp3 Bitrate: 55 Kbps Joint stereo VBR\nSampling rate: 24 KHz Resolution: 16 bits\n\nLanguage: English Subtitles: English SRT retimed by hand using Jubler\n\nto open subs:\nMedia Plater Classic: Automatic\nusing ffdshow: video decoder settings: tick &amp;#039;subtitles&amp;#039;\nusing VLC: open VLC, choose file- open file (instead of quick open file)\ntick &amp;#039;use a subtitle file&amp;#039;...   Enjoy!\n\nIMDB: http://www.imdb.com/title/tt0082158/\n\nReviews: (3 out of 16 PAGES worth... wow...) \nNotice that indeed the movie starts slow, but finishing it is definately worth it.\n\n--------------------------------------------------------\n\nThis is one of the Oscar best pictures that actually deserved the honor., 18 February 2001\n10/10 Author: gachronicled from USA\n\nI happened to be flipping channels today and saw this was on. Since it had been several years since I last saw it I clicked it on, but \n\ndidn&amp;#039;t mean to stay. As it happened, I found this film to be just as gripping now as it was before. My own kids started watching it, too, \n\nand enjoyed it - which was even more satisfying for me considering the kind of current junk they&amp;#039;re used to. No, this is not an action-\n\npacked thriller, nor are there juicy love scenes between Abrahams and his actress girlfriend. There is no &quot;colorful&quot; language to speak of; \n\nno politically correct agenda underlying its tale of a Cambridge Jew and Scottish Christian.\n\nThis is a story about what drives people internally - what pushes them to excel or at least to make the attempt to do so. It is a story \n\nabout personal and societal values, loyalty, faith, desire to be accepted in society and healthy competition without the utter selfishness \n\nthat characterizes so much of the athletic endeavors of our day. Certainly the characters are not alike in their motivation, but the end \n\nresult is the same as far as their accomplishments.\n\nMy early adolescent son (whose favorite movies are all of the Star Wars movies and The Matrix) couldn&amp;#039;t stop asking questions throughout \n\nthe movie he was so hooked. It was a great educational opportunity as well as entertainment. If you&amp;#039;ve never seen this film or it&amp;#039;s been a \n\nlong time, I recommend it unabashedly, regardless of the labels many have tried to give it for being slow-paced or causing boredom. In \n\naddition to the great story - based on real people and events - the photography and the music are fabulous and moving. It&amp;#039;s no mistake that \n\nthis movie has been spoofed and otherwise stolen from in the last twenty years - it&amp;#039;s an unforgettable movie and in my opinion its bashers \n\nare those who hate Oscar winners on principle or who don&amp;#039;t like the philosophies espoused by its protagonists. \n\n--------------------------------------------------------\n\nIt IS A Big Deal, In More Ways Than One, 2 November 2005\n9/10 Author: ccthemovieman-1 from Lockport, NY, United States\n\nI had never seen this movie until the fall of 1997 and after watching 40 minutes wondered, &quot;What&amp;#039;s the big deal?&quot;\n\nWell, the second half of the film and then subsequent viewings have done more than just answer my question.\n\nIt&amp;#039;s one of the RARE movies in the past 30 years which portrays a Christian in a positive light. Ian Charleson does a convincing job of \n\nportraying a 100 percent sincerely good man who walks the talk.\n\nIn here is also a good portrayal of a Jewish man, a student at Cambridge, acted well by Ben Cross. This man is too defensive about being \n\nJewish and carries a chip on his shoulder until the end where he comes out a hero and a fine man as well, the bitterness gone.\n\nThe story of those two men and their quest for a gold medal at the 1924 Olympics in France makes for an inspiring film. It&amp;#039;s also aided by \n\nvery nice photography and a wonderful score by Vangelis. A recently-issued widescreen DVD finally shows off the award-winning \n\ncinematography. The feel- good ending doesn&amp;#039;t hurt, either, especially since these main characters were real-life people.\n\nHer extraordinary beauty made Alice Krige an interesting person to watch in the film, and I wonder why she never made it as a &quot;big-name&quot; \n\nactress. Perhaps that was her decision.\n\nIn summary, a very classy film, that still lives up to its reputation.\n\n--------------------------------------------------------\n\nTruly an outstanding film., 26 January 2003\n9/10 Author: Julie-30 from New York City\n\nI beg to differ with several previous reviewers. This film is neither bland nor is it solely about professionalism vs. amateurism.\n\nThis film is about what drives people to do what they do. Eric Liddell (Ian Charleson) runs for the glory of God, whereas Harold Abrahams \n\n(Ben Cross) runs to prove his worth to a society that was anti-Semitic. Even though they run for different reasons, their drive and \n\ndetermination spur them on. They stand up for what they believe in and refuse to sacrifice their principles because it is the easy way out.\n\nThe supporting cast is also extraordinary, with Nigel Havers, Nicholas Farrell, Ian Holm and Sir John Gielgud all making important \n\ncontributions to the final product.\n\nThere is absolutely nothing unnecessary in this film. The writing, the direction, the acting, the dialogue are all outstanding. And then \n\nthere&amp;#039;s that haunting score.\n\nOnce again, this is truly an outstanding film. One with universal themes that transcend time and place.  \n\n--------------------------------------------------------","torrent":{"xt":"urn:btih:8a8dad1ba624fa6d2ac8b981ba58617e939284b0","amp;dn":"Chariots+of+Fire+%281981%29+English+subs+%5BH264%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a8dad1ba624fa6d2ac8b981ba58617e939284b0","infoHashBuffer":{"type":"Buffer","data":[138,141,173,27,166,36,250,109,42,200,185,129,186,88,97,126,147,146,132,176]},"announce":[],"urlList":[]}}