{"title":"Treasures of the Tower and the Secret Garden","uid":8346970,"size":8132919550,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8aeb9809fc90b81c96209c430d1cc3e2e7ba1e57&amp;dn=Treasures+of+the+Tower+and+the+Secret+Garden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"GoAaT999","files":8,"time":1365235976,"description":" This workshop contains some of the most detailed and profound information that has been released so far in contemporary times but at the same time is refreshingly inter-connected with the information that has been presented previously in both Keylontic Science and Kathara workshops. The first lecture in this workshop covers important information on the nature of the Star-Fire Cycle and an orientation of the structures and events that are involved, including the Jhardon of Edon, The Tauren Light unit, the Eternal Lotus Seed, the &quot;encryption&quot; process and the Ta-KE-yon Cycle. Information is given on the structures within our Ecka-Veca Universe that are intricately involved in the Star-Fire process and the 'anatomical' relationships between the Outer Ecka-Veca, Eckasha, Eckasha-A and Eckasha-Aah Worlds and those of the Middle Domains and Inner Hub Worlds.\n\nThese relationships are explored in depth as the workshop progresses allowing us a deep understanding of our role in this Star-Fire process here in Density One. After the general anatomical over-view, new and detailed information is given on the &quot;Bones and Balls&quot; of the Hub Worlds and how they connect to the Ethos-Eiros Etheric templates (introduced in Mexico 2004) and the Hova and Radial Bodies.  In order to deepen our understanding of the &quot;Encryption&quot; process inherent to the Star-Fire Cycle, detailed information is also given on the role of 'encryption' in the very first Creation Cells and the mechanisms of repeated cycles of expansion and contraction according to the Krist code held in a 'hydro-gellasic form of 'encryption'.\n\nThis is the first workshop to explore in depth the difference between Creation (at all levels) as governed by the Krist code and Creation as governed by the metatronic code and is clearly demonstrated by illustrations of the Eternal Life Crystal Spirals and the finite-life Metatronic Spiral (derived from the Golden Mean). The First creational Sound Tones are explored to an even deeper level than in Kathara Level-4 in the context of this First Creation process and are also put into context more clearly with respect to the origins of certain words in our language including, 'intention' and 'electricity'. For the Universal-mechanics-minded, this workshop is also full of information on the Budhara Black Hole controlled Gravitron and it effects on our Universe, in particular our Earth's tilted axes, Earth's Electro-static harness Sho-na Field (exemplified by the Tube Torus) and the progressively increasing psycho-tronic pulses which are being inflicted on Earth's populations as planned and directed by the Fallen Angelic Final Conflict &quot;Atlantean Protocols&quot;.\n\nAlthough more history of our Universe and the events that have lead up to this Star-Fire Cycle will be given in future workshops, there is new information on the Fallen Angelic Group called the Thetans and their role in the Gaian-Orian Wars and the creation of the Twisted Tauren. Finally, the technique &quot;Restoration of the Tauren&quot; heralds the close of this wonderfully informative and exciting workshop.","torrent":{"xt":"urn:btih:8aeb9809fc90b81c96209c430d1cc3e2e7ba1e57","amp;dn":"Treasures+of+the+Tower+and+the+Secret+Garden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aeb9809fc90b81c96209c430d1cc3e2e7ba1e57","infoHashBuffer":{"type":"Buffer","data":[138,235,152,9,252,144,184,28,150,32,156,67,13,28,195,226,231,186,30,87]},"announce":[],"urlList":[]}}