{"title":"In The Bleak Midwinter - Kenneth Branagh","uid":7859807,"size":1585847410,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8bf018670e81ebab5b991adfef1cd3f22fb5246c&amp;dn=In+The+Bleak+Midwinter+-+Kenneth+Branagh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"deepee100","files":1,"time":1353893123,"description":"Out of work actor Joe volunteers to help try and save his sister's local church for the community by putting on a Christmas production of Hamlet, somewhat against the advice of his agent Margaretta. As the cast he assembles are still available even at Christmas and are prepared to do it on a 'profit sharing' basis (that is, they may not get paid anything) he cannot expect - and does not get - the cream of the cream. But although they all bring their own problems and foibles along, something bigger starts to emerge in the perhaps aptly named village of Hope. Written by Jeremy Perkins {J-26}\n\nAn out-of-work actor on the verge of a nervous break-down decides to put on a production of Hamlet in a church. At Christmas. Despite admonitions from his agent and sister about the career suicide he's about to commit by investing in such a morbid play over the holidays, he pushes on to realize his goal. Faced with a series of challenges and cast of misfits and oddballs, the troupe crawl towards opening night, discovering love, laughter, and friends along the way. Written by J. Lake ","torrent":{"xt":"urn:btih:8bf018670e81ebab5b991adfef1cd3f22fb5246c","amp;dn":"In+The+Bleak+Midwinter+-+Kenneth+Branagh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bf018670e81ebab5b991adfef1cd3f22fb5246c","infoHashBuffer":{"type":"Buffer","data":[139,240,24,103,14,129,235,171,91,153,26,223,239,28,211,242,47,181,36,108]},"announce":[],"urlList":[]}}