{"title":"VOX 0.37.2 (ALPHA)","uid":8810844,"size":36091436,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8c2335d828d3fcaea77735e66c41da31d3ae17f4&amp;dn=VOX+0.37.2+%28ALPHA%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prototype.06","files":-1,"time":1376453706,"description":"This is: VOX 0.37.2 (ALPHA)\n\nEver since Minecraft's success we got voxel graphics all over the place! Cube World, Block Story, Block World, and now you can throw VOX into that pot. Not a bad thing, though! From what I went through VOX is a pretty cool game for being in the alpha state... and the graphics are amazing! Check it if interested. I'll upload new versions as they come.\n--------------------------------------\n\nDescription:\nA voxel based adventure and RPG. Vox is a highly customizable game where you can create, destroy, edit and build anything you desire. The whole world, every item and object within it, and even the characters and inhabitants of Vox are created using a custom 'Voxel Engine' that allows for an unparalleled level of creativity.\nCome and explore your imagination!\n\nPlayers can create their own custom characters, weapons, items, monsters, NPCs and everything else in the game. Since everything in the game is made up of voxels, everything can be edited and customized using the same interface. The editors and tools that allow for creation of voxel objects and sprites are part of the game and built into the gameplay of the game. This allows Vox to go one step further than other voxel based games, that only allow modification to the voxel world. \n\n&quot;NOTE: This game is not a clone/ripoff of Minecraft, Cube World, InfiniMiner or any other voxel based game. It is an original game being developed using the voxel/block style of rendering and features some voxel/block based gameplay.&quot;\n\nMinimum Requirements:\nOS : Windows XP \nProcessor: 1.6 Ghz \nMemory : 1GB RAM \nGraphics : DX9.0c compatible graphics card, capable of running shaders. \nDirectX : 9.0c or Greater \n\n\n--------------------------------------\n*Absolutely 100% clean and working!*\n*My upload ain't the best, but I'll seed this forever!*\n*BUY the games you reallllly dig!!!*","torrent":{"xt":"urn:btih:8c2335d828d3fcaea77735e66c41da31d3ae17f4","amp;dn":"VOX+0.37.2+%28ALPHA%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c2335d828d3fcaea77735e66c41da31d3ae17f4","infoHashBuffer":{"type":"Buffer","data":[140,35,53,216,40,211,252,174,167,119,53,230,108,65,218,49,211,174,23,244]},"announce":[],"urlList":[]}}