{"title":"FIXED - Eric Clapton - Lost Polydor Tapes CD1 FLAC","uid":4839007,"size":547437403,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8c6b3dd3fdbe80f2d39dca701b03b1a2a0355692&amp;dn=FIXED+-+Eric+Clapton+-+Lost+Polydor+Tapes+CD1+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hubdubbie","files":25,"time":1239432590,"description":"FIXED: This is CD1 of the Lost Polydor Tapes... But first, we must digress:\nChuck from GA said (about the 2006 EC Deluxe 2-CD release):\n&quot;I loved &quot;Eric Clapton&quot; and literally wore the grooves out. So, several years later I tossed my copy of &quot;Eric Clapton&quot; in the garbage and purchased a brand new copy.\nImagine my surprise when I put the needle down on the first track and heard a completely different mix of the song Slunky. In the version I had previosuly owned, and there was no opening sax solo. The mix just established a backing groove that continued up until the guitar solo. Then, I heard this overwrought, breathy vocal on Bad Boy that was completely different from the version I had tossed. The previous mix featured a vocal that I'd compare to Eric's more relaxed approach in Let it Rain. Reading the liner notes in this new Deluxe Edition, I guess these were Eric's own mixes, not Delaney's. But they were released, because I owned them. I have always hoped to once again own these mixes.&quot;\n\n(Also referring to the 2006 Deluxe release) James in IL wrote:\nI happen to own the vinyl of &quot;Eric Clapton&quot; - The Delaney Bramlett mix (as it is now known). When I first bought the album,imagine my surprise to find all my friends' copies sounded totally different! I was thrilled to read it was FINALLY coming out on cd. I rush out to buy it, put on disc 2 and behold ----- IT'S NOT THE DELANEY BRAMLETT MIX!!!! I burned my album to cd some time ago, &amp; you play them back to back --THEY\nARE TOTALLY DIFFERENT RECORDS! My copy has a different mix, different vocal on &quot;Bad Boy&quot;, a Leon Russell intro (singing &amp; playing)on &quot;Blues Power&quot;, and other intros.\n\nHERE IT IS - For Chuck, James, Paul, Spook, me and all those who had the original pressing of the album, here's that Clapton album (plus more) in FLAC format, Disc 1 from the Lost Polydor Tapes. The first 11 tracks(101 to 111) make up the early original release. These tracks are labeled as Delaney mixes, but it's more likely these were Eric's rough mixes, which were hurriedly pressed, but were rejected by the record label. Delaney had mixed his own, which are disc 2 of the EC Deluxe Edition referred\nto above by Chuck &amp; James. The Tom Dowd mixes were the official release, except After Midnight, which is the Delaney mix, and Easy Now, which is the Clapton mix. I inserted Easy Now to make the original pressing complete, so now, the sum total may or may not fit on one\nCD. I only used 101-111 and I'm ecstatic! The tracks are approximately as follows:\n\nDisc 1:\n101. Slunky (*)\n102. Bad Boy (*)\n103. Lonesome And A Long Way From Home (*)\n104. After Midnight (*)\n105. Easy Now (*)\n106. Blues Power (*)\n107. Bottle Of Red Wine (*)\n108. Lovin' You Lovin' Me (*)\n109. Told You For The Last Time (*)\n110. Don't Know Why (*)\n111. Let It Rain (*)\n11. Bad Boy (#)\n12. Lonesome And A Long Way From Home (#)\n13. After Midnight (#)\n14. Blues Power (#)\n15. Don't Know Why (#)\n16. After Midnight (^)\n17. Blues Power (^)\n18. Bad Boy (^)\n19. Lovin' You Lovin' Me (^)\n20. Told You For The Last Time (^)\n21. Bad Boy (^)\n\nKeys:\n(*): &quot;Delaney Bramlett&quot; mix, which were most likely the Clapton mixes of the original pressing\n(#): original long version\n(^): alternate mix\n\nCover art included.\n\nNote: The only variance from my recollection is the reverse echo at the start of Slunky. It's shorter here than I remember it. (Polydor messed with it?)\n\nThis is my first fixed upload, folks, so positive suggestions will be appreciated! Music identical to previous one. Txt file fixed, I think.\n\nAs usual, seed like there's no tomorrow, peeps!!!","torrent":{"xt":"urn:btih:8c6b3dd3fdbe80f2d39dca701b03b1a2a0355692","amp;dn":"FIXED+-+Eric+Clapton+-+Lost+Polydor+Tapes+CD1+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c6b3dd3fdbe80f2d39dca701b03b1a2a0355692","infoHashBuffer":{"type":"Buffer","data":[140,107,61,211,253,190,128,242,211,157,202,112,27,3,177,162,160,53,86,146]},"announce":[],"urlList":[]}}