{"title":"Minder  S05 1984","uid":6376544,"size":1698921472,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8ca3c9d17302469c4d31f9812975f0350df76457&amp;dn=Minder++S05+1984&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"OLDLIMEY4","files":8,"time":1304877444,"description":"eries - Autumn 1984\n\n050. Goodbye Sailor - 05-Sep-84\n\nMoray Watson, Ray Winstone, Rashid Karpiet\n\nArthur, Terry and Arnie visit the seaside and somehow get involved with an illicit supply of tobacco.\n\nClassic line from Ray Winstone in this episode: \\&quot;Look out! It\\'s the river filth!\\&quot;\n\t\n\n051. What Makes Shammy Run? - 12-Sep-84\n\nArt Malik, Madhav Sharna\n\nChisholm has Arthur and Terry as prime suspects when a counterfeit 20 pound note surfaces at the Winchester Club.\n\t\n052. A Number of Old Wives Tales - 19-Sep-84\n\nPatrick Mower, Vivienne Ritchie, Sue Holderness, Kate Williams, Belinda Sinclair\n\n\\&quot;Confident\\&quot; and charming Clive Cosgrove (played by Patrick Mower) asks Terry to be the best man and Arthur to give the bride away at his up and coming wedding. When the brides\\' drunken ex-husband turns up, the wedding makes front page news. All the media publicity soon exposes Cosgrove as a multiple bigamist, with each of his wives soon realising they have been deceived several times over.\n\nKeep an eye out in this episode for the late Gary Holden (aka Wayne Norris from \\'Auf Wiedersehen Pet\\') as Barry, and DC Jones\\' tactful approach to describing how \\'Confident\\' Colin Cosgrove really is. 053. The Second Time Around - 26-Sep-84\n\nBeryl Reid, John Landry, Bill Maynard\n\nTerry is hired to look after an alcoholic romance novelist.\n054. Second Hand Pose - 03-Oct-84\n\nBilly Murray, Stacy Dorning, Johnny Shannan\n\nTerry decides to call it quits and find a new employer after Arthur accidentally locks him in a cold storage room. Unfortunately Terry takes on more trouble than he thought when he realises the furniture he is moving is from the wrong flat due to a mix up with keys - his new employer didn\\'t seem to care though and Rycott is fast on his tail.\n\nThe first of two appearances in Minder from Billy Murray, who had previously appeared alongside Dennis Waterman in the classic series 1 episode of The Sweeney called \\'Stoppo Driver\\'.  He also appears in episode 71 \\'Fiddler On The Hoof\\'. Billy Murray is probably most famous for his role as corrupt ex-copper Don Beech in the \\'The Bill\\' and as Johnny Allen in \\'Eastenders\\'.\n\t\n055. The Long Ride Back to Scratchwood - 10-Oct-84\n\nMark Farmer, Peter Needham, Nicolas Cargin\n\nArthur tries to buy 2000 tickets to the England/ Scotland soccer match for 18,000 pounds that he figures he can scalp for 50,000. 056. Hypnotizing Rita - 17-Oct-84\n\nDonald Sumpter, Nicola Cowper, Ray Burdis\n\nArthur takes over a cleaning business in order to pay off an old debt. 057. Balance of Power - 31-Oct-84\n\nCaroline Langshire, Alex McAvey\n\tAfter problems with the land the lockup sits on, Arthur decides to stand in a local election with Terry as his campaign manager, Chisolm does all he can to ensure that Arthur is not allowed to rustle up any local support.\n\nThis episode sees more classic banter between Arthur and Chisolm, as well as door to door campaigning. Who can forget the classic \\'Vote Arthur Daley - Your Independent Candidate\\' ? Truly classic Minder.\n058. Around the Corner - 26-Dec-84 - Christmas Special 1984\n\nColin Farrell, Brian Capron, Jeff Pirie, Tony Caunter\n\nArthur ends up in a spot of bother when a deal involving some dodgy video recorders with Tasty Tim from the Winchester Club goes very wrong. Chisolm and Rycott are both hearing whispers about the deal from somwhere and are hot on Arthur\\'s trail. Things are not helped along much when Arthur\\'s latest idea, a greyhound called \\'Daley\\'s Deal\\' just won\\'t run anywhere. When Arthur loses a pile of money, it seems the only one who can get it back is Terry.\nThis episode was originally transmitted as a Christmas Special and is unique as it one of the few times Chisolm, Rycott, Jones and Melish all feature in the same storyline. Brian Capron is more famous on television for his roles as Mr Hopwood in \\'Grange Hill\\', Murray McCoy in \\'Full House\\' and more recently as Richard Hillman in \\'Coronation Street\\'. This episo","torrent":{"xt":"urn:btih:8ca3c9d17302469c4d31f9812975f0350df76457","amp;dn":"Minder++S05+1984","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ca3c9d17302469c4d31f9812975f0350df76457","infoHashBuffer":{"type":"Buffer","data":[140,163,201,209,115,2,70,156,77,49,249,129,41,117,240,53,13,247,100,87]},"announce":[],"urlList":[]}}