{"title":"IMS: A Development and Deployment Perspective","uid":5149536,"size":3541083,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d03f2db91d937d36a9fec4451364b2270e9822b&amp;dn=IMS%3A+A+Development+and+Deployment+Perspective&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1257472796,"description":"Providing an holistic approach to IMS technologies, IMS: A Development and Deployment Perspective explores service architecture for development and delivery of IMS services. Approaching IMS from the perspective of the user and the service provider it examines both the current state of deployment and future trends. The book offers a realistic view of IMS deployment to operators and service providers, giving practical examples, application cases and business models. It also presents IMS deployment strategies based on real-life deployment statistics from a live IMS test bed connected to an operator network and proof-of-concept applications including inter-operability trials and results.\n\nFocusing on IMS potential in terms of service creation, service composition and service provision the book discusses the ability of IMS to act not only as a service delivery framework, but also as a service integration framework. It presents the possible future of IMS in terms of convergence with Internet services, including discussions about integration with web technologies including the WIMS 2.0 initiative. The book enables a better understanding of how web technologies can complement the IMS service architecture and pioneer the post-IMS progress and success.\n\n* Presents a novel service-oriented approach to IMS services and applications from a deployment perspective \n* Places IMS in the context of the current telecom environment providing business models through WIMS 2.0 initiative\n* Predicts the trends and potential future for the IMS evolution\n* Provides a technical foundation to IMS principles and architecture\n* Gives examples and solutions to the challenges of service creation and implementation and analyses deployment hurdles and interoperability trials\n* Describes trends of convergence based on IMS and Web technologies ","torrent":{"xt":"urn:btih:8d03f2db91d937d36a9fec4451364b2270e9822b","amp;dn":"IMS%3A+A+Development+and+Deployment+Perspective","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d03f2db91d937d36a9fec4451364b2270e9822b","infoHashBuffer":{"type":"Buffer","data":[141,3,242,219,145,217,55,211,106,159,236,68,81,54,75,34,112,233,130,43]},"announce":[],"urlList":[]}}