{"title":"Bruce Hood - The Self Illusion: How the Social Brain Creates Ide","uid":7590747,"size":702260,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d076d21e33a449f876879bd2751eee941ff242a&amp;dn=Bruce+Hood+-+The+Self+Illusion%3A+How+the+Social+Brain+Creates+Ide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"L29Ah","files":-1,"time":1346533046,"description":"Liberated from what.cd.\n\n\nDescription from amazon.com:\n\nMost of us believe that we are an independent, coherent self--an individual inside our head who thinks, watches, wonders, dreams, and makes plans for the future. This sense of our self may seem incredibly real but a wealth of recent scientific evidence reveals that it is not what it seems--it is all an illusion.\n\nIn The Self Illusion, Bruce Hood reveals how the self emerges during childhood and how the architecture of the developing brain enables us to become social animals dependent on each other. Humans spend proportionally the greatest amount of time in childhood compared to any other animal. It's not only to learn from others, Hood notes, but also to learn to become like others. We learn to become our self. Even as adults we are continually developing and elaborating this story, learning to become different selves in different situations--the work self, the home self, the parent self. Moreover, Hood shows that this already fluid process--the construction of self--has dramatically changed in recent years. Social networking activities--such as blogging, Facebook, LinkedIn, and Twitter--are fast becoming socialization on steroids. The speed and ease at which we can form alliances and relationships are outstripping the same selection processes that shaped our self prior to the internet era. Things will never be the same again in the online social world. Hood offers our first glimpse into this unchartered territory.\n\nWho we are is, in short, a story of our self--a narrative that our brain creates. Like the science fiction movie, we are living in a matrix that is our mind. But Hood concludes that though the self is an illusion, it is an illusion we must continue to embrace to live happily in human society.","torrent":{"xt":"urn:btih:8d076d21e33a449f876879bd2751eee941ff242a","amp;dn":"Bruce+Hood+-+The+Self+Illusion%3A+How+the+Social+Brain+Creates+Ide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d076d21e33a449f876879bd2751eee941ff242a","infoHashBuffer":{"type":"Buffer","data":[141,7,109,33,227,58,68,159,135,104,121,189,39,81,238,233,65,255,36,42]},"announce":[],"urlList":[]}}