{"title":"Lena Matthijs - En bror för en syster - Svensk","uid":14683226,"size":295540513,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8d18ab27ecc1cb5efb5b940711848145e31783de&amp;dn=Lena+Matthijs+-+En+bror+f%26ouml%3Br+en+syster+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"totomas1","files":123,"time":1464110099,"description":"Lena Matthijs – En bror för en syster\r\n\r\nEn kall marsnatt slutar en biljakt med att polisen prejar en röd sportbil av vägen. Kollisionen blir våldsam. Den unge mannen i sportbilens passagerarsäte slungas ut och omkommer omedelbart. Den döde heter Valon Bericha och hans bror Jashar satt bakom ratten. Båda är sedan tidigare välkända av polisen.\r\n\r\nÄven i polisbilen fanns ett brödrapar, Johan och Samuel Kangas. Johan, som körde, omplaceras dagen därpå till inre tjänst på ledningscentralen i avvaktan på utredning. Jashar svär på olycksplatsen att ta en blodig hämnd på sin nu döde bror och försvinner spårlöst efter förhör.\r\n\r\nNågon vecka senare kommer ett larm in till polisen om en övergiven bil på en skogsväg. Samuels patrull skickas dit och när han försöker öppna en av dörrarna briserar en kraftig sprängladdning.\r\nMedan den svårt brännskadade Samuel Kangas kämpar för sitt liv kopplas kommissarie Hasse Nelander-Wein och hans kollegor in på fallet. Johan Kangas och hans familj flyttas till skyddat boende på grund av hotbilden. Jakten efter Jashar är i full gång.\r\n\r\nPolisen hittar snart oväntade kopplingar mellan Johan och Jashar. En okänd avsändare har skickat vykort till dem båda med texten: En bror för en syster. I deras förflutna döljer sig ungdomssynder, rivalitet och upplösta allianser. Ett tio år gammalt ärende med en död flicka i en simbassäng blir intressant i utredningen.\r\n\r\nDenna gång verkar Nelander-Wein ha fått ett fall som snart visar sig vara mer komplicerat än han någonsin kunnat ana och dess dramatiska upplösning kommer som en fullständig överraskning.\r\n\r\nEn bror för en syster är den fjärde fristående kriminalromanen om Hasse Nelander-Wein och hans kollegor vid Boråspolisen.\r\n\r\n\r\nAntal CD: 9 CD\r\nUppläsare: Torsten Wahlund\r\nSpeltid: Ca 10 timmar","torrent":{"xt":"urn:btih:8d18ab27ecc1cb5efb5b940711848145e31783de","amp;dn":"Lena+Matthijs+-+En+bror+f%26ouml%3Br+en+syster+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d18ab27ecc1cb5efb5b940711848145e31783de","infoHashBuffer":{"type":"Buffer","data":[141,24,171,39,236,193,203,94,251,91,148,7,17,132,129,69,227,23,131,222]},"announce":[],"urlList":[]}}