{"title":"Wave In Head - Remixed (2012)","uid":7301211,"size":145990827,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8d8f7ec8677fcd2aff55547b7df653bbe5c72283&amp;dn=Wave+In+Head+-+Remixed+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"geloso","files":-1,"time":1338043580,"description":"Artist: Wave In Head\n\nAlbum: Remixed\n\nReleased: 2012\n\nStyle: Synthpop\n\nFormat: MP3 -V 0\n\nSize: 139 Mb\n\n\nTracklist:\n\n01. Highway\n02. I Began To Hope (Acid Island Mix)\n03. We Are The Scene (Remix)\n04. Polygone (Remx)\n05. My Wandering Mind\n06. Zeit Zu Leben (Maxi)\n07. The Atom Of The Moment (Empire State Human Remix)\n08. Progress (DJ Ram Evolution Mix)\n09. For A Special Moment (Controlled Fusion Break Mix By Steffen Schuhrke)\n10. To Hell And Back (Reaktor Rhythm Mix)\n11. Im Traum (European Tour Remix By No Comment)\n12. With You (Maxi)\n13. I Began To Hope (WAVE IN Club Mix)\n14. Yours By Night\n15. Night Over Me\n\nFrom Wikipedia:\n\nWave in Head is a one man German synthpop music project, which was founded in 1993 in Magdeburg, Germany. His name is Michael Pohl.\n\nThe first musical activities have been nothing more than a hobby, when he started, to make some noises with his first sampler, the Ensoniq ASR-10. The style walks between kittering bass lines, well balanced bleeps, a catchy sing-along chorus and fancy, synth styled vocals. An interesting feature is that some lyrics are written in German as in the singles &quot;Zeit zu leben&quot;, &quot;Als Ob&quot;, &quot;Ich denke nicht&quot; and &quot;Ist She schon&quot;.\nn 1999, the project has reached a state of development that allowed production of a first CD, the &quot;rarely&quot; EP. It was distributed through the internet and had got very positive and enthusiastic reviews by several E-zines. The subsequent CD &quot;Criminal Ballad&quot; was not published, because it was made for promotion purposes only, and the debut album was in production yet. In winter 2000 Wave in Head performed live for the first time in Berlin and several record labels offered their cooperation.\n\nSince the beginning of 2001, Wave in Head is signed to A Different Drum and released the debut album, &quot;Time to speak&quot; there, as well as the singles &quot;progress&quot; and &quot;I began to hope&quot; and stayed on the best selling chart for over 10 weeks.\n\nWave In Head also donated a song to the New Order tribute album &quot;True Faith&quot;, covering &quot;Blue Monday&quot;.\n\nIn 2005 the band released &quot;For a Special Moment&quot;. Wave In Head has released all their albums, (except for the self produce EP Rarely), through the A Different Drum label based in Salt Lake City.","torrent":{"xt":"urn:btih:8d8f7ec8677fcd2aff55547b7df653bbe5c72283","amp;dn":"Wave+In+Head+-+Remixed+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d8f7ec8677fcd2aff55547b7df653bbe5c72283","infoHashBuffer":{"type":"Buffer","data":[141,143,126,200,103,127,205,42,255,85,84,123,125,246,83,187,229,199,34,131]},"announce":[],"urlList":[]}}