{"title":"Author's Due: Printing and the Prehistory of Copyright (2002)","uid":8458080,"size":1432941,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e1bb8fe9593c59972f3ce7901e30ffac7caddec&amp;dn=Author%27s+Due%3A+Printing+and+the+Prehistory+of+Copyright+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1368151952,"description":"Joseph Loewenstein - The Author's Due: Printing and the Prehistory of Copyright (University of Chicago Press, 2002).\n\nISBN: 9780226490403 | 360 pages | PDF\n\n&quot;The Author's Due&quot; offers an institutional and cultural history of books, the book trade, and the bibliographic ego. Joseph Loewenstein traces the emergence of possessive authorship from the establishment of a printing industry in England to the passage of the 1710 Statute of Anne, which provided the legal underpinnings for modern copyright. Along the way he demonstrates that the culture of books, including the idea of the author, is intimately tied to the practical trade of publishing those books.\n\nAs Loewenstein shows, copyright is a form of monopoly that developed alongside a range of related protections such as commercial trusts, manufacturing patents, and censorship, and cannot be understood apart from them. The regulation of the press pitted competing interests and rival monopolistic structures against one another -- guildmembers and nonprofessionals, printers and booksellers, authors and publishers. These struggles, in turn, crucially shaped the literary and intellectual practices of early modern authors, as well as early capitalist economic organization.\n\nWith its probing look at the origins of modern copyright, &quot;The Author's Due&quot; will prove to be a watershed for historians, literary critics, and legal scholars alike.\n\nReview\n\n&quot;Offers a complex and highly nuanced history of proprietary authorship and the printing industry in early modern England. This book will come to be recognized as a monument in its field.&quot; -- Leah S. Marcus\n","torrent":{"xt":"urn:btih:8e1bb8fe9593c59972f3ce7901e30ffac7caddec","amp;dn":"Author%27s+Due%3A+Printing+and+the+Prehistory+of+Copyright+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e1bb8fe9593c59972f3ce7901e30ffac7caddec","infoHashBuffer":{"type":"Buffer","data":[142,27,184,254,149,147,197,153,114,243,206,121,1,227,15,250,199,202,221,236]},"announce":[],"urlList":[]}}