{"title":"TamoSoft Essential NetTools v4.0.189 + CRACK","uid":3549278,"size":5059815,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8ec49bef268270cf0f118eb5ab00fd33d00eac9a&amp;dn=TamoSoft+Essential+NetTools+v4.0.189+%2B+CRACK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"0v3rloader","files":1,"time":1162353435,"description":"Essential NetTools is a set of network scanning, security, and administrator tools useful in diagnosing networks and monitoring your computer&amp;#039;s network connections. It&amp;#039;s a Swiss Army knife for everyone interested in a powerful network tool kit for everyday use. It includes:\n\n    * NetStat: displays the list of your computer&amp;#039;s inbound and outbound network connections, including the information on open TCP and UDP ports, IP address, and connection states. What makes it different from other NetStat utilities is the ability to map open ports to the owning application (This feature is available under Windows NT/2000/XP). Configurable alerts for incoming and outgoing connections are also available. Click for more screen shots\n    * ProcMon: displays the list of running processes with full information on the program location, manufacturer, process ID, and the loaded modules. With this tool, you can view CPU utilization statistics, identify hidden applications, kill running processes, and manage the usage of your PC&amp;#039;s resources more effectively.\n    * TraceRoute and Ping: These familiar utilities featuring customizable options and a convenient results presentation allow you to explore the Internet and troubleshoot connectivity problems.\n    * PortScan: An advanced TCP port scanner that allows you to scan your network for active ports. This tool features both conventional (full connect) and stealth (half-open) scanning modes.\n    * NSLookup: Allows you to convert IP addresses to hostnames and vice versa, obtain aliases, and perform advanced DNS queries, such as MX or CNAME.\n    * NBScan: A powerful and fast NetBIOS scanner. NBScan can scan a network within a given range of IP addresses and list computers offering NetBIOS resource-sharing service, as well as their name tables and MAC addresses. Unlike the standard nbtstat utility supplied with Windows, this tool provides a graphical user interface and easy management of the lmhosts file and features parallel scanning, which allows checking a class-C network in less than one minute. NBScan can facilitate routine tasks often carried out by system integrators, administrators, and analysts.\n    * RawSocket: Provides you with the ability to establish low-level TCP and UDP connections to troubleshoot and test different networking services. Multi-color output and a convenient interface make it a great tool for every network administrator or computer programmer.\n    * Shares: Monitors and logs external connections to your computer&amp;#039;s shared resources, lists local shares, as well as provides a quick and easy way to connect to remote resources that gives Windows 98/Me users NT user-level connectivity features. Unlike Windows NT, Windows 98/Me has no user-level connectivity after the boot: you can specify a password, but not a username. This tool allows you to set both a username and a password.\n    * NetAudit (NetBIOS Auditing Tool): Allows you to perform various security checks on your network and/or individual computers offering the NetBIOS file sharing service. This tool can help you identify potential security flaws.\n    * SNMPAudit:an advanced SNMP device scanner that allows you to locate SNMP devices in the selected network segment quickly and receive customizable data sampling from each of the devices. You can use a SNMP browser for a detailed device examination.\n    * SysFiles: A convenient editor for the five important system files: services, protocol, networks, hosts, and lmhosts.","torrent":{"xt":"urn:btih:8ec49bef268270cf0f118eb5ab00fd33d00eac9a","amp;dn":"TamoSoft+Essential+NetTools+v4.0.189+%2B+CRACK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ec49bef268270cf0f118eb5ab00fd33d00eac9a","infoHashBuffer":{"type":"Buffer","data":[142,196,155,239,38,130,112,207,15,17,142,181,171,0,253,51,208,14,172,154]},"announce":[],"urlList":[]}}