{"title":"Joshua DVD","uid":3494237,"size":2902499328,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8f72f4dc968b7c22cbfafd3005a8049c534338de&amp;dn=Joshua+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bucky katt","files":1,"time":1149934618,"description":"Runtime: 90 min.\n\nAudio: English\nSubs : none\n\n\nThe town of Auburn was always normal, to say the least. True, the people there weren&amp;#039;t really a &quot;community&quot;, but they never noticed...until a stranger named Joshua rolled into town one morning. In small ways, Joshua began to help out around the town-helping a teen play guitar, helping save a marriage in danger, or teaching a bumbling priest how to speak about faith. An old Baptist church that came down in a storm is his next big project. With the help of stuttering Theo, who dreams of being a preacher, he brings the town together to restore the old building. In this way, the whole town unites and becomes a community. This attracts the attention of Father Tordone, who is a bitter man due to the fact that he lost a position in the Vatican. When the mysterious Joshua begins to show up in two places at once and miraculously cures a blind woman, Father Tordone believes Joshua is a false prophet, trying to cheat people. When his next huge miracle-reviving Theo from death after he falls from the roof of the newly completed church-overwhelms the town, Father Tordone seeks out an official condemnation from the Vatican. But Joshua melts his icy heart, and the reformed Father becomes a Vatican member. Joshua sees the Pope himself and reveals himself as Jesus! After his meeting, Joshua leaves-but the people of Auburn, with their dreams fufilled and their happiness increased.\n\nCTCA","torrent":{"xt":"urn:btih:8f72f4dc968b7c22cbfafd3005a8049c534338de","amp;dn":"Joshua+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f72f4dc968b7c22cbfafd3005a8049c534338de","infoHashBuffer":{"type":"Buffer","data":[143,114,244,220,150,139,124,34,203,250,253,48,5,168,4,156,83,67,56,222]},"announce":[],"urlList":[]}}