{"title":"Shajarur Kanta-normal-HEVC-DDR","uid":11997277,"size":729255491,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:901b7316247dbf04c1a03cb8ae26e9fdf2badc17&amp;dn=Shajarur+Kanta-normal-HEVC-DDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":1,"time":1433693609,"description":"Synopsis:\nSwapnochari, a theatre group is about to break-up as its heroine Deepa (Konkona SenSharma) is to be married to a young industrialist Debashish Bhatto (Indraneel Sengupta). Director Prabal (Kaushik Sen) is distraught, for Deepa is both his creation and his muse. Deepa too is unhappy, as she loves someone other than Debashish and tells him so on the night after the wedding. They come to an arrangement in which Deepa continues to stay with Debashish but has no physical relations with him.\n\nOn the night of Deepa's wedding, a beggar is murdered with a strange weapon - the quill of a porcupine. Its noticed because it is a curious way to kell a person, except by the legendary detective, Byomkesh. But no one else gives it much attention, that is until the second murder takes place followed by two more..\n\nThen one night Debashish is attacked. Its a miraculous escape, for his heart is placed on the wrong side of his chest. It is time for the legendary detecting skills of Byomkesh Bakshi to come into play..\n\n\nComments:\nI wish Director's would remember that Saradindu Bandyopadhyay was a script writer himself. Shajarur Kanta was written like a film script with atleast three suspects till the last. Granted, Saibal Mitra needed to bring the film to 2014 from the settings of 1940, but did he have to make a comlete hash of the original story line?\n\nYou know who the murderer is within the first half hour. What remains is to find his motive. And the Director spends all of three hours doing just that. The result is an out and out yawn fest, in which puerile clues are analysed over and over again until you want to get in and scream the solution to all the actors! At the end of the film, you get the impression that you and not the murderer has been sleepwalking.\n\nYou can sit through the film, but only because Konkona and Indraneel. They hold the film together as Deepa and Debashish. The rest, including Dhritiman as Byomkesh, are so pedestrian that you are glad that Saradidndu was cremated as a Hindu and thus doesn't have a grave to turn over in!\n\nThe cinematography, in keeping with the rest of the film, can be classified into scenes and er scenes. If the intention was to set a brooding and tense mood, it fails quite spectacularly. Music is adequate and the editor must have been suffering from somnambulism too as he has allowed 3 hours for a film in which perhaps two thirds could have been cut. Casting is crazy, as Deepa's brother looks like her father and the bureaucrat Nripati looks like a sleazy business arranger.\n\nIts a disappointing film if you know the original story. If you forget it is a Byomkesh film, the story line is very immature, but you can, with some effort, trace a line of logic in it.\n\n\nUploader's Notes:\nI was given this WebHD by a friend, Like all webHD, there are few details available and I have tried to coax them out. Thanks to the extra compressibility of 10-bit X265, I was still able to squeeze this 3 hour film into less than 700MB. It is still a very good rip as you can see from the sample and the screenshots. The screens are evenly placed across the length of the video and the sample is from near the centre.\n\nBe aware that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have these or later versions of VLC or Media Player Classic. Earlier versions may not work:\nVLC - 2.1.5 (Rincewind).\nMPC - 1.7.8 (6fcba 1b)\n\nIMDB Link: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt4538164/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt4538164/&lt;/a&gt;","torrent":{"xt":"urn:btih:901b7316247dbf04c1a03cb8ae26e9fdf2badc17","amp;dn":"Shajarur+Kanta-normal-HEVC-DDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"901b7316247dbf04c1a03cb8ae26e9fdf2badc17","infoHashBuffer":{"type":"Buffer","data":[144,27,115,22,36,125,191,4,193,160,60,184,174,38,233,253,242,186,220,23]},"announce":[],"urlList":[]}}