{"title":"Lady on a Train 1945 DvdRip Avi Lee1001","uid":9827418,"size":1019183922,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:90445a91f1d5d52495d92f903c736b382c8e366e&amp;dn=Lady+on+a+Train+1945+DvdRip+Avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"xultfoad","files":2,"time":1395799735,"description":"Lady on a Train 1945 DvdRip Avi Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0037859/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0037859/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Lady_on_a_Train&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Lady_on_a_Train&lt;/a&gt;\nLady on a Train is an American thriller film first released in 1945, directed by Charles David. The film is based on a story by Leslie Charteris and stars Deanna Durbin, Ralph Bellamy and David Bruce. Our overall rating for this film is: good.\n\nDurbin plays a girl who witnesses a murder from the window of a train pulling into New York, is believed by no one, and so turns to detection herself, becoming entangled with the victim's sinisterly bizarre family (which includes the killer). \n\nWith a strong supporting cast, it's surprisingly entertaining. The plot, derived from a story by Leslie Charteris previously filmed in Britain as A Window in London, doesn't delve into the dark chaos beloved of noir thrillers in the '40s so much as play it slightly tongue-in-cheek. Light, cheery and shading into darker areas for the climax, it's fun. \n\nAuthor: perrylyn-1 from United States 8 April 2005\nDeanna Durbin made many movies, mostly bad. But the ones that are good make all the others palatable, including &quot;Lady on a train&quot;. She was a unique personality. Almost impossible not to like. For example, It's like watching John Wayne walk through one boring, formulaic plot after another and not minding because you just like John Wayne. So to be thoroughly charmed by Deanna Durbin, you have to inoculate yourself against the dumb plots she was given later in her career. First dose should be with one of the best stories. &quot;It started with eve&quot; That should win you over for anything to come later. Then it's good to go to the beginning, her first picture, &quot;Three Smart Girls&quot; when she was a little girl and won everyone's hearts ( but be warned the story and direction are bit creaky). Your third dose should be &quot;Three smart girls grow up&quot; by this time your ready to take on and enjoy any of her movies regardless of plot. I do admit to fast-forwarding past some of her singing in her later movies, but that's because they're badly placed in the story and tend to slow things down to a crawl. Bottom line, she's something special and not to be missed.\n\nVIDEO\nSize.... 971mb\nDuration.... 01:34:30\nCodec.... divx\nFrame Width..... 720\nFrame Height.... 528\nData Rate.... 1309kbps\nFrame Rate.... 23F/S\nAUDIO\nBit Rate.... 128kbps\n2 Channel Stereo\nAudio Sample Rate.... 48KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:90445a91f1d5d52495d92f903c736b382c8e366e","amp;dn":"Lady+on+a+Train+1945+DvdRip+Avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90445a91f1d5d52495d92f903c736b382c8e366e","infoHashBuffer":{"type":"Buffer","data":[144,68,90,145,241,213,213,36,149,217,47,144,60,115,107,56,44,142,54,110]},"announce":[],"urlList":[]}}