{"title":"Bias in Mental Testing (1980) by Arthur Robert Jensen","uid":9633373,"size":44892603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91e7940797c41058d42459d50edeeddea8601b36&amp;dn=Bias+in+Mental+Testing+%281980%29+by+Arthur+Robert+Jensen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1392817388,"description":"Bias in Mental Testing (1980) by Arthur Robert Jensen.pdf\n\nThe book is based on the fact that the average IQ of African Americans had been consistently found to lie approximately 15 points lower than that of White Americans, and the accusation made by some psychologists that IQ tests are therefore culturally biased against African Americans. The book does not address the question whether the cause of the IQ gap is genetic or environmental, but only whether the tests themselves are valid.\n\nThe book presents several arguments that IQ tests are not biased. African Americans' lower average performance on IQ tests cannot be because of differences in vocabulary, because African Americans have slightly better performance on verbal tests than on nonverbal tests. The IQ difference also cannot be because the tests depend on White culture, or that Whites inevitably do better on tests designed by Whites. In fact, Blacks perform better on tests that are culturally loaded than they do on tests designed to not include cultural references unfamiliar to Blacks, and Japanese children tend to outscore White children by an average of six points. Nor can the difference be a reflection of socioeconomic status, because when Black and White children are tested who are at the same socioeconomic level, the difference between their average IQs is still twelve points.\n\nThe book also presents evidence that IQ tests work the same way for all English-speaking Americans born in the United States, regardless of race. One is that IQ tests have been very successful in predicting performance for all Americans in school, work, and the armed forces. Another is that the race and sex of the person administering a test does not significantly affect how African Americans perform on it. The ranking in difficulty of test items on IQ tests is the same for both groups, and so is the overall shape of the graph showing the number of people achieving each score, except that the curve is centered slightly lower for Blacks than it is for Whites.\n\nBased on this data, Jensen concludes that tests which show a difference in average IQ between races are showing something real, rather than an artifact of the tests themselves. He argues that in competition for college admission and jobs, IQ tests have the potential to be more fair that many of the alternatives, because they can judge ability in a way that's colorblind instead of relying on the judgment of an interviewer.\n\n786 pages\nPublisher: Free Press (January 1, 1980)\nLanguage: English\nISBN-10: 0029164303\nISBN-13: 978-0029164303","torrent":{"xt":"urn:btih:91e7940797c41058d42459d50edeeddea8601b36","amp;dn":"Bias+in+Mental+Testing+%281980%29+by+Arthur+Robert+Jensen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91e7940797c41058d42459d50edeeddea8601b36","infoHashBuffer":{"type":"Buffer","data":[145,231,148,7,151,196,16,88,212,36,89,213,14,222,237,222,168,96,27,54]},"announce":[],"urlList":[]}}