{"title":"Holocaust: Jewish or German? by Brazilian, S.E. Castan","uid":4348506,"size":47267709,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:927c0b662d41bbd81f3133c9fd74db40696772b9&amp;dn=Holocaust%3A+Jewish+or+German%3F+by+Brazilian%2C+S.E.+Castan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CuriousGeorge","files":1,"time":1219012436,"description":"Rare Book. 320 pages with many photos\n\nHolocaust: Jewish or German? - I denounce: The Lie of the Century \n\nBrazilian Historian, S.E. Castan\n\nPublisher: Revisao Editora (1988)\nASIN: B0006F2MKA\n\nBest viewed if &quot;Click to show one page at a time&quot; setting is enabled in PDF viewer. If not, pages may appear uneven.\n\nRegistered in Brazil's National Library under number 42,113.\n\nTranslation &amp; Proofreading from the \noriginal Portuguese\nin Brazil, by Alf Eyre\nCaixa Postal 11/1126\n70084 Brasilia DF\nBrazil\n\n\n\nAttention: There are two lines that appear to be blacked out on page 14. They have not been blacked. However, they were highlighted with a marker and the scanner could not read it.\n\nThe missing lines are as follows:\n\nPage 14, Holocaust: Jewish or German\n\n&quot;The first post-war Chancellor was Konrad Adenauer, who remained in that office for 15 years, from 1949 on. He had been arrested by the National Socialist government from 1933 to 1934 and he had a daughter married to a Jew, living in New York.&quot;\n\n(If you find any other textual errors please leave a comment on this torrent thread ASAP. Thanks and sorry for the inconvenience of the above blackout.)\n\n-------------------------------------------------------------------------------\n\n&quot;Greetings! The accompanying report speaks for itself. The forces of the Thought Police strike again. I hope you can all help me bring the news of this new outrage to all decent people. As always, please send a copy of your magazine or newsletter if this material is used. \n\nThe headline published in the December 1996 issue of the bulletin of the Latin American Jewish Congress joyfully boasts of &quot;Victory&quot;; a Jewish victory that is. \n\nIn the report originated in Brazil and produced by Mauricio Soibelmann, president of the Israeli Federation of Rio Grande do Sul (a southern Brazilian state), we find out that the victory that causes celebration in the Jewish community in Brazil is a new defeat for free speech in the largest South American country. \n\nIn a decision delivered in late 1996, Brazilian judicial authorities tried and convicted the local revisionist writer, publisher and intellectual, Siegfried Ellwanger Castan. \n\nMr. Castan's best known work is &quot;Holocaust: Jewish or German?&quot;.\n\nMr. Ellwanger has proven to be one of the most efficient activists of the Revisionist cause. The above mentioned book was released in 1987, and since then at least twenty two (22!) editions have followed the first one. More than one hundred thousand (100,000) copies have been sold in Portuguese, Spanish, German and English. \n\nMr. Ellwanger was born in Southern Brazil in 1928 and has lived a very interesting life. He volunteered to the Brazil Marine Corps in 1946. He is a patent holder of support plates for rails used in Brazilians railways and also exported. \n\nHe successfully worked in the steel business. At a young age he was the head salesperson of a very important steel importing corporation. \n\nTen years after that, Mr. Ellwanger started his own business, also in the trade of steel. A curious man and researcher of history, Mr. Ellwanger has traveled to the Americas (from Alaska to Tierra del Fuego), Western Europe and Poland. \n\nHis after-retirement involvement in the revisionist studies of the Holocaust has doubtlessly provided Mr. Ellwanger more excitement than an average retiree aspires to have. Although I have never had the pleasure to meet in person with Mr. Ellwanger, personal accounts of others depict him as a dedicated man who holds the highest standards of hospitality with his friends.\n\nThrough his publishing company, `Revisao Editora Ltda.', Mr. Ellwanger has made available to the Brazilian public a wide variety of books, some originally written in Portuguese while some (were) translated from their original tongues. Some of the works that the Jewish lobby has targeted for their inquisitorial objectives are (original titles are in Portuguese): &quot;The Secret History of Brazil&quot; by Gustavo Barroso; &quot;World Conquerors&quot; by Marchalko; &quot;Brazil, a Bankers Colony&quot; by Barroso; Henry Ford's &quot;The International Jew&quot; and &quot;The Protocols of Zion&quot;, as well as summaries and translations of the &quot;Leuchter Report&quot; and material from the Institute for Historical Review.\n\nMr. Ellwanger's record of fighting censorship is long one. Unfortunately I have not kept record of the many times his literature was censored or confiscated by government authorities. But the latest court decision is particularly serious. In the afternoon of October 31, 1996, Mr. Ellwanger was sentenced to two years in prison for publishing anti- semitic books that &quot;attempt against human dignity&quot;. This decision was based on law 8081, enacted in 1990. The prison term was changed (later in appeal) to three years of community service.\n\nFor further questions regarding this matter please do not hesitate to contact me by writing at:\n\nGuillermo Coletti\nP.O. Box 61221\nPasadena, CA 91106\nUSA\n\nor, contact Mr. Ellwanger at:\n\nRevisao Editorial, Ltda.\nCaixa Postal 10 466\n90001 Porto Alegre, RGS\nBrazil&quot;\n\n\nSpanish Version (En EspaÃƒÂ±ol) \nHolocausto: Judio o Aleman? - S.E. Castan &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4295622/Holocausto____Judio_o_Aleman__-_S.E._Castan&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4295622/Holocausto____Judio_o_Aleman__-_S.E._Castan&lt;/a&gt;\n\n                                                                                \n                                                                                \n         MMMMMMM                                                                \n       MMMMMMMMMMM        =MMMMMMMMMMM     MMMMMMMMMMMMM    IMMMMMMMMMMM        \n      MMMMMMMMMMMMM.      MMMMMMMMMMMM     MMMMMMMMMMMMM    MMMMMMMMMMMM        \n     MMMMMMMMMMMMMMM      MMMMMMMMMMMM     MMMMMMMMMMMMM    MMMMMMMMMMMM        \n    MMMMMMMMMMMMMMMMM     MMMMMMMMMMMM.    MMMMMMMMMMMMM    MMMMMMMMMMMM        \n    MMMMMMMM  MMMMMMM     MMMMMMMMMMMMN    MMMMMMMMMMMMM    MMMMMMMMMMMM        \n    MMMMMMM:  MMMMMMM     MMMMMMMMMMMMM         MMMMMMMM    MMMMMMMMMMMMO       \n    MMMMMMM   MMMMMMM:    MMMMMM7MMMMMM         MMMMMMMM    MMMMMMNMMMMMM       \n    MMMMMMM   MMMMMMM7    MMMMMM MMMMMM        :MMMMMMMM   $MMMMMMIMMMMMM       \n    MMMMMMM   MMMMMMMO   ?MMMMMM MMMMMM        MMMMMMMM:   MMMMMMM MMMMMM       \n    MMMMMMM   MMMMMMMO   MMMMMMM MMMMMM.       MMMMMMMM    MMMMMMM MMMMMM       \n    MMMMMMM              MMMMMMM MMMMMMD      =MMMMMMMM    MMMMMMM MMMMMM       \n    MMMMMMM              MMMMMMM MMMM~~+MOD   MMMMMMMM     MMMMMMM MMMMMMO      \n    MMMMMMM              MMMMMMM MM=~OMMM~N~NZ~MMMMMMM     MMMMMMM MMMMMMM      \n    MMMMMMM  MMMMMMMMO   MMMMMMM Z7~~:ZZ+N?NMMN~~MMMMM    .MMMMMM? MMMMMMM      \n    MMMMMMM  MMMMMMMMO   MMMD=IO~M~~~:7O+?M7?I7O~D~MM     ZMMMMMM  MMMMMMM      \n    MMMMMMM  MMMMMMMMO  +MMMM+==?=~M~I+$?=~7=?=~~~7~MIZ   MMMMMMM  MMMMMMM      \n    MMMMMMM  MMMMMMMMO  MNM~7D~~I==+~~=~I~~=O~~+~~M~:DIM. MMMMMMM  DMMMMMM      \n    MMMMMMM   MMMMMMMO ZO$~MM~~M~7~~~ININ~=$77I~~DON~N=?~NMMMMMMM  :MMMMMM      \n    MMMMMMM   MMMMMMDN7+~MM==+:M:=DMD+~Z~Z~~DD~~=7$OZ=MO=DD~~MMMMMMMMMMMMMZ     \n    MMMMMMM   MMMMM+~M~O~M~MN=N=~~7O~OZMO==~~~++~~~D+OZN$$OD?7MMMMMMMMMMMMM     \n    MMMMMMM   MMMMMM~O:~NZOOOMMMM~$I7D=~~~~~~~Z=D~=MZM=~M~?I~~ZMMMMMMMMMMMM     \n    MMMMMMM.  MMMMM+OD~=MINN:?~~ZN$N~~~O~~N~~=~7~=~+D+O$N~?~~~~=MMMMMMMMMMM     \n    MMMMMMM=  MMM?:~~~OI~~MDMDIMOM?+7+~~7++~Z=DID~OMNDN$DM~~~~~?=7MMMMMMMMM     \n    MMMMMMMM .MM~?~=~==?~~7M~D:~INDO~N+I7~D~7+77DM~~+I?NO+M7Z=~M~~N MMMMMMM     \n    ZMMMMMMMMM+M~I~D~~~I=:$~===I~MIOMI~+=~~M~N~IIZO~~NOIM?~O~~~~~D~+MMMMM+$N    \n     MMMMMMMM~I$~~~~~NDD=~O~~INO~$D+N=ZOOM~DO$OM~M=O7~NI:M~=~O~:DN7D7~MMMMMM    \n      MMMM=MO?:$?~=+?=$7~ID~MN$OM~Z+Z~~+ZO+~M=DNMZD~I~~~DOZO~=~~M~$=7N~MMMM~    \n       M=77~?O:?OZ~OI~+=~==D~MDOZ+$N7=7~M+IM~OMDM?MZ$7~~$M~~+I~ZI~~+~~~O~MI+","torrent":{"xt":"urn:btih:927c0b662d41bbd81f3133c9fd74db40696772b9","amp;dn":"Holocaust%3A+Jewish+or+German%3F+by+Brazilian%2C+S.E.+Castan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"927c0b662d41bbd81f3133c9fd74db40696772b9","infoHashBuffer":{"type":"Buffer","data":[146,124,11,102,45,65,187,216,31,49,51,201,253,116,219,64,105,103,114,185]},"announce":[],"urlList":[]}}