{"title":"Heterogeneous Catalysis in Organic Chemistry","uid":15357532,"size":7050116,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92909d1d2f7000851919c3620ce8ee09e56d231e&amp;dn=Heterogeneous+Catalysis+in+Organic+Chemistry&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1468990138,"description":"Heterogeneous Catalysis in Organic Chemistry - Gerard V. Smith, Ferenc Notheisz (AP, 1999).pdf\r\n\r\nThe features of this book which will be of special interest to academic organic chemists are the introduction (Chapter 1), which presents a short course on the concepts and language of heterogeneous catalysis, covers organic reaction mechanisms of hydrogenation (Chapter 2), hydrogenolysis (Chapter 4), and oxidation (Chapter 6), a presents problems and solutions specific for running heterogeneous catalytic organic reactions in solution. These materials can supplement advanced chemistry courses.\r\n\r\nMost synthetic organic chemists use a variety of &quot;protecting groups&quot; which they attach to functional groups (reactive groups of atoms) while some reaction is being conducted on another part of the molecule. These protecting groups prevent reactions of the functional groups during other reactions and are removed later by a heterogeneous catalytic method called hydrogenolysis. One unique feature of this book, not found in other books on catalysis, is an exhaustive chapter (Chapter 4) on hydrogenolysis, which is dredged from the recent synthetic literature published by modern organic chemists. Academic organic chemists should find this chapter extremely useful and may wish to adopt the book as a supplement for advanced organic chemistry courses designed for seniors and for graduate students. It will also be useful for professors and their research groups engaged in synthetic organic chemistry.\r\n\r\nMany academic organic chemists are not aware of recent advances in heterogeneous enantioselective catalysis (Chapter 3) or in selective low temperature, liquid phase heterogeneous catalytic oxidations by hydrogen peroxide (Chapter 6). These specialty topics are timely and may be new to academic organic chemists and can be used to supplement their advanced courses.\r\n\r\nSeveral features of this book will also be of special interest to industrial chemists who are unfamiliar with heterogeneous catalysis. Many good organic chemists are hire by industry. They synthesize a new compound using standard organic synthetic techniques but are informed by their supervisor that they must convert some of their synthetic steps into heterogeneous catalytic steps. They may not have been exposed to heterogeneous catalysis and have few places to turn. This book offers them a crash course in heterogeneous catalysis as well as many examples of reactions and conditions with which they can start their search.\r\n\r\nThose industrial organic chemists already familiar with heterogeneous catalysis will find this book useful as a reference to many examples in the recent literature. They will find recent surface science discoveries correlated with heterogeneous catalysis or organic reactions and mechanistic suggestions designed to stimulate innovative nontraditional thinking about organic reactions on surfaces.\r\n\r\n\r\nKey Features\r\n* Written by organic chemists for organic chemists\r\n* Introduces heterogeneous catalysis concepts and language\r\n* Presents a comprehensive compilation of protecting group removal procedures\r\n* Covers liquid-phase hydrogenations, hydrogenolysis, and oxidations\r\n* Addresses heterogeneous methods for producing pure enantiomers of chiral products\r\n* Examines the emerging field of heterogenized homogeneous catalysts\r\n* Mixes practical applications with mechanistic interpretations","torrent":{"xt":"urn:btih:92909d1d2f7000851919c3620ce8ee09e56d231e","amp;dn":"Heterogeneous+Catalysis+in+Organic+Chemistry","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92909d1d2f7000851919c3620ce8ee09e56d231e","infoHashBuffer":{"type":"Buffer","data":[146,144,157,29,47,112,0,133,25,25,195,98,12,232,238,9,229,109,35,30]},"announce":[],"urlList":[]}}