{"title":"[Elaine_Weinmann, Peter_Lourekas]Photoshop CS6 Visual Quickstart","uid":11071070,"size":78925795,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92b8707a8effc7e205461478bf7743e6eb73c098&amp;dn=%5BElaine_Weinmann%2C+Peter_Lourekas%5DPhotoshop+CS6+Visual+Quickstart&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1411266490,"description":"This best-selling guide from authors Elaine Weinmann and Peter Lourekas has been the go-to tutorial and reference book for photography/design professionals and the textbook of choice in college classrooms for decades. This edition includes their trademark features of clear, concise, step-by-step instructions; hundreds of full-color images; screen captures of program features; and supplemental tips and sidebars in every chapter.  \n\nAmong the new CS6 features covered in this extensively updated guide are: Field Blur, Iris Blur and Tilt-Shift filters; Properties panel; Exporting and Importing presets; Content-Aware Move tool and Content-Aware option for the Patch tool; Timeline panel for video editing; Photographic Toning libraries for Gradient Map adjustments; and Open Type options. Improved CS6 features covered: Crop tool options and features, Adjustment Brush tool in Camera Raw, and Vector masks.   \n\nNew and updated Photoshop CS6 features are clearly marked with bright red stars in both the table of contents and main text.\n\nIncludes Free eBook and Video Access\n\nIn addition to concise, step-by-step explanations of core tools and tasks, with plenty of helpful screen shots to keep you on track as you work, Photoshop CS6: Visual QuickStart Guide includes an hour-long HD video and eBook. In addition to reading about how to use the tool, you can watch it in action. You can also download digital versions of this book to load on the mobile device of your choice so that you can continue learning whenever and wherever you are. We provide you with both the ePub and PDF to ensure that you get the experience that best suits your viewing needs.\n\nPublisher: Peachpit Press; 1 edition (June 18, 2012)\nLanguage: English\nISBN-10: 0321822188\nISBN-13: 978-0321822185\n\nMore About the Author\nBiography\nElaine Weinmann and her co-author, Peter Lourekas, write, design, and illustrate the best-selling Visual QuickStart Guides to Adobe Photoshop and Adobe Illustrator. Their books have been translated into 25 languages and have sold more than 3 million copies worldwide. She has also taught computer graphics courses at the New School Computer Instruction Center and Pratt Manhattan; he has taught at the Cooper Union School of Art and Parsons School of Design. View their blog at elaineandpeter.com Twitter @elaineweinmann\n","torrent":{"xt":"urn:btih:92b8707a8effc7e205461478bf7743e6eb73c098","amp;dn":"%5BElaine_Weinmann%2C+Peter_Lourekas%5DPhotoshop+CS6+Visual+Quickstart","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92b8707a8effc7e205461478bf7743e6eb73c098","infoHashBuffer":{"type":"Buffer","data":[146,184,112,122,142,255,199,226,5,70,20,120,191,119,67,230,235,115,192,152]},"announce":[],"urlList":[]}}