{"title":"4 Clyde Allison Bond Parodies Rare Pulp Fiction","uid":4511839,"size":136637328,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92d8eca42f27b0aaa428822142936194f6eda75a&amp;dn=4+Clyde+Allison+Bond+Parodies+Rare+Pulp+Fiction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flapjack111","files":326,"time":1226807704,"description":"These are 4 of the 20 Agent 0008 James Bond parodies written by William Henley Knoles writing as Clyde Allison.  They are jpg scans of the books and covers.  The books were paperback originals and were never reprinted.  The original paperbacks sell  from around 100-300 usd.  Knoles was an excellent writer and amazingly prolific. Knoles humorous style is a unique first person and worth a read. He also wrote two other Bond-ish parodies for Lancer books under the pen name Clyde Ames. The book titled &quot;Gorgonzola, Won't You Please Come Home?&quot; is especially well written and to me one of the funniest. \n\nThese are not necessarily the funniest of the series, but they just happen to be the four I had scanned.  Please leave comments if you would like reading copies of any of the other Knoles novels, as I do have them all. Also leave any comments about your general interest in this torrent.\n\nThe four scans are:\n\nThe Desdamona Affair\nEmber Library EL317 1966\n\nFrom Rapture With Love\nLeisure Book LB1180 1966\n\nThe Sin Funnel\nCandid Reader CA901 1967\n\nMondo Sadisto\nLeisure Book LB1160 1966\n\nWilliam Henley Knoles, under the pseudonym &quot;Clyde Allison&quot;, wrote a 20-novel series between 1965 and 1968, about Agent 0008, a thinly disguised version of Bond. The books were more stories of action and softcore S&amp;M, than legitimate satire, but their scarcity makes them sought-after Bond collectibles. The series included: (i)Our Man From Sadisto, (ii) Our Girl From Mephisto, (iii) Nautipuss, (iv) Go-Go Sadisto, (v) The Desdamona Affair, (vi) Gamefinger, (vii) Sadisto Royale, (viii) 0008 Meets Gnatman,(also parodying Batman) (ix) For Your Sighs Only, (x) The Lust Bomb, (xi) The Merciless Mermaids, (xii) Mondo Sadisto, (xiii) 0008 Meets Modesta Blaze (also parodying comic strip heroine Modesty Blaise), (xiv) The Sex-Ray, (xv) Roburta The Conqueress, (xvi) From Rapture With Love, (xvii) The Ice Maiden, (xviii) The Sin Funnel, (xix) Platypussy, and (xx) The Desert Damsels. \n","torrent":{"xt":"urn:btih:92d8eca42f27b0aaa428822142936194f6eda75a","amp;dn":"4+Clyde+Allison+Bond+Parodies+Rare+Pulp+Fiction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92d8eca42f27b0aaa428822142936194f6eda75a","infoHashBuffer":{"type":"Buffer","data":[146,216,236,164,47,39,176,170,164,40,130,33,66,147,97,148,246,237,167,90]},"announce":[],"urlList":[]}}