{"title":"The Cult (Pure Cult - Greatest Hits) [FLAC] [h33t] - Kitlope","uid":4374107,"size":540274539,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9311476515eb1d62145769a9561894a31462f0e6&amp;dn=The+Cult+%28Pure+Cult+-+Greatest+Hits%29+%5BFLAC%5D+%5Bh33t%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kitlope","files":22,"time":1220314106,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 9311476515EB1D62145769A9561894A31462F0E6\nFile Size: 515.24 Mb\nYear: 1993\nLabel: Beggars Banquet Records, PolyGram\nCatalog #: 314514213-2\n\n\nPlease help seed these FLACs! \n\n\n\nFrom Wiki:\n\n\nThe Cult are an English rock band which gained a dedicated following in their native Britain with mid-'80s singles like &quot;She Sells Sanctuary&quot; before breaking into the American metal market in the late '80s with &quot;Love Removal Machine.&quot; The band fuses a &quot;heavy metal revivalist&quot; sound with the &quot;pseudo-mysticism...of the Doors, the guitar-orchestrations of Led Zeppelin, and the three-chord crunch of AC/DC, while adding touches of post-punk goth rock&quot; [1] Since their earliest form in Bradford during 1981, the band has had various line-ups, but the longest serving band members are vocalist Ian Astbury and guitarist Billy Duffy, both of whom are the band's songwriters.\n\nAfter moving to London, the band released Love, which charted at #4 in the United Kingdom, and which included singles such as She Sells Sanctuary and Rain. In the late 1980s, the band adopted a more hard rock and glam rock-infused sound with Electric, the single Love Removal Machine, and the album Sonic Temple, which enabled them to break into the North American market. By the early 1990s, the band was fraying behind the scenes, due to alcohol abuse and off-stage tensions, leading to a split-up in 1995. [1] Between 1999 and 2002, the band reformed to record the album Beyond Good and Evil, and they reissued all of their albums in Asia and eastern Europe in 2003 and Japan in 2004. In 2006, the band reformed again to perform a series of worldwide tours. In October 2007, the band released the album Born into This, on the Roadrunner Records label.[2]\n\n[b] Pure Cult: For Rockers Ravers Lovers and Sinners [/b]\n\n\nPure Cult is the first of several greatest hits compilations by the British rock band The Cult, the cover show at the right is the original cover artwork. The title of the original release was &quot;Pure Cult - for Rockers, Ravers, Lovers, and Sinners&quot; while the 2000 reissue was titled &quot;Pure Cult- The Singles: 1984- 1995&quot;.\n\nReleased on 9 February 1993. Singer Ian Astbury and guitarist Billy Duffy admitted that they did not have high hopes for this record's release, thinking it would be of interest only to collectors and die hard fans. However, the first week of release it was number one on the British charts and went double platinum, selling over 200,000 copies, which lead to it being issued later in several other countries in Europe (where it reportedly reached number one also in Portugal) and Asia.\n\nReleased in many forms, either as a single cd compilation of all work up to 1993 or as a double cd with a &quot;Live&quot; disc from a recording at the Marquee Club in November 1991. A four album boxset version included the full greatest hits compilation and live set (but omitting the &quot;amplification breakdown&quot; portion) from the Marquee show, or as a double album containing only the greatest hits compilation. In Poland it was released as a two cassette tape set, with slightly different artwork, as &quot;Pure Cult- For Rockers, Ravers, Lovers, and Sinners, volumes one and two&quot;.\n\n\n\nSome of the various pressings released were:\n\n\n- In the United Kingdom a two lp set, consisting of the greatest hits compilation. \n\n- Also in the UK, a four lp box set, consisting of the greatest hits compilation (with the full seven minute version of 'The Witch') and the two lp version of the Marquee Club show, minus the amplification breakdown section. \n\n- Another UK release was a two cd set, the first disc is the greatest hits compilation (with the four minute version of 'The Witch') and the second disc is the first half of the Marquee Club. \n\n- In Portugal and Brazil it was released as a two lp set, consisting of the greatest hits compilation. \n\n- In Italy and the Netherlands it was released as a single cd greatest hits compilation, and also some copies included the second &quot;Live at the Marquee Club&quot; disc. Both versions in Italy and the Netherlands use the four minute version of &quot;The Witch&quot;. \n\n- In Poland it was issued as a two cassette tape set, with the entire greatest hits compilation and the four minute version of &quot;The Witch&quot;, but none of the live album. \n\n- In the Philippines it was issued as a single cassette tape with the entire greatest hits compilation, with the four minute version of &quot;The Witch&quot;. \n\n- In Canada, two versions were released on cd, one by Polygram and the other by Beggars Banquet Records. Both versions were identical. \nOther variations are also available throughout the world.\n\n\n\n\n\n\n Tracks:\n\n\n1.\tShe Sells Sanctuary \n2.\tFire Woman \n3.\tLil' Devil \n4.\tSpiritwalker \n5.\tThe Witch* \n6.\tRevolution** \n7.\tWild Hearted Son** \n8.\tLove Removal Machine \n9.\tRain \n10.\tEdie (Ciao Baby)** \n11.\tHeart of Soul** \n12.\tLove \n13.\tWild Flower \n14.\tGo West (Crazy Spinning Cirlcles) \n15.\tResurrection Joe** \n16.\tSun King \n17.\tSweet Soul Sister** \n18.\tEarth Mofo \n\n* (4.18 on cd, 7.03 on vinyl only)\n** (single version)\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:9311476515eb1d62145769a9561894a31462f0e6","amp;dn":"The+Cult+%28Pure+Cult+-+Greatest+Hits%29+%5BFLAC%5D+%5Bh33t%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9311476515eb1d62145769a9561894a31462f0e6","infoHashBuffer":{"type":"Buffer","data":[147,17,71,101,21,235,29,98,20,87,105,169,86,24,148,163,20,98,240,230]},"announce":[],"urlList":[]}}