{"title":"Reinforced Concrete Design of Tall Buildings [Re Upload]{BBS}","uid":6632034,"size":34615544,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:935290011623c0331e7b378c71c1a2ee0f21a089&amp;dn=Reinforced+Concrete+Design+of+Tall+Buildings+%5BRe+Upload%5D%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314407098,"description":"An exploration of the world of concrete as it applies to the construction of buildings, Reinforced Concrete Design of Tall Buildings provides a practical perspective on all aspects of reinforced concrete used in the design of structures, with particular focus on tall and ultra-tall buildings. Written by Dr. Bungale S. Taranath, this work explains the fundamental principles and state-of-the-art technologies required to build vertical structures as sound as they are eloquent. Dozens of cases studies of tall buildings throughout the world, many designed by Dr. Taranath, provide in-depth insight on why and how specific structural system choices are made.\n\nThe book bridges the gap between two approaches: one based on intuitive skills and experience and the other based on computer skills and analytical techniques. Examining the results when experiential intuition marries unfathomable precision, this book discusses:\n\n    * The latest building codes, including ASCE/SEI 7-05, IBC-06/09, ACI 318-05/08, and ASCE/SEI 41-06\n    * Recent developments in studies of seismic vulnerability and retrofit design\n    * Earthquake hazard mitigation technology, including seismic base isolation, passive energy dissipation, and damping systems\n    * Lateral bracing concepts and gravity-resisting systems\n    * Performance based design trends\n    * Dynamic response spectrum and equivalent lateral load procedures\n\nUsing realistic examples throughout, Dr. Taranath shows how to create sound, cost-efficient high rise structures. His lucid and thorough explanations provide the tools required to derive systems that gracefully resist the battering forces of nature while addressing the specific needs of building owners, developers, and architects. The book is packed with broad-ranging material from fundamental principles to the state-of-the-art technologies and includes techniques thoroughly developed to be highly adaptable. Offering complete guidance, instructive examples, and color illustrations, the author develops several approaches for designing tall buildings. He demonstrates the benefits of blending imaginative problem solving and rational analysis for creating better structural systems.\n\n    * Hardcover: 989 pages\n    * Publisher: CRC Press; 1 edition (December 14, 2009)\n    * Language: English\n    * ISBN-10: 143980480X\n    * ISBN-13: 978-1439804803\t\t","torrent":{"xt":"urn:btih:935290011623c0331e7b378c71c1a2ee0f21a089","amp;dn":"Reinforced+Concrete+Design+of+Tall+Buildings+%5BRe+Upload%5D%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"935290011623c0331e7b378c71c1a2ee0f21a089","infoHashBuffer":{"type":"Buffer","data":[147,82,144,1,22,35,192,51,30,123,55,140,113,193,162,238,15,33,160,137]},"announce":[],"urlList":[]}}