{"title":"Sinfonietta Riga - Viatore [2008]","uid":5962585,"size":160952544,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:93882a6b7d107f2d5e6013751952232a4242378c&amp;dn=Sinfonietta+Riga+-+Viatore+%5B2008%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"okeans","files":9,"time":1290002139,"description":"&quot;Sinfonietta Riga&quot; is a new beginning with far-reaching opportunities for quality. Progress can be heard on a daily basis even though it takes time to establish a similar view of the orchestra's style and principles. We are gradually establishing our relationship and exploring styles. It is not easy to form a new orchestra from scratch, as everyone has to adapt - nevertheless, the &quot;Sinfonietta Riga&quot; musicians are driven by a desire to play, and that is what is most important. Youth is fascinating, as it compensates for so many other things - and these young musicians are passionate about what they are doing, without being stuck in a routine. Their energy is infectious and I feel much younger as a result. I enjoy working with these musicians and hope that I am able to do some good by encouraging them not to repeat the mistakes I have made in the past - and that is a fantastic feeling.\n\n\nPeteris Vasks is a composer with ethical and spiritual convictions. The ethical imperative of his works is that mankind must undertake responsibility for life on earth and for human spirituality. The destruction of nature - virtually the single universal problem of mankind - remains one of his essential themes, but has further developed to become transformed into a universal confrontation between good and evil, the spiritual and the material, between nature and culture, solitude and totality as well as between the worldly and the eternal. Vasks is a man of passion and frankness, and the contradictions of incompatible ethical notions are expressed in the emotional features of his music, which gives us an insight into a fantastic world of nature without borders and limitations.\n\nMP3 320 kbps","torrent":{"xt":"urn:btih:93882a6b7d107f2d5e6013751952232a4242378c","amp;dn":"Sinfonietta+Riga+-+Viatore+%5B2008%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93882a6b7d107f2d5e6013751952232a4242378c","infoHashBuffer":{"type":"Buffer","data":[147,136,42,107,125,16,127,45,94,96,19,117,25,82,35,42,66,66,55,140]},"announce":[],"urlList":[]}}