{"title":"New Radicals - Maybe You've Been Brainwashed Too","uid":4850779,"size":426979022,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9566612b4d59cfe0bbfb7a697593eafbcc955481&amp;dn=New+Radicals+-+Maybe+You%5C%27ve+Been+Brainwashed+Too+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"timlit","files":21,"time":1239863610,"description":"01. Mother We Just Can't Get Enough 05:46\n02. You Get What You Give 05:02\n03. I Hope I Didn't Just Give Away The Ending 06:36\n04. I Don't Wanna Die Anymore 04:16\n05. Jehova Made This Whole Joint For You 04:11\n06. Someday We'll Know 03:37\n07. Maybe You've Been Brainwashed Too 05:20\n08. In Need Of A Miracle 03:43\n09. Gotta Stay High 03:05\n10. Technicolor Lover 03:43\n11. Flowers 03:51\n12. Crying Like A Church On Monday 05:02\n\nBiography\nA pop-rock group that was formed in the late '90s but was heavily influenced by the rock and soul of the 1970s, the New Radicals are the creation of singer/producer/songwriter Gregg Alexander--a native of Grosse Point, MI (near Detroit). Growing up in Michigan, Alexander started listening to both rock and R&amp;B extensively as a child and was only 12 when he acquired his first electric guitar. After high school, he traveled around the U.S. and lived in both New York and Los Angeles. It was in L.A. that he formed the New Radicals, which signed with MCA in 1997 and soon got to work on Maybe You've Been Brainwashed Too--a 1970s-minded CD that came out in October 1998. Alexander did all of the producing and arranging and most of the songwriting on the promising album, which was the group's sole release -- after scoring the hit &quot;You Get What You Give,&quot; he disbanded the New Radicals to focus on production work.\n\nReview\nThe more things change in music, the more they stay the same. The alternative rockers of the 1990s may have caused so-called corporate rockers like Poison and Bon Jovi to become less visible, but at the same time, the worship of 1970s baby boomer culture was alive and well among post-baby boomers. In 1998, one of the most memorable examples of 1970s-flavored music came from the New Radicals. Although Radicals singer/leader Gregg Alexander was quick to espouse a left-wing point of view, Maybe You've Been Brainwashed Too doesn't beat listeners over the head with a sociopolitical agenda. Nor is the CD an exercise in angry 1990s angst rock. Rather, Alexander's band is a congenial and highly melodic throwback to the rock and blue-eyed soul of the early to mid-'70s. Alexander's vocals have a very Mick Jagger-ish quality, but while the Rolling Stones were a rock &amp; roll band that occasionally dabbled in soul and funk, the Radicals favor pop/rock that is consistently mindful of classic Northern soul. Hook-happy offerings like &quot;Jehovah Made This Whole Joint for You,&quot; &quot;Flowers,&quot; and &quot;Mother We Just Can't Get Enough&quot; give the impression that Alexander holds the Stones and the artists of Motown Records in equally high regard. Without question, Brainwashed was among the more promising releases of late 1998.\n\nEnjoy.\n","torrent":{"xt":"urn:btih:9566612b4d59cfe0bbfb7a697593eafbcc955481","amp;dn":"New+Radicals+-+Maybe+You%5C%27ve+Been+Brainwashed+Too+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9566612b4d59cfe0bbfb7a697593eafbcc955481","infoHashBuffer":{"type":"Buffer","data":[149,102,97,43,77,89,207,224,187,251,122,105,117,147,234,251,204,149,84,129]},"announce":[],"urlList":[]}}