{"title":"EnigmaT Set Rips { Cuts } - June 1st, 2014","uid":10280538,"size":1090033718,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:958d26dc9798593de7fbecbd233fde4cff52b787&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+June+1st%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":121,"time":1401690231,"description":"Adam Sobiech - Memories (ASOT 665 Rip)-enTc\nAkku - Fire In Your Tears (Dreamy Energetic Remix) (Cut From Lazarus Set)-enTc\nAlan Morris - Rebellion (Cut From Tyas Set)-enTc\nAlex van ReeVe &amp; Geert Huinink - Natalie (ASOT 665 Rip)-enTc\nAllen &amp; Envy &amp; Elles de Graaf - The Long Run (Original Mix) (Cut From Allen&amp;Envy Set)-enTc\nAMP - November Leaves (Cut From Defcon Set)-enTc\nAndrew Rayel - Followed By Light (ASOT 665 Rip)-enTc\nAndrew Rayel - Impulse (ASOT 665 Rip)-enTc\nAndrew Rayel - Latifa (ASOT 665 Rip)-enTc\nAndrew Rayel feat. Cindy Alma - Hold On To Your Love (Original Mix) (Set Rip)-enTc\nArisen Flame - Dimension Of Space (ASOT 665 Rip)-enTc\nArjuna Schiks - First Thought (Cut From Ruben Set)-enTc\nArkham Knights - Tomorrow's World (GDJB Rip)-enTc\nArmin van Buuren Feat. Lauren Evans - Alone (Thomas Newson Remix) (-SHORT- ASOT 665 Rip)-enTc\nArtifi - Far And Beyond (Original Mix) (Cut From Tero A Set)-enTc\nAtaraxia - Sunset Serenade (John Sunlight Remix) (Cut From Angel Ace Set)-enTc\nAyla - Ayla (Kent &amp; Gian Remix) (Cut From Tyas Set)-enTc\nBarzek - Dee Why (AlexZideyn Remix) (Cut From Defcon Set)-enTc\nBasement Jaxx - Never Say Never (Mark Knight Remix) (ABGT 081 Rip)-enTc\nBeatsole - Always Alone (ASOT 665 Rip)-enTc\nBeatsole - Leave Light (Original Mix) (Cut From Justian Set)-enTc\nBen Nicky - Air (Cut From Bukovski Set)-enTc\nBlood Groove &amp; Kikis vs. LTN - Both (Soarsweep 'Intelligent' Remix) (ASOT 665 Rip)-enTc\nBlood Groove &amp; Kikis vs. LTN - Both (Soarsweep Intelligent Remix) (GDJB Rip)-enTc\nBoy - Railway (Daniele Di Martino Remix) (Cut From Tiesto Set)-enTc\nCarlo Calabro - Loudest Silence (ASOT 665 Rip)-enTc\nChuckie &amp; LMFAO - Let The Bass Kick In Miami Bitch (Lucky Date &amp; Megaphonix Remix) (Cut From Hardwell Set)-enTc\nCiro Visone Vs. Santi Project - Dynamic Soul (Cut From Bukovski Set)-enTc\nCiro Visone Vs. Santi Project - Dynamic Soul (Original Mix) (Cut From Allen&amp;Envy Set)-enTc\nColdplay - A Sky Full of Stars (Nathan C Bootleg) (Cut From Omnia Set)-enTc\nColdplay - Magic (The Rejected 'Guilty Pleasure' Bootleg) (Cut From Concept Set)-enTc\nD-Eye - Night Run (Kobana Remix) (Cut From Ruben Set)-enTc\nDan B, Loud Lake &amp; Arnessi - Supernova (Original Mix) (Cut From Shah Set)-enTc\nDanilo Ercole - Little Planet (Christopher Vassilakis Remix) (Cut From Basil Set)-enTc\nDark Air - Polymorph (Cut From Lazarus Set)-enTc\nDash Berlin feat. Emma Hewitt - Waiting (RAM vs Driftmoon Remix) (Cut From RAM Set)-enTc\nDavid Forbes - Locations (ASOT 665 Rip)-enTc\nDavid Forbes - Polaroid (Radio Edit) (Cut From Forbes Set)-enTc\nDJ Madwave - Pleasure (Rene Ablaze &amp; Global Influence Remix) (Cut From Justian Set)-enTc\nDNNYD &amp; ZooFunktion - Mega Woo (Cut From Tiesto Set)-enTc\nDVBBS &amp; MOTi - This Is Dirty (Enzo Picardi Remix) (Cut From Tiesto Set)-enTc\nEsper Haddad &amp; Smart Wave - Amiss World (Eddie Lung &amp; DJ T.H. Instantly Remix) (Set Rip)-enTc\nEtherwood - Hold Your Breath (Spectrasoul Remix) (Cut From Omnia Set)-enTc\nEximinds - Stefanie (ASOT 665 Rip)-enTc\nEximinds feat. Chloe - Rescue Me (Sied Van Riel Remix) (Cut From Shah Set)-enTc\nFerry Tayle Feat. Poppy - The Way Back Home (Matt Bowdidge Remix) (Set Rip)-enTc\nGal Abutbul &amp; First Effect - Intruder (GDJB Rip)-enTc\nGareth Emery - I Will Be The Same (Heatbeat Bootleg Mix) (Set Rip)-enTc\nGeorge Kamelon - Green Valley (Cut From Lazarus Set)-enTc\nGouryella -Gouryella (Ram vs Philippe Remix) (Cut From RAM Set)-enTc\nHarry Romero - Rapture (GDJB Rip)-enTc\nIlluminor - Breaking Everything (Original Mix) (Cut From Forbes Set)-enTc\nJaco - Never Feel Alone (ABGT 081 Rip)-enTc\nJoey Dale - About The Drop Out (Cut From Hardwell Set)-enTc\nJohan Ekman - Never Change (Original Mix) (Cut From Angel Ace Set)-enTc\nJohan Gielen vs. Virtual Vault - Blue Fire (Markus Schulz Big Room Reconstruction) (GDJB Rip)-enTc\nJorn van Deynhoven &amp; Vitodito - Lazy Sundays (ASOT 665 Rip)-enTc\nKeemo &amp; Schild feat. Justin Hops - Revolution (Sunset Chill) (Cut From Shah Set)-enTc\nKinetica - Beginnings (Cut From Lazarus Set)-enTc\nKlaxons - Love Frequency (Tom Rowlands Remix) (Cut From Tiesto Set)-enTc\nLen Faki - Kraft und Licht (WellenrauschÂ´s Dark Matter Bootleg) (GDJB Rip)-enTc\nLeolife - Empathy (Cut From MIKE Set)-enTc\nLiam Wilson - The Speed Of Design (Original Mix) (Cut From Suckley Set)-enTc\nMaison &amp; Dragen - Nemesis (Cut From Bobina Set)-enTc\nMaor Levi - Pixel Hearts (ABGT 081 Rip)-enTc\nMariano Ballejos - Choripan (Pandora Remix) (Cut From Justian Set)-enTc\nMartin Libsen - Butterfly (Cut From Shah Set)-enTc\nMartin Sand - League of Assassins (GDJB Rip)-enTc\nMatt Chowski vs. Ward Tilt &amp; Lee Campbell - Ambush (Purple Stories Remix) (GDJB Rip)-enTc\nMatt Farmer - Transparent (Fher Vizzuett Christ Seeker Remix) (Cut From 9Axis Set)-enTc\nMax Freegrant - The Lone Warrior (ABGT 081 Rip)-enTc\nMichel Leroy feat. Collin McLoughlin - Get Lost (Original Mix) (Cut From Feel Set)-enTc\nMulla - No One (Cut From Tiesto Set)-enTc\nMyon &amp; Shane 54 - Under Your Cloud (Jaytech Remix) (ABGT 081 Rip)-enTc\nNeptune Project - Temple of Artemis (ASOT 665 Rip)-enTc\nNitrious Oxide feat. Aneym - Follow You (AWD Remix) (Cut From Palagano Set)-enTc\nNoMosk &amp; Roman Messer feat. Christina Novelli - Lost Soul (Original Mix) (Cut From Feel Set)-enTc\nNyx - Ida (Original Mix) (Cut From Angel Ace Set)-enTc\nOdonbat &amp; Luuya - Red Knight (Sunset Remix) (ASOT 665 Rip)-enTc\nOmnia - ID (Cut From Omnia Set)-enTc\nOrjan Nilsen &amp; Cosmic Gate - Fair Game (ASOT 665 Rip)-enTc\nOsireion - What About You (Original Mix) (Cut From 9Axis Set)-enTc\nPorter Robinson - Sad Machine (Cut From Omnia Set)-enTc\nPurelight - Outrun (Cut From Bobina Set)-enTc\nQubicon feat. Laura V. - Sad Eyes (Cut From Hardwell Set)-enTc\nReOrder &amp; Driftmoon - Together We Are Not Afraid (Original Mix) (Cut From Allen&amp;Envy Set)-enTc\nRoman Messer feat. Ange - Imagination (Adam Navels Massive Air Remix) (Cut From Allen&amp;Envy Set)-enTc\nRoman Messer feat. Ange - Imagination (Cold Rush Remix) (Cut From Bukovski Set)-enTc\nRune RK - Calabria (Firebeatz 2014 Remake) (Cut From Tiesto Set)-enTc\nRya &amp; Manida vs. M3rt - Hopeful Days (Beatsole Remix) (Cut From Feel Set)-enTc\nRya &amp; Manida vs. M3Rt - Hopeful Days (Cut From Team140 Set)-enTc\nSam Smith - Stay With Me (Florian Paetzold Edit) (Cut From Shah Set)-enTc\nSean Paul - Get Busy (Landis Bootleg) (Cut From Quintino Set)-enTc\nShermanology &amp; John Christian &amp; Oliver Rosa - Pinball (Cut From Hardwell Set)-enTc\nSilica - Hemisphere (Dark Air Remix) (Cut From Lazarus Set)-enTc\nSilvernova - Lose Everything (Original Mix) (Cut From Danny Oh Set)-enTc\nSolid Stone pres. Diversion - Dustforce (Cut From Ruben Set)-enTc\nSolid Stone pres. Diversion - Wear &amp; Tear (Cut From Ruben Set)-enTc\nSoundprank - Gemini (ABGT 081 Rip)-enTc\nStella Project - Fire &amp; Ace (Original Mix) (Cut From Angel Ace Set)-enTc\nStella Project - Fire &amp; Ace (Original Mix) (Cut From Justian Set)-enTc\nSteve Morley - Rain From Heaven (Cut From Lazarus Set)-enTc\nSunset Heat &amp; Sunstar pres. Devious Minds - Into Her Eyes (KAYAT Remix) (Set Rip)-enTc\nSuplifth - Victory (Original Mix) (Cut From 9Axis Set)-enTc\nSuplifth - Victory (Original Mix) (Cut From Sty Set)-enTc\nTasso - Sun Scar (Cut From Lazarus Set)-enTc\nTeamsports - It's Okay (Original Mix) (Cut From Concept Set)-enTc\nThe Blizzard &amp; Yuri Kane feat. Relyk - Everything About You (NuWord Remix) (Cut From Feel Set)-enTc\nTiesto - Wasted (R3hab Remix) (Cut From Quintino Set)-enTc\nTrancEye - Starway (Hiroki Nagamine Remix) (Cut From Angel Ace Set)-enTc\nUla - Open Your Eyes (BluSkay Remix) (Cut From Angel Ace Set)-enTc\nVanity In Mind - Go Get Alice (Make One Remix) (Cut From Team140 Set)-enTc\nVictor Steff - Magellanic Cloud (Original Mix) (Cut From 9Axis Set)-enTc\nWellenrausch - City in Flame (GDJB Rip)-enTc\nWellenrausch - Dream Within a Dream (GDJB Rip)-enTc\nWellenrausch - These Moments (GDJB Rip)-enTc\nX-Cite - Highway (GDJB Rip)-enTc\nY-Traxx - Mystery Land (Chris Cockerill 2014 Bootleg) (Cut From Suckley Set)-enTc\nYuri Kane &amp; Melissa Loretta - Saved You (ASOT 665 Rip)-enTc\nZahir - Hoshymuia (Original Mix) (Cut From Sty Set)-enTc\nZahir - Hoshymuia (Vitaly Otto Remix) (Cut From Sty Set)-enTc\n","torrent":{"xt":"urn:btih:958d26dc9798593de7fbecbd233fde4cff52b787","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+June+1st%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"958d26dc9798593de7fbecbd233fde4cff52b787","infoHashBuffer":{"type":"Buffer","data":[149,141,38,220,151,152,89,61,231,251,236,189,35,63,222,76,255,82,183,135]},"announce":[],"urlList":[]}}