{"title":"Flyleaf-Flyleaf-(Retail)-2004-HHI","uid":6940513,"size":18765351,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:95c9c9b03e0399d0fc9ca1fd6a2b758cf0c34947&amp;dn=Flyleaf-Flyleaf-%28Retail%29-2004-HHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"raidy","files":7,"time":1325994344,"description":"Artist......: Flyleaf \n Album.......: Flyleaf \n Grabber : EAC \n Encoder : LAME v3.90.3 \n Release Date: Nov-2004 \n Rip Date....: Nov-18-2004 \n Genre.......: Rock \n Quality : VBRkbps / 44.1kHz / Joint-Stereo \n Playtime : 12:04 min \n Ripper : Happy Hacker Industries \n Supplier : HHI \n CD Songs : 04 \n Label.......: Octane Records \n Album Info..: \n \n About Flyleaf \n Out of the small, quiet town of Temple, Texas emerges a rock band that is about to  take the world by storm. Fronted by Lacey Mosley, FLYLEAF is comprised of members James Culpepper on drums, Sameer Bhattacharya and Jared Hartmann on guitar, and Pat Seals rounding out their sound on bass. Not just your average angry rockers, this fresh and innovative group cites influences such as Rage Against the Machine, Incubus, Nirvana and Foo Fighters. FLYLEAF is a hybrid of both the music of their influences and a sound crafted by their own personal passions. FLYLEAF'S music is probably best described by Lacey herself. ÃƒÂ´Our music is passionate and on purpose. Its angry and sad and urgent and loving. It's about our experiences and passions and how we have overcome. Our message is to encourage the hopeless people to have hope, and the apathetic people to stand up in their destinies and purposes and believe in  something good and world changing. FLYLEAF'S music is filled with pathos and optimism all in one breath. When watching this band perform, it's hard to see how one could not be inspired. Since forming the band, they have played every major city in Texas and have headlined for thousands of fans in Dallas, Houston, Austin, and of course, their hometown of Temple. They've also opened for national acts such as Evanescence, Bowling For Soup, Riddlin' Kids, and Flickerstick. Flyleaf just finished up dates with Trust Company and the Family Picnic Tour, and are heading out soon with Saliva and Earshot! \n \n Ed's Note: One of our suppliers picked this up during the Show at Rafter's in Johnson city, TN; This CD is their first; and really only includes 4 tracks. :( \n \n Track Listing....: \n 01.Red sam [03:22] \n 02.Breathe today [02:56] \n 03.I'm sorry [02:47] \n 04.Cassie [02:59] \n ____ \n \n 12:04 min \n 17,9 MB","torrent":{"xt":"urn:btih:95c9c9b03e0399d0fc9ca1fd6a2b758cf0c34947","amp;dn":"Flyleaf-Flyleaf-%28Retail%29-2004-HHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95c9c9b03e0399d0fc9ca1fd6a2b758cf0c34947","infoHashBuffer":{"type":"Buffer","data":[149,201,201,176,62,3,153,208,252,156,161,253,106,43,117,140,240,195,73,71]},"announce":[],"urlList":[]}}