{"title":"Wernher von Braun [ebook].","uid":6114911,"size":115978996,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95fc32ba68801acee34f52d9feb288323c3f6bc6&amp;dn=Wernher+von+Braun+%5Bebook%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1295513128,"description":"Wernher von Braun constituye una figura clave en el desarrollo tecnolÃƒÂ³gico del siglo xx. Fue un personaje deslumbrante que desde una temprana edad fijÃƒÂ³ su meta en que el hombre viajara a otros mundos. Pero la difÃƒÂ­cil situaciÃƒÂ³n que atravesaba su paÃƒÂ­s, la Alemania de la dÃƒÂ©cada de 1930, le obligÃƒÂ³ a colaborar en el esfuerzo bÃƒÂ©lico de los nazis para conseguir la hegemonÃƒÂ­a en Europa. Ello supuso un desarrollo vertiginoso de nuevas armas voladoras destinadas a aplastar a la Ã‚Â«pÃƒÂ©rfida AlbiÃƒÂ³nÃ‚Â».\n\nA pesar de su turbio pasado en las SS y un papel predominante en la creaciÃƒÂ³n de los misiles V-2 para mayor gloria del Tercer Reich, supo jugar muy bien sus cartas y abandonar una Europa en ruinas para poder continuar persiguiendo su sueÃƒÂ±o espacial en Estados Unidos. Suyo es el mÃƒÂ©rito de haber sido el principal diseÃƒÂ±ador del cohete Saturn V con el que el hombre llegÃƒÂ³ a la Luna en 1969.\n\n\n\nSi bien Wernher von Braun afirmÃƒÂ³ toda la vida que la polÃƒÂ­tica no era de su interÃƒÂ©s, lo cierto es que la controversia en torno a su pasado nunca le abandonÃƒÂ³; ni siquiera tras su muerte. Con todo, siempre serÃƒÂ¡ recordado tal y como lo definiÃƒÂ³ un periÃƒÂ³dico inglÃƒÂ©s con motivo de su fallecimiento en 1977, como Ã‚Â«el hombre que nos dio la LunaÃ‚Â».","torrent":{"xt":"urn:btih:95fc32ba68801acee34f52d9feb288323c3f6bc6","amp;dn":"Wernher+von+Braun+%5Bebook%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95fc32ba68801acee34f52d9feb288323c3f6bc6","infoHashBuffer":{"type":"Buffer","data":[149,252,50,186,104,128,26,206,227,79,82,217,254,178,136,50,60,63,107,198]},"announce":[],"urlList":[]}}