{"title":"Ghost Rider (2006-2009)(1-35)(complete)(Digital) (Monafekk-Empir","uid":9422688,"size":574252295,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:96c0df86bcb9dcbaac3982f9b2e4cac9a0532fcb&amp;dn=Ghost+Rider+%282006-2009%29%281-35%29%28complete%29%28Digital%29+%28Monafekk-Empir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1388618826,"description":"Ghost Rider is the name of several fictional supernatural antiheroes appearing in comic books published by Marvel Comics. Marvel had previously used the name for a Western character whose name was later changed to Night Rider and subsequently to Phantom Rider.\n\nThe first supernatural Ghost Rider is stunt motorcyclist Johnny Blaze, who, in order to save the life of his mentor, agreed to give his soul to &quot;Satan&quot; (later revealed to be an arch-demon named Mephisto). At night and when around evil, Blaze finds his flesh consumed by hellfire, causing his head to become a flaming skull. He rides a fiery motorcycle and wields trademark blasts of hellfire from his skeletal hands. He eventually learns he has been bonded with the demon Zarathos. Blaze starred in the series from 1972-1983. The subsequent Ghost Rider series (1990-1998) featured Danny Ketch as a new Ghost Rider. After his sister was injured by ninja gangsters, Ketch came in contact with a motorcycle that had somehow been mystically enchanted to contain the essence of a Spirit of Vengeance. Blaze reappeared in this 1990s series as a supporting character. In 2000s comics, Blaze again became the Ghost Rider, succeeding Ketch. Robbie Reyes will be the new Ghost Rider for Marvel NOW.\n\nThis pack contains the 35 issue run that started in 2006 and ended in 2009\n\n","torrent":{"xt":"urn:btih:96c0df86bcb9dcbaac3982f9b2e4cac9a0532fcb","amp;dn":"Ghost+Rider+%282006-2009%29%281-35%29%28complete%29%28Digital%29+%28Monafekk-Empir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96c0df86bcb9dcbaac3982f9b2e4cac9a0532fcb","infoHashBuffer":{"type":"Buffer","data":[150,192,223,134,188,185,220,186,172,57,130,249,178,228,202,201,160,83,47,203]},"announce":[],"urlList":[]}}