{"title":"Gantz [Manga Ita Cbr] vol. 01-37 [TNT Village]","uid":12747361,"size":2857003320,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:97a7a3a6209c030525d6e55dc337abd7ae1943e1&amp;dn=Gantz+%5BManga+Ita+Cbr%5D+vol.+01-37+%5BTNT+Village%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"turchez90","files":38,"time":1447328387,"description":".:Locandina:.\r\n\r\n[img]http://i.imgur.com/RVfkIRQ.jpg[/img]\r\n\r\n.:Scheda:.\r\n\r\nAutore: Hiroya Oku\r\nTitolo Originale: Gantsu\r\nTitolo: Gantz\r\nTipologia: Manga\r\nPagine: 170~210 pagine ciascun volume \r\nVolumi: 37\r\nAnno: 2000-2013\r\nNazionalità: Giappone\r\nGenere: Seinen\r\nLingua: Italiano\r\nDimensione del file: 2,6 Gb\r\nFormato del file: CBR (JPG)\r\n\r\n.:Trama:.\r\n\r\nKei Kurono, un ragazzo egoista ed insicuro, e Masaru Kato, suo amico di infanzia sono travolti da un treno della metropolitana nel tentativo di salvare la vita di un barbone ubriaco caduto sulle rotaie. Invece di morire una copia dei loro corpi viene &quot;richiamata&quot; in un appartamento spoglio da cui è visibile la Tokyo Tower. I due si accorgono di non essere soli nella stanza, ma che vi sono altre persone, tutte appena morte nei più svariati modi. Inoltre le porte dell’appartamento sono chiuse e il gruppo non può andarsene.\r\n\r\nPoco dopo una misteriosa sfera nera nota come Gantz, posta in un angolo della sala, si attiva, rivelando al suo interno una figura umana nuda con una maschera d'ossigeno sulla faccia e apparentemente assopita. Nella sfera sono contenuti diversi equipaggiamenti: una tuta nera fatta su misura per ciascuna persona presente, che dona al portatore forza, resistenza e velocità sovrumane, un controller, che funziona da radar e tre diversi tipi di armi. Quando la sfera si apre, appare un testo in verde sulla sua superficie esterna, che informa i presenti che le loro vite sono finite e che appartengono a &quot;lui&quot;. A ognuno dei gantzer è assegnata una missione che consiste nello stanare e uccidere degli &quot;alieni target&quot;, e teletrasporta i gantzer nel luogo della caccia. Con poche informazioni a disposizione e una notevole dose di perizia, soprattutto da parte di Kei, il gruppo sopravvive alle prime due missioni, perdendo solo qualche membro. Durante la terza, tuttavia, l'intero gruppo viene decimato dal boss, incluso Masaru, e solo Kei riesce a tornare vivo all'appartamento. Nel prosieguo della storia attorno a Kei si forma un nuovo gruppo di gantzer, mentre il giovane lotta strenuamente per tenere in vita i suoi compagni e liberarsi dal gioco.\r\n\r\nDopo molte missioni Joichiro Nishi, un giovane gantzer della squadra di Tokyo, esperto conoscitore del gioco, rivela al gruppo il contatore di &quot;Katastrophe&quot;, un conto alla rovescia al termine del quale ci sarà un grande cataclisma, dagli effetti ancora sconosciuti. I partecipanti vengono liberati dal gioco, e una settimana dopo un'imponente orda aliena invade la Terra e comincia lo sterminio della razza umana, mentre Kei e i suoi compagni fanno del loro meglio per usare l'equipaggiamento di Gantz contro la forza d'invasione. Il team di Tokyo entra in contatto con altre squadre di gantzer di tutto il mondo, e con una nuova specie extraterrestre, che si rivela essere colei che ha armato l'umanità con la tecnologia di Gantz, necessaria a difendersi dall'invasione aliena. I cacciatori riescono dopo una serie di battaglie ad avere la meglio sull'esercito alieno, ma in ultimo disperato tentativo, il capo delle forze aliene minaccia di autodistruggere l'astronave madre schiantandola contro la Terra se Kei non si fosse presentato a combattere contro di lui. Nello scontro, trasmesso in diffusione mondiale, Kei riesce ad uccidere l'avversario con l'aiuto di Masaru, e i due fanno ritorno sulla Terra, accolti rispettivamente dalla ragazza Tae e dal fratello Ayumi.\r\n\r\n.:Screenshots:.\r\n\r\n[img]http://i.imgur.com/KqyDjCK.jpg[/img]\r\n\r\n[img]http://i.imgur.com/rfFfHmA.jpg[/img]","torrent":{"xt":"urn:btih:97a7a3a6209c030525d6e55dc337abd7ae1943e1","amp;dn":"Gantz+%5BManga+Ita+Cbr%5D+vol.+01-37+%5BTNT+Village%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97a7a3a6209c030525d6e55dc337abd7ae1943e1","infoHashBuffer":{"type":"Buffer","data":[151,167,163,166,32,156,3,5,37,214,229,93,195,55,171,215,174,25,67,225]},"announce":[],"urlList":[]}}