{"title":"(Milestones in Drug Therapy) - Influenza Virus Sialidase - A Dru","uid":11156574,"size":2399783,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9984aa99b6d192e9c9c159e7b05de53a34c521e2&amp;dn=%28Milestones+in+Drug+Therapy%29+-+Influenza+Virus+Sialidase+-+A+Dru&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vickey1992","files":1,"time":1412437527,"description":"Book: Influenza Virus Sialidase - A Drug Discovery Target\nAuthor: Mark von Itzstein\nInfluenza continues to be an ongoing problem despite the existence of vaccines and drugs. Disease outbreaks can occur relatively quickly as witnessed with the recent emergence of the influenza virus A/H1N1 pandemic. The development of new anti-influenza drugs is thus a major challenge. This volume describes all aspects of the virus structure and function relevant to infection. The focus is on drug discovery of inhibitors to the enzyme sialidase, which plays a key role in the infectious lifecycle of the virus. Following an overview of the influenza virus, the haemagglutinin, the interactions with the cell receptors and the enzymology of virus sialidase, recent results in drug design are presented. These include a full coverage of the design, synthesis and evaluation of carbohydrate as well as non-carbohydrate influenza virus sialidase inhibitors. Further reviews of the clinical experience with influenza virus sialidase inhibitors and of the development of resistance to these inhibitor drugs complement the topic..\n\n\nCopyright to the respective owners.If you like this book then please buy it.\nSharing is caring,Seed this torrent so others could enjoy it too","torrent":{"xt":"urn:btih:9984aa99b6d192e9c9c159e7b05de53a34c521e2","amp;dn":"%28Milestones+in+Drug+Therapy%29+-+Influenza+Virus+Sialidase+-+A+Dru","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9984aa99b6d192e9c9c159e7b05de53a34c521e2","infoHashBuffer":{"type":"Buffer","data":[153,132,170,153,182,209,146,233,201,193,89,231,176,93,229,58,52,197,33,226]},"announce":[],"urlList":[]}}