{"title":"Alter Bridge - Blackbird (2007) [EAC-FLAC]","uid":4211042,"size":448757654,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9b3a2d47d5a28c66cba6454110037c40a4a21e0d&amp;dn=Alter+Bridge+-+Blackbird+%282007%29+%5BEAC-FLAC%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Sworduigi","files":5,"time":1212073948,"description":"Extractor: EAC 0.99 prebeta 4 \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD\nArtwork: Front (Web Found).\n\n\nGeneral Info:\n\nTracklist:\n\n1 Ties That Bind&quot; - 3:19\n2 &quot;Come to Life&quot; - 3:51\n3 &quot;Brand New Start&quot; - 4:54\n4 &quot;Buried Alive&quot; - 4:35\n5 &quot;Coming Home&quot; - 4:19\n6 &quot;Before Tomorrow Comes&quot; - 4:06\n7 &quot;Rise Today&quot; - 4:21\n8 &quot;Blackbird&quot; - 7:58\n9 &quot;One by One&quot; - 4:20\n10 &quot;Watch Over You&quot; - 4:19\n11 &quot;Break Me Down&quot; - 3:56\n12 &quot;White Knuckles&quot; - 4:24\n13 &quot;Wayward One&quot; - 4:47\n\n\n\n              LINE UP:\n\n    * Myles Kennedy - Lead Vocals, Rhythm Guitar\n    * Mark Tremonti - Lead Guitar, Backing Vocals\n    * Scott Phillips - Drums, Percussion\n    * Brian Marshall - Bass\n\n\nReview taken from dustinmyers.com:\nAlter Bridge, a relatively new band seen from the eyes of the uninformed, is actually anything but. Made up of 3 of the former members of one of the most popular, and almost as equally hated bands in history, Creed, they consist of Mark Tremonti (Guitar)/Myles Kennedy (Vocals)/Scott Phillips (Drums)/ and Brian Marshall(Bass).\nThe singer Myles Kennedy has replaced Scott Stapp as the vocalist, and as a result has changed the sound of this already great band drastically. Myles?s voice fits perfectly with Mark Tremonti?s writing style, the high pitched singer takes the already soaring melodies to a new height and punches through the thick mix of Mark?s very distinct guitar ensembles with ease.Their debut release ?One Day Remains? was a relative success, even with a seeming lack of any real push by their label at the time, Windup Records.\nThey have since left Windup to sign with Universal Republic, which seem to already be doing a better job with promotion of the band. Blackbird, the sophomore release jumps out of the gates hard doesn?t seem to ever want to let up until well into the 10th track. Clearly trying to send a message with ?Ties That Bind? as the first track, the hard hitting, borderline metal piece certainly separates the sound from anything Creed-esq, something the band has tried to do since day one of their inception.\nAnd while Blackbird certainly has metal wings to fly on, the presence of excellently crafted melodies both vocally and musically lift this album to new heights.\nThose creative juices seem to flow hardest in the middle of Blackbird with the very radio-friendly ?Before Tomorrow Comes?, ?Rise Today?, and ?One By One?.\nOne song that immediately stands out when looking track length alone, is the title track ?Blackbird?. Taking up 7:58, the ballad about the loss of a good friend of Myles Kennedy, takes nearly 8 minutes from your life and leaves you wanting to give up more. It?s rare to find a song at even half it?s length that is so well arranged and sonically seductive. The dark and emotional song has a surprisingly uplifting effect, a feeling often conveyed with Tremonti and Kennedy?s writing.\nThis band has clearly taken another step in the right direction in separating themselves from the Creed stigma with Blackbird. Maybe with their 3rd release these reviews will no longer have to start off by mentioning they are formerly known as Creed, with a new front-man. They have certainly crafted a different, harder sound while never abandoning the melodic glue that sticks their songs in our heads and keeps us coming back for more.\n ","torrent":{"xt":"urn:btih:9b3a2d47d5a28c66cba6454110037c40a4a21e0d","amp;dn":"Alter+Bridge+-+Blackbird+%282007%29+%5BEAC-FLAC%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b3a2d47d5a28c66cba6454110037c40a4a21e0d","infoHashBuffer":{"type":"Buffer","data":[155,58,45,71,213,162,140,102,203,166,69,65,16,3,124,64,164,162,30,13]},"announce":[],"urlList":[]}}