{"title":"El arte de la seducción femenina","uid":13338462,"size":7812942,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c043761fe5cc42f588557f6ae04de0e36bf6f2b&amp;dn=El+arte+de+la+seducci%26oacute%3Bn+femenina&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bethsho","files":1,"time":1454003900,"description":"\n\r\n\r\nPues descargar el libro directamente de ésta página. La app te dirige a dicha página pero incluye mis datos de contacto por si tienes alguna duda o pregunta. \r\n\r\n\r\nDescripción:\r\n\r\n\r\nTe aseguro que no estás solo en esto. Es difícil aceptarlo pero existen personas, ya sea por apariencia o personalidad, que simplemente no saben cómo comportarse frente a una mujer. Se sienten tan nerviosos e inseguros que ni si quiera pueden hablar, otros que no saben cuándo deben iniciar el contacto, otros que simplemente quieren saber cómo conquistar a una mujer y hacerla feliz.\r\n\r\nYo era uno de esos, me sentía perdido y deprimido, pero principalmente me sentía solo. Todo eso cambió un día, decidí que era suficiente y a través de diversos medios comencé a informarme e investigar pero principalmente a preguntar a mujeres ¿qué es lo que ellas quieren? ¿Qué buscan? Llegué a diversas conclusiones pero aun así yo mismo era escéptico ante la evidencia. Mi personalidad y mi educación me impedían ver la verdad.\r\n\r\nSolamente había una forma de averiguarlo y era experimentando, y adivinen qué, era verdad. Al final las mujeres dejaron de ser un misterio y entendí qué es lo que esperan de nosotros. Pero no te voy a engañar, no todo es tan fácil como un par de consejos y salir a conquistar chicas. En el libro verás que se necesita más que eso, necesitas esfuerzo y dedicación. Pero al final vale la pena tener a tu lado una mujer hermosa que te haga feliz y tú a ella","torrent":{"xt":"urn:btih:9c043761fe5cc42f588557f6ae04de0e36bf6f2b","amp;dn":"El+arte+de+la+seducci%26oacute%3Bn+femenina","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c043761fe5cc42f588557f6ae04de0e36bf6f2b","infoHashBuffer":{"type":"Buffer","data":[156,4,55,97,254,92,196,47,88,133,87,246,174,4,222,14,54,191,111,43]},"announce":[],"urlList":[]}}