{"title":"Coast to Coast Am June 23, 2013 - Suppressed Stories","uid":8636257,"size":58042697,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9c3ffbe9d9fd287639950fe2f442ecc9d4a37fdd&amp;dn=Coast+to+Coast+Am+June+23%2C+2013+-+Suppressed+Stories&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1372755624,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-23-13\nHost:\nGeorge Knapp\nGuests:\nKris  Millegan,                   Amy Waters Yarsinske\nIn the first half of the program, George Knapp was joined by, publisher of suppressed works, Kris Millegan, who talked about the secret forces controlling the planet and how they exercise their power while keeping their presence shrouded in secrecy. He contended that secret societies derive their power by exerting control over a three-tiered system with three parts contained in each level. The top tier of this power base, he said, consists of &quot;mining, metal, and money&quot; followed by &quot;guns, drugs, and oil.&quot; Comprising the final level, he claimed, is control over the media, using &quot;magic&quot; as a means &quot;to make us think something else is going on,&quot; and, finally, &quot;mass trauma&quot; in the form of psychological warfare on the populace. Ultimately, Millegan asserted that the agenda behind the power brokers is to slowly and secretly turn America into a corporate empire rather than a democratic republic. \nExtrapolating on how this system of power consolidation works, Millegan alleged that controlling the illegal drug trade is a key factor in many military campaigns and is used to reap massive amounts of wealth for the elite. This money, he said, is then used to purchase media companies and, thus, they can manipulate the messages that are told to the general public. To that end, he expressed skepticism about media stories which are said to be revelatory about these power brokers and suggested that such reports are part of a psychological process to weaken the resolve of the citizenry. Additionally, he pointed to &quot;meme warfare,&quot; where alternative research groups, like the 9/11 Truth Movement, are hampered by false clues and incorrect evidence as a means of stifling investigation into the overarching conspiracy of global control.  \n-------------------------------------- \nIn the second half, Amy Waters Yarsinske, a former naval intelligence officer, discussed the incredible story of denial, deceit, and deception that ultimately cost Navy pilot Captain Michael Scott Speicher his life after the government left him behind in Iraq during the first Gulf War. She traced the story back to 1991, when Speicher's air squadron was flying over Iraq. As a result of friendly fire due to complications with the jet, Speicher crashed in the desert, but managed to safely eject from the craft. Despite having U2 imagery of the downed craft and knowledge that Speicher had been ejected, Yarsinske lamented that CIA and military officials made a &quot;conscious decision&quot; to not rescue him. She suggested that the decision was borne out of a desire to keep him from talking about being shot down by friendly fire as well as an effort to maintain the public perception that the early air missions had been a complete success.  \nAccording to Yarsinske's research, Speicher followed all of the steps to signal that he had survived the crash and needed help. However, since aid did not arrive, he took refuge with a group of sympathetic Bedouins and lived with them for nearly four years. During this time, attempts were made by an intelligence asset within Iraq to help rescue Speicher, but the U.S. State Department and DoD &quot;wanted nothing to do with this.&quot; In 1995, she said, Saddam Hussein's intelligence forces found Speicher amongst the Bedouins and captured him, while also slaughtering the entire tribe for having protected him. Following that, Speicher was secretly held captive by the Iraqi government until it fell during the second Gulf War and a handful of his bones were discovered in the desert under suspicious circumstances. \nWebsite(s):\n trineday.com\n amywatersyarsinske.com\nBook(s):\n An American in the Basement\n No One Left Behind\n Fleshing Out Skull &amp; Bones: Investigations into America's Most Powerful Secret Society\n","torrent":{"xt":"urn:btih:9c3ffbe9d9fd287639950fe2f442ecc9d4a37fdd","amp;dn":"Coast+to+Coast+Am+June+23%2C+2013+-+Suppressed+Stories","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c3ffbe9d9fd287639950fe2f442ecc9d4a37fdd","infoHashBuffer":{"type":"Buffer","data":[156,63,251,233,217,253,40,118,57,149,15,226,244,66,236,201,212,163,127,221]},"announce":[],"urlList":[]}}