{"title":"3 Inches Of Blood - Fire Up The Blades (FLAC)","uid":3732065,"size":548865883,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9c7497ead070dc0cb8d4d15b4b32d985629ea7b3&amp;dn=3+Inches+Of+Blood+-+Fire+Up+The+Blades+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neonblack77","files":18,"time":1183518106,"description":"Full-length, Roadrunner Records\nJune 26th, 2007 \t\n[IMG]http://i137.photobucket.com/albums/q227/neonblack78/AlbumArt-6.jpg[/IMG]\t\nProduced by Joey Jordison\nWritten and arranged by 3 Inches of Blood &amp; Joey Jordison\n\nLine-up:\nCam Pipes - Clean Vocals\nJamie Hooper - Screams\nShane Clark - Guitar, Keyboards, Piano\nJustin Hagberg - Guitar\nNick Cates - Bass\nAlexei Rodriguez - Drums\n\n1.\tThrough The Horned Gate\t02:07\t\n2.\tNight Marauders\t04:15\t\n3.\tThe Goatriders Horde\t04:13\t\n4.\tTrial Of Champions\t03:39\t\n5.\tGod Of The Cold White Silence\t04:24\t\n6.\tForest King\t05:16\t\n7.\tDemons Blade\t04:10\t\n8.\tThe Great Hall Of Feasting\t03:53\t\n9.\tInfinite Legions\t04:55\t\n10.\tAssassins Of The Light\t03:20\t\n11.\tBlack Spire\t05:23\t\n12.\tThe Hydra&amp;#039;s Teeth\t04:49\t\n13.\tRejoice In The Fires Of Man&amp;#039;s Demise\t01:32\t\n\nTotal playing time\t51:56\n\nOld School Thrash and Power with Modern Mentality - 96%\nWritten by darkreif on June 7th, 2007\n\n3 Inches of Blood&amp;#039;s last album, Advance and Vanquish, made my list for one of the best metal albums of 2004 so it&amp;#039;s needless to say that I had very high expectations out of Fire Up the Blades. When we received their new album in the radio station I work at I couldn&amp;#039;t have been more excited and scared in my life. Was it going to put their other material to shame? Or were they going to be one of those bands that hit their mark and never quite get there again?\n\nFire Up the Blades didn&amp;#039;t let me down. Already a very high chance of making my top ten albums of 2007, Fire Up the Blades is everything I expected from the Canadian group and more. An explosive blending of thrash and power metal circa 1986 with a modern production style and flair. Fire Up the Blades takes off right where Advance and Vanquish left off and literally &quot;fires up the blades.&quot;\n\nThe guitar work is amazing dueling parts that often criss cross and trade off with each other. Riffs and leads are easily switched by the two players and their chemistry (despite the revolving door of members in the band in the past few years) is cohesive with the band and the music. The riffs are monstrous with a guitar tone similar to the thrash bands of 20 years ago. Speed and technicality are the keys to the guitar work and not too much groove is going to be found in the music (except for &quot;Great Hall of Feasting&quot;). The leads and solos are all about melody over the riffs and at times are amazingly catchy. The mix of power metal and thrash metal guitar writing gives the album a very melodic yet aggressive side that few bands manage to accomplish.\n\nThe bass and drum work follow in the same idea as the rest of the album - speed and technicality are the focus. The drums are a tad bit loud for the album for my tastes. I figure its because Slipknot drummer, Joey Jordison produced the album that a lot of the focus is drawn to the drums. But the drums are quite well written and well played. The bass parts are a little hard to pick out of the mix but once one finds an ear for them its very well done bass work. Nothing too fancy but fast and heavy.\n\nHaving two singers in a band is either a blessing or a curse. In the case of 3 Inches of Blood - its a blessing. Both singers are good but not great. Neither have amazing range but combined we have both worlds. There are harsh vocals intermixed with falsetto screams. The combination is going to bring in newer metal heads (harsh barking vocals) and the older fans (falsetto vocals) so that Fire Up the Blades will appeal to everyone. The harsh vocals have a stronger role this time around in the mix without much danger to the music.\n\nThe lyrical content of Fire Up the Blades is that of older metal. Let&amp;#039;s sing about warriors, battle, Vikings, evil vs. good, and the greatness of metal. Manowar eat your heart out. 3 Inches of Blood are here to take the reigns of older metal and bring it into the new age.\n\nFire Up the Blades is nothing new to fans of 3 Inches of Blood - same concepts but with a little bit more speed to the mix. Metalheads are either going to love it or hate - with not much in between.\n\nSongs to check out: Goatrider&amp;#039;s Horde, God of Cold White Silence, The Hydra&amp;#039;s Teeth.","torrent":{"xt":"urn:btih:9c7497ead070dc0cb8d4d15b4b32d985629ea7b3","amp;dn":"3+Inches+Of+Blood+-+Fire+Up+The+Blades+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c7497ead070dc0cb8d4d15b4b32d985629ea7b3","infoHashBuffer":{"type":"Buffer","data":[156,116,151,234,208,112,220,12,184,212,209,91,75,50,217,133,98,158,167,179]},"announce":[],"urlList":[]}}