{"title":"The Upperfloor--tUF-34212 Lyla Storm, Kristine Kahill and Mickey","uid":9202526,"size":3102894277,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:9d0eebd64cef2a30d7b5b3a66ba9e1aa3d81dc70&amp;dn=The+Upperfloor--tUF-34212+Lyla+Storm%2C+Kristine+Kahill+and+Mickey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1384621233,"description":"\nAnal Punishment and Demotion of a House Slave\n\nNov 15, 2013 - Performers: Mickey Mod ,  Lyla Storm  and  Kristine Kahill \n\n \nMP4 only.\n  \n\nSenior house slave Lyla Storm is held in the highest regard as a shinning example of everything the House has to offer: Discipline, Duty, and Dedication to Service. Not to mention she can suck the chrome off a trailer hitch, and orgasm from doing so. However, when she is put in charge of the novice slave girl, Kristine Kahill, it becomes clear to the Household that Slave Storm is not all we thought she was. \n\nStrike One: Kahill embarrasses the House when she is unable to recite the three House rules, Honorific, Eyeline and Deportment. Slave Storm is punished and given her first strike for Kahill's failure. Storm is ordered to teach the underling to suck cock like an Upper Floor slave should. The long two girl blowjob is sloppy and deep as the two horny sluts gag each other on the thick hard cock over and over again till Kahill gets it right. \n\nStrike Two: Kahill makes a fool of us again when she is unable to present herself properly for a reward. Slave Storm is stripped of her stockings and garters for Kahill's second failure. The two slaves are order to climb on top of a rock hard dick and take turns fucking it reverse cowgirl style till their thighs are so burned out from pumping it that they cannot stand up. \n\nStrike Three: Slave Storm reveals that she herself does not even remember the rules or the required House positions! She is berated, dressed down and stripped of her House Leathers. The House stands completely embarrassed by the lack of discipline this eve, and we have nothing left to off except Lyla Storms Anal Punishment. \n\nStorm is no longer a House Slave. Her presence is a blemish on the record of this House and her ass is to be punished for her transgressions. She takes a brutal ass fucking while her underling slut sister smears pussy into her face in a degrading display of penance. In the end, Storm is covered in come and ordered out of our sight, made to slither away like a come covered worm in chains. \n\nLyla Storm is officially demoted, busted to the rank of 'Trainee'. She is sent back to the basement to be punished further and re-trained in the basics of House service on the Training of O. You can see her re-training on thetrainingofo.com now. \n\nScreens &lt;a href=&quot;\nhttp://www.theupperfloor.com/site/shoot/34212-Anal-Punishment-and-Demotion-of-a-House-Slave.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theupperfloor.com/site/shoot/34212-Anal-Punishment-and-Demotion-of-a-House-Slave.html&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:9d0eebd64cef2a30d7b5b3a66ba9e1aa3d81dc70","amp;dn":"The+Upperfloor--tUF-34212+Lyla+Storm%2C+Kristine+Kahill+and+Mickey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d0eebd64cef2a30d7b5b3a66ba9e1aa3d81dc70","infoHashBuffer":{"type":"Buffer","data":[157,14,235,214,76,239,42,48,215,181,179,166,107,169,225,170,61,129,220,112]},"announce":[],"urlList":[]}}