{"title":"udemy - Mobile App Development with Android (2015)","uid":12160354,"size":7205753993,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9d5f4793cddec62d1f594d46c42ffc2963eb9017&amp;dn=udemy+-+Mobile+App+Development+with+Android+%282015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NepsterJay","files":91,"time":1437892866,"description":"ZERO TO HERO ANDROID APPLICATION TRAINING\n\n******** 30 Day, Money Back Guarantee!********\n\nIn this series, you'll be introduced to all of the core concepts involved with building Android applications. Furthermore: you'll apply those concepts to build a real world social networking application that allows users to send their friends pictures, taken with the camera on their phone, complete with funny messages that can be decoded to your actual text message!\n\nAction Bars\nNavigation Drawers\nEvent Buses\nList Views\nService Layers\nCamera and Web API's\nPush Notifications\nExternal Logins\nA full background with production level code\nOver 40 hours of training!\n******** That's not all!!********\n\nYou'll also get access to your own personal sandbox for your web server, courtesy of us. As well as access to the *ENTIRE SOURCE CODE in a Git repository, labeled by lesson! You'll get to see not only the code, but the corrections that occur in production along the way!\n\nIf you've wanted to program for Android, This is the course to build the solid foundation and skills you need to take you anywhere you want to go in the Android world.\n\nWe've structured this course to provide a solid grounding in concept, followed by the application of that concept within an actual app so you can put what you learn to practice immediately in a real-world context!\n\n*Use of sandbox and source code for personal, educational use only. Use of either service for commercial purposes is strictly forbidden.\n\nWhat are the requirements?\n\nWillingness to learn design patterns and proper usage of an OO language\nBasic programming ability, especially in a similar, statically typed language, such as C# or C++\nAll software is explained and installed on video\nWhat am I going to get from this course?\n\nOver 91 lectures and 40.5 hours of content!\nWork comfortably with Android Studio and the Android build tools\nUnderstand the challenges and solutions to common problems that crop up in production quality Android development\nWork with live APIs, including uploading images and handling authentication\nHandle the Android application lifecycle correctly, and in a standard way\nLeverage OO design patterns to simplify development\nHave the experience and knowledge to to build production quality social networking applications\nWhat is the target audience?\n\nBeginner to advanced programmers\nExperience in Java is not required, especially if the student already knows a similar language such as C#\nExperience in Android, or any other mobile platform, is not required - we cover everything required to get set up in a modern development environment!","torrent":{"xt":"urn:btih:9d5f4793cddec62d1f594d46c42ffc2963eb9017","amp;dn":"udemy+-+Mobile+App+Development+with+Android+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d5f4793cddec62d1f594d46c42ffc2963eb9017","infoHashBuffer":{"type":"Buffer","data":[157,95,71,147,205,222,198,45,31,89,77,70,196,47,252,41,99,235,144,23]},"announce":[],"urlList":[]}}