{"title":"STG FolderPrint Plus v4.0.2.0 Incl Crack + Key [TorDigger]","uid":8339290,"size":16377322,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9d66d0c8706bea43d3ac45bbcf3a61c296202628&amp;dn=STG+FolderPrint+Plus+v4.0.2.0+Incl+Crack+%2B+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":10,"time":1365050931,"description":"STG FolderPrint Plus\n\nPrint and visualize your folders. Find out where your hard drive space went - and locate all your hard-to-find junk files.\n\nGet a great view of your hard drive (sample) and find out what folders are using more space. Save money by avoiding buying a new hard drive, when all you had to do was delete files you didn't even know you still had! \n\nUse the move, copy and multiple file rename functions to quickly organize your files and save disk space. \n\nChoose just the columns you want - no need to waste paper or your time with columns you don't need. \n\nLists can include extra music information - music titles, author names, and more. Get an easy catalog of your music with full detail. \n\nView, find and print all files inside ZIP files. No need to open them one by one to figure out just what is in files2011.zip. \n\nExport your folders to documents (Text), (CSV), Excel, PDF, images (JPG, PNG) or web pages (HTML). You can easily put them on the web, change them more in Excel or send them to a friend. \n\nUse our CD-ROM Cover Report to print cover for your data CDs and DVDs - and never again have to open them on your computer just to figure out where that file you need is! \n\nFeatures\n\nAllows you to print and visualize large numbers of folders and files - your whole hard drive at once!\nFAST!\nMP3 and WMA support - add length, artist name, etc to your output.\nView and print the files inside your ZIP files.\nGraphical Output, including file type icons and the folder hierarchy.\nFilter by as many file masks as you want (include or exclude), dates or file sizes.\nSort, reorder, resize or remove any column, get the exact look you want.\nMany print options - colors, backgrounds, headers, footers, etc.\nExport to HTML, Excel, CSV, JPG, PNG, PDF Or Text\nMultiple file rename.\nMP3 Copy/Move Tool - creates folders with the band, album name, or whatever you like.\nFile Versions for EXEs and DLLs.\nFile Type Report - easily figure out which kind of files are taking up space.\nCompact Output - get the name of all files while saving paper.\nCD-ROM Cover Report - get a nice printed cover you can insert in CD cases.\nPrint your Favorites with the URL extract option.\nMultilingual Interface - English, German, Brazilian Portuguese, French and Spanish.\n\nSystem Requirements: \n\nWindows XP, Vista, Windows 7 or Windows 8\n\nHomepage: http://www.stgsys.com/fpp.asp \n\nInstallation Instructions:\n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Register application with given name/key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:9d66d0c8706bea43d3ac45bbcf3a61c296202628","amp;dn":"STG+FolderPrint+Plus+v4.0.2.0+Incl+Crack+%2B+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d66d0c8706bea43d3ac45bbcf3a61c296202628","infoHashBuffer":{"type":"Buffer","data":[157,102,208,200,112,107,234,67,211,172,69,187,207,58,97,194,150,32,38,40]},"announce":[],"urlList":[]}}