{"title":"ç²¾å¿ å²³é£ž2013 The Patriot Yue Fei 2013 720p HDTV x264 Complete","uid":9654106,"size":100809029437,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:9d6ed4bc7305d34ea63d3471f9cb5f77636da721&amp;dn=%E7%B2%BE%E5%BF%A0%E5%B2%B3%E9%A3%9E2013+The+Patriot+Yue+Fei+2013+720p+HDTV+x264+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Guanyu9","files":69,"time":1393147016,"description":"In the last years of the Northern Song Dynasty, the central region was being invaded by the Liao Dynasty, causing the people fallen into difficult times. Emperor Huizong turned a blind eye to the political affairs, which led to the discontent of Yue Fei, the captain of a Î“Ã‡Â£brave warriorsÎ“Ã‡Â¥ team. With only 800 warriors, Yue FeiÎ“Ã‡Ã–s army, including Zhang Xian, Niu Gao, Xu Qing and Wang Gui, returned with triumph, demonstrating that fighters in the Sony Dynasty were a lot tougher than the enemy could ever imagine.\n\nJin Wuzhu soon led his army to raid the territory once again, sieging Bianjing, capital of the Northern Song Dynasty. Yue Fei thus joined the old commander Zong Ze to defend against the intruders. When Yue Fei was about to set off, his mother, Madam Yue, made a tattoo on his back with the characters Î“Ã‡Â£Jin Zong Bao GuoÎ“Ã‡Â¥ (serve the country with supreme loyalty) as her support and inspiration towards him. As Emperor Yuizong understood that his army was no match for the invaders, he hastily decided to abdicate his throne to his son Zhao Huan as Emperor Qinzong. The force of the Later Jin Dynasty surrounded Bianjing, resulting in an extreme situation. Zhao Gou, Emperor Qin ZongÎ“Ã‡Ã–s younger brother, who exceled in both the pen and the sword, was aided by a treacherous minister Qin Hui to usurp Qin ZongÎ“Ã‡Ã–s power. Such scheme was suppressed by Yue Fei, who was then at enmity with Qin Hui and Zhao Gou. Zhao ascended the throne at Jiankang as Emperor Gaozong, the first Emperor of the Southern Song Dynasty.\n\nWhen Jin WuzhuÎ“Ã‡Ã–s troop seiged Xinxiang, Yue FeiÎ“Ã‡Ã–s army marched into the mountain area and drew the swords against JinÎ“Ã‡Ã–s powerful troop with the guerilla stragegies. Two months after, Yue FeiÎ“Ã‡Ã–s guerillas lacked food and reinforcement, forcing themselves to eat the invaderÎ“Ã‡Ã–s flesh and drink their blood. Fortunately, Yue FeiÎ“Ã‡Ã–s wife Li Wa found General Liang Xing to transport the food onto the mountain, helping the entire army secure a safe retreat.\n\nthe Jin army conquered Jiankang with the imperial tomb raided. Yue Fei joined forces with his elder son, Yue Yun, to defeat Jin Wuzhu. However, Qin Hu was secretly in contact with Jin Wuzhu, offering him the map of Huang Tian DangÎ“Ã‡Ã–s water channel, which enabled Wuzhu to retreat overnight.\n\nAfter the triumph wth 6 commanderies recaptured, Yue Fei was awarded Î“Ã‡Â£The Patriot Yue FeiÎ“Ã‡Â¥ flag by Emperor Gaozong, who admire his army as superior. At the end of the 11th year of Shaoxing era, Emperor negotiated peace again with the Jin Dynasty. Their Emperor replied stating the mandatory condition: killing Yue Fei. This in turn gave an excuse to Qin Kui to eliminate him.\n\nQin Kui first sentenced Zhang Xian and Yue Yun to torture. YueÎ“Ã‡Ã–s army determined to break into jail on the new yearÎ“Ã‡Ã–s eve, but was discovered by Qin Kui, who finally decided to hurriedly sentenced him to hanging. Yue Fei cried to the sky saying Î“Ã‡Â£Tian Ri Zhao ZhaoÎ“Ã‡Â¥(Where is justice?) before his glorious death for sacrifice. Yue Fei finally died at 39. Qui Kui immediately sentenced Zhang Xian and Yue Yun to death the next afternoon. Yue FeiÎ“Ã‡Ã–s little daughter, Yue Yinping, threw herself into a well and destroyed herself. His wife Li Wa, along with a hundred of the clan members, were exiled to a desolate region for more than a decade and struggled to survive. On the last month of the 25th year of Shaoxing eraÎ“Ã‡Âª\n\nQin Kui and his people walked towards a plaza, when Liang Xing suddenly appeared and ordered to kill him. Qin KuiÎ“Ã‡Ã–s son carried him on his back and broke out of the encirclement. Qin Kui returned to his mansion before he had a nightmare, in which Yue Yinping was going to take his life. He was terrified and soon dead. Statues of such evil man and his son were since built in Yue Fei Temple to kneel before Yue Fei, the historical patriot.","torrent":{"xt":"urn:btih:9d6ed4bc7305d34ea63d3471f9cb5f77636da721","amp;dn":"%E7%B2%BE%E5%BF%A0%E5%B2%B3%E9%A3%9E2013+The+Patriot+Yue+Fei+2013+720p+HDTV+x264+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d6ed4bc7305d34ea63d3471f9cb5f77636da721","infoHashBuffer":{"type":"Buffer","data":[157,110,212,188,115,5,211,78,166,61,52,113,249,203,95,119,99,109,167,33]},"announce":[],"urlList":[]}}