{"title":"Georgia's Horse - Weather Codes (2013) [FLAC]","uid":8603489,"size":230523254,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9e877118729f520e48c518f8bcc5728e82cd800d&amp;dn=Georgia%27s+Horse+-+Weather+Codes+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1371943022,"description":"\n  BTC \n\n  1P3bCN55pmnKLvuqHJcsGWyAiu8eSZW3aZ\n\n\n  Georgia's Horse - Weather Codes (2013) [FLAC]\n\n  * Genre: Pop/Rock\n  * Styles: Indie, Alternative \n  * Source: CD (log + cue)\n  * Codec: FLAC\n  * Bit Rate: ~ 700 kbps\n  * Bit Depth: 16\n  * Sampling Rate: 44,100 Hz\n\n  Tracks\n\n  * 01 Apple\n  * 02 A Long Ride Home\n  * 03 Ginger\n  * 04 The Bullet Sinks\n  * 05 Fancy\n  * 06 The Millers\n  * 07 Westlake\n  * 08 Strep Throat\n  * 09 Thistlebomb\n  * 10 Six\n  * 11 Brick Hard Heart\n  * 12 Weather Codes Part 2\n  * 13 Weather Codes Part 3\n  * 14 Pram\n\n  * Weather Codes, the new album from Texan songstress Teresa Maldonado, is due out on Fire Records in June. Following the magical debut The Mammoth Sessions, the new album is a study in heartbreak and loneliness set amidst the backdrop of the vast landscapes of American Southwest. Drawing influences from her perennial favourites the darkly gothic Bauhaus, as well as Natacha Atlas' exotic Mish Maoul, the black metal of Venom, Leslie Gore's protofeminist &quot;You Don't Own Me&quot; and the psych folk of early Will Oldham. If you listen really carefully you can also hear the swirling sand and the rustling wind in the baking heat of the Texas summer.\n\n  * Teresa recorded most of the songs at night with her blackmouth cur by her side. They were initially composed on her much loved piano which was in need of some tuning. Having not been tuned since around 1992, the piano had been moved from place to place too many times to count but lent a fractured beauty to her creations. From the early versions on the piano, she started to venture into the more electronic side of music mixing styles and sounds to create a marvelously eclectic collection of songs.\n\n  * Maldonado began writing Weather Codes during a messy relationship and amassed over forty songs, which she whittled down to fourteen forlorn and haunting tracks. The relationship started during her back and forth travels between Texas and Louisiana, and the album sees her bringing the landscape vividly to life. The little towns and their secrets. With tall tales that can be heard in tracks such as &quot;A Long Ride Home&quot; and &quot;Weather Codes Part 3&quot;. Everything else was turned in to a play of sorts with characters and veils; the tiring Texan veils of keeping up a smile when in public, even when leading a sad existence.","torrent":{"xt":"urn:btih:9e877118729f520e48c518f8bcc5728e82cd800d","amp;dn":"Georgia%27s+Horse+-+Weather+Codes+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e877118729f520e48c518f8bcc5728e82cd800d","infoHashBuffer":{"type":"Buffer","data":[158,135,113,24,114,159,82,14,72,197,24,248,188,197,114,142,130,205,128,13]},"announce":[],"urlList":[]}}