{"title":"The Authoritarians - Bob Altemeyer, 2007","uid":4783966,"size":3165803,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ec5d470919e85c153954ae326688f49555731e4&amp;dn=The+Authoritarians+-+Bob+Altemeyer%2C+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"B110","files":-1,"time":1237484408,"description":"\n                              The Authoritarians\n                                     2007\n\n                                 Bob Altemeyer \n        Associate Professor of Psychology at the University of Manitoba\n\n-------------------------------------------------------------------------------\n\n   OK, what's this book about? It's about what happened to the American \ngovernment after &quot;conservatives&quot; gained control of Congress in the 1990s and \nthe White House in 2000. It's about the disastrous decisions that government \nmade, which have created the enormous problems we face now. It's about the \ncorruption that rotted the Congress. It's about how traditional conservatism \nhas nearly been destroyed by authoritarianism. It's about how the \n&quot;Religious Right&quot; teamed up with amoral authoritarian leaders to push its \nun-democratic agenda onto the country.\n\n   &quot;Well,&quot; you might be thinking, &quot;I don't believe any of this is true.&quot; Or \nmaybe you're thinking, &quot;What else is new? I've known this all along.&quot; Why \nshould a conservative, moderate, or liberal bother with this book? Why should \nany Republican, Independent, or Democrat click the &quot;Introduction&quot; link on this \npage?\n\n   Because if you do, you'll begin an easy-ride journey through some relevant \nscientific studies I have done on authoritarian personalities--one that will \ntake you a heck of a lot less time than the decades it took me. Those studies \nhave a direct bearing on all the topics mentioned above. So if you think the \nfirst paragraph is a lot of hokum, or full of half-truths, I invite you to look\nat the research.\n\n   For example, take the following statement: &quot;Once our government leaders and \nthe authorities condemn the dangerous elements in our society, it will be the \nduty of every patriotic citizen to help stomp out the rot that is poisoning our\ncountry from within.&quot; Sounds like something Hitler would say, right? Want to \nguess how many politicians, how many lawmakers in the United States agreed with\nit? Want to guess what they had in common?\n\n   Or how about a government program that persecutes political parties, or \nminorities, or journalists the authorities do not like, by putting them in \njail, even torturing and killing them. Nobody would approve of that, right? \nGuess again.\n\n   Don't think for a minute this doesn't concern you personally. Let me ask \nyou, as we're passing the time here, how many ordinary people do you think an \nevil authority would have to order to kill you before he found someone who \nwould, unjustly, out of sheer obedience, just because the authority said to? \nWhat sort of person is most likely to follow such an order? What kind of \nofficial is most likely to give that order, if it suited his purposes? Look at \nwhat experiments tell us, as I did.\n\n   If, on the other hand, you're way ahead of me, and believe the extreme \nright-wing elements in America are still working to take over the country \ndespite the recent election--nay because of it--I think you can still get a \nlot from this book. The authoritarians aren't going away.\n\n-------------------------------------------------------------------------------\n\nThis book can also be downloaded for free:\nhttp://home.cc.umanitoba.ca/~altemey/\n\nA calc-sheet is included to help the reader summarize their \nscores on the first three &quot;tests&quot; from the first chapter. Enjoy!\n","torrent":{"xt":"urn:btih:9ec5d470919e85c153954ae326688f49555731e4","amp;dn":"The+Authoritarians+-+Bob+Altemeyer%2C+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ec5d470919e85c153954ae326688f49555731e4","infoHashBuffer":{"type":"Buffer","data":[158,197,212,112,145,158,133,193,83,149,74,227,38,104,143,73,85,87,49,228]},"announce":[],"urlList":[]}}