{"title":"Barbara J. Sivertsen - The Parting of the Sea [2009][A]","uid":10397281,"size":8261305,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f21e3e5c3fea13719c013ce41bc663b68fc6cc9&amp;dn=Barbara+J.+Sivertsen+-+The+Parting+of+the+Sea+%5B2009%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1403283072,"description":"Description\nProduct Details\nBook Title: The Parting of the Sea: How Volcanoes, Earthquakes, and Plagues Shaped the Story of Exodus\t\nBook Author: Barbara J. Sivertsen (Author)\nHardcover: 264 pages\nPublisher: Princeton University Press; First Edition edition (February 17, 2009)\nLanguage: English\nISBN-10: 0691137706\nISBN-13: 978-0691137704\n\n===================================================================================\nBook Description\nPublication Date: February 17, 2009\nFor more than four decades, biblical experts have tried to place the story of Exodus into historical context--without success. What could explain the Nile turning to blood, insects swarming the land, and the sky falling to darkness? Integrating biblical accounts with substantive archaeological evidence, The Parting of the Sea looks at how natural phenomena shaped the stories of Exodus, the Sojourn in the Wilderness, and the Israelite conquest of Canaan. Barbara Sivertsen demonstrates that the Exodus was in fact two separate exoduses both triggered by volcanic eruptions--and provides scientific explanations for the ten plagues and the parting of the Red Sea. Over time, Israelite oral tradition combined these events into the Exodus narrative known today.\nSkillfully unifying textual and archaeological records with details of ancient geological events, Sivertsen shows how the first exodus followed a 1628 B.C.E Minoan eruption that produced all but one of the first nine plagues. The second exodus followed an eruption of a volcano off the Aegean island of Yali almost two centuries later, creating the tenth plague of darkness and a series of tsunamis that &quot;parted the sea&quot; and drowned the pursuing Egyptian army. Sivertsen's brilliant account explains inconsistencies in the biblical story, fits chronologically with the conquest of Jericho, and confirms that the Israelites were in Canaan before the end of the sixteenth century B.C.E.\nIn examining oral traditions and how these practices absorb and process geological details through storytelling, The Parting of the Sea reveals how powerful historical narratives are transformed into myth.\n\n===================================================================================\nReviews\n&quot;Providing what may be the most coherent correlation yet of ancient Egyptian history, the archeology of both Egypt and Palestine, and the biblical traditions of pre-literate Israel, Sivertsen also thoroughly documents and explains each interdisciplinary facet (including volcanism and tectonics as well as oral transmission in non-literate societies). This outstanding accomplishment should be a source of research direction for years to come.&quot;--Publishers Weekly Review Annex, Web Pick of the Week\n\n&quot;Reaching the end of this book, all I could think was, 'this is blowing my mind.' Not to be overwrought, but Barbara Sivertsen's The Parting of the Sea rewrites the major story of the Jewish people, that of the Exodus from Egypt. Assembling and interpreting a dizzying amount of scientific material, Sivertsen documents how earthquakes, volcanic eruptions, and a tsunami played key roles in establishing Jewish people in the land of Canaan.&quot;--Jewish Book World\n\n&quot;It is a well researched and at times scientific review of a biblical story. . . . This book, while it does not answer all the questions, does raise theories that can be tested in the future.&quot;--Hannah Friedman, Journal of Archaeological Science\n\n===================================================================================\nFrom the Back Cover\n&quot;With an arresting topic, great storytelling, superb scholarship, and a command of diverse sources, Sivertsen makes an important contribution to a significant historic and scientific puzzle.&quot;--Adrienne Mayor, author of The First Fossil Hunters: Paleontology in Greek and Roman Times and Fossil Legends of the First Americans\n\n&quot;One seldom encounters an author with Sivertsen's broad learning, meticulous scholarship, and graceful writing. Because of her thoroughness, the research in this book will remain valuable for decades to come: she has done an exceptional job of digging into the wide variety of fields relevant to understanding the Exodus. A superb and stunning book.&quot;--Paul and Elizabeth Barber, authors of When They Severed Earth from Sky: How the Human Mind Shapes Myth\n\n&quot;Effectively weaving together and analyzing a large amount of data, The Parting of the Sea is a well-researched, well-written look at the recent information, theories, and hypotheses dealing with the Exodus and occupation of Canaan by the Israelites.&quot;--Jelle Zeilinga de Boer, author of Volcanoes in Human History: The Far-Reaching Effects of Major Eruptions\n\n===================================================================================\nAbout the Author\nBarbara J. Sivertsen has been managing editor of the &quot;Journal of Geology&quot; for over twenty-five years. She is the author of &quot;Turtles, Wolves, and Bears: A Mohawk Family History&quot; and &quot;The Three Pillars: How Family Politics Shaped the Early Church and the Gospel of Mark&quot;.\n===================================================================================","torrent":{"xt":"urn:btih:9f21e3e5c3fea13719c013ce41bc663b68fc6cc9","amp;dn":"Barbara+J.+Sivertsen+-+The+Parting+of+the+Sea+%5B2009%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f21e3e5c3fea13719c013ce41bc663b68fc6cc9","infoHashBuffer":{"type":"Buffer","data":[159,33,227,229,195,254,161,55,25,192,19,206,65,188,102,59,104,252,108,201]},"announce":[],"urlList":[]}}