{"title":"Explosions in the Sky - How Strange, Innocence[Flac]","uid":5408090,"size":295324590,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9f3e36426c6e63467cb3ef8e939b2b19b5cef377&amp;dn=Explosions+in+the+Sky+-+How+Strange%2C+Innocence%5BFlac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tripplesixty","files":7,"time":1267664504,"description":"Audio CD (October 11, 2005)\nOriginal Release Date: October 11, 2005\nNumber of Discs: 1\nLabel: Temporary Residence\n\n\n&quot;At certain points along the way, several of us wanted to buy back all the copies and burn them,&quot; writes Explosions in the Sky on their liner notes to this reissued debut. That's not a rousing recommendation, but an honest one from a group that three years later would produce one of the definitive post-modern guitar instrumental albums, The Earth Is Not a Cold Dead Place. How Strange, Innocence was reportedly made in only two days and released as a 300-issue CD-R in 2000. It's as rough and ready as that might suggest, but the sound of EITS was already well-formed right out of the Austin electric guitar womb. The opening &quot;Song for Our Fathers&quot; with its languid rhythm and surf guitar reverb fits right in with their later work. It's not perfect. They hadn't yet become sultans of the slow build crescendo, and there are more muffs than any self-respecting musician would want frozen for posterity. Nevertheless, it holds up as a rustic artifact and songs like the opener and &quot;Look Into the Air&quot; fulfill their mission of mood. Even before they were providing atmospheric soundtracks for Friday Night Lights and recording minor symphonies of electric guitar twang, Explosions in the Sky already had a clear vision of their sound. --John Diliberto","torrent":{"xt":"urn:btih:9f3e36426c6e63467cb3ef8e939b2b19b5cef377","amp;dn":"Explosions+in+the+Sky+-+How+Strange%2C+Innocence%5BFlac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f3e36426c6e63467cb3ef8e939b2b19b5cef377","infoHashBuffer":{"type":"Buffer","data":[159,62,54,66,108,110,99,70,124,179,239,142,147,155,43,25,181,206,243,119]},"announce":[],"urlList":[]}}