{"title":"Fear &amp; Loathin in Las Vegas Soundtrack","uid":8127841,"size":336594255,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9f508ca3e129146fbdc7d768f081c15c9679e167&amp;dn=Fear+%26amp%3B+Loathin+in+Las+Vegas+Soundtrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"n17n3uq","files":16,"time":1360528063,"description":"Fear and Loathing in Las Vegas is a 1998 American film directed by Terry Gilliam, starring Johnny Depp as Raoul Duke and Benicio del Toro as Dr. Gonzo. It was adapted from Hunter S. Thompson's 1971 novel of the same name.\nFear and Loathing in Las Vegas was a box office failure, grossing US$10.6 million at the North American box office, well below its $18.5 million budget. It has since become a cult film due in large part to its release on DVD, including a Special Edition released by The Criterion Collection.\n\nThe film opens with a montage of news clips of Civil Rights Movement and Vietnam War protests while The Lennon Sisters cover of &quot;My Favorite Things&quot; plays over them, before cutting to Raoul Duke (Depp) and Dr. Gonzo (del Toro) speeding across the Nevada desert. Duke, under the influence of mescaline, complains of a swarm of giant bats, before going through the pair's inventory of psychoactive drugs. Shortly afterward, the duo stop to pick up a young hitchhiker (Maguire), and explain what they are doing. Duke has been assigned by an unnamed magazine to travel to Las Vegas and cover the Mint 400 motorcycle race. However, they have also decided to take advantage of the trip by purchasing a large number of drugs, and rent a Cadillac Eldorado convertible. The young man soon becomes terrified of the antics of the duo, and flees on foot. Trying to reach Vegas before the hitchhiker can go to the police, Gonzo gives Duke part of a sheet of &quot;Sunshine Acid&quot;, then informs him that there is little chance of making it before the drug kicks in. By the time they reach the strip, Duke is in full throes of his trip, and barely makes it through the check-in; all the while hallucinating that the hotel clerk is a moray eel, and that his fellow bar patrons are lizards in the depths of an orgy.\nThe next day, Duke arrives at the race, and heads out with his photographer, a man by the name of Lacerda (Bierko). During the coverage, Duke becomes irrational and believes that they are in the middle of a battlefield, so he fires Lacerda, and returns to the hotel. After consuming more mescaline, as well as huffing diethyl ether, Duke and Gonzo arrive at the Bazooko Circus casino, but leave shortly afterwards, the chaotic atmosphere frightening Gonzo. Back in the hotel room, Duke leaves Gonzo unattended, and tries his luck at a quick round of roulette. When Duke returns, he finds that Gonzo, after consuming a full sheet of LSD, has trashed the room, and is sitting fully clothed in the bathtub, attempting to pull the tape player in with him, as he wants to hear the song better. He pleads with Duke to throw the machine into the water when the song &quot;White Rabbit&quot; peaks. Duke agrees, but instead throws a grapefruit at Gonzo's head before running outside.\nThe next morning, Duke awakes to a massive room service bill, and no sign of Gonzo (who had returned to Los Angeles while Duke slept), and attempts to leave town. As he nears Baker, California, a highway patrolman (Busey) pulls him over for speeding, and advises him to sleep at a nearby rest stop. Realizing that he is being set up, Duke instead decides to return to Las Vegas, and reads a telegram from Gonzo, informing him that he has a suite in his name at the Flamingo Las Vegas so he can cover a District Attorney's convention on narcotics. Duke checks into his suite, only to be met by an LSD-tripping Gonzo, and a young girl by the name of Lucy (Ricci) he has brought with him. Gonzo explains that Lucy has come to Las Vegas to meet Barbra Streisand, and that he fed her LSD on the plane without her knowing. Sensing the trouble this could get them into, Duke convinces Gonzo to ditch Lucy in another hotel before her trip wears off.\nGonzo accompanies Duke to the D.A.'s convention, and the pair discreetly snort cocaine as the guest speaker delivers a comically out-of-touch speech about &quot;marijuana addicts&quot; before showing a brief film. Unable to take it, Duke and Gonzo flee back to their room, only to discover that Lucy has called. Their trips mostly over, Gonzo deals with Lucy over the phone (pretending that he is being savagely beaten by thugs), as Duke attempts to mellow out by trying some of Gonzo's stash of adrenochrome. However, the trip spirals out of control, and Duke is reduced to an incoherent mess before he blacks out.\nAfter an unspecified amount of time passes, Duke wakes up to a complete ruin of the once pristine suite. After discovering his tape recorder, he attempts to remember what has happened. As he listens, he has brief memories of the general mayhem that has taken place (including a heated encounter with a waitress at a diner, convincing a distraught cleaning woman that they are police officers investigating a drug ring, and attempting to buy an orangutan).\nDuke drops Gonzo off at the airport, after missing the entrance, driving across the tarmac and pulling up right next to the plane, before returning to the hotel one last time to finish his article. The film ends with Duke speeding back to California as The Rolling Stones' &quot;Jumpin' Jack Flash&quot; plays over the credits.","torrent":{"xt":"urn:btih:9f508ca3e129146fbdc7d768f081c15c9679e167","amp;dn":"Fear+%26amp%3B+Loathin+in+Las+Vegas+Soundtrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f508ca3e129146fbdc7d768f081c15c9679e167","infoHashBuffer":{"type":"Buffer","data":[159,80,140,163,225,41,20,111,189,199,215,104,240,129,193,92,150,121,225,103]},"announce":[],"urlList":[]}}