{"title":"EPOCH.2 v1.2.2 Android","uid":9837665,"size":1315393475,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:9f6c29be99a4e5a47bcf6be553cce7d96d0088db&amp;dn=EPOCH.2+v1.2.2+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":".BONE.","files":-1,"time":1395939609,"description":"EPOCH.2 v1.2.2\nRequirements: Android O/S : 4.1+\nOverview: The epic saga of post-apocalyptic robot combat continues!\n\n\nEPOCH has trekked across a war-ravaged country to find the one person he was programmed to protect: the Princess Amelia. Now he must follow a final, desperate lead to reach her, with the two warring robot armies of Omegatroniks and Alphetekk standing in his way. But what surprises await EPOCH when the Princess is finally located? And what will she make of the world she wakes up to?\n\nCHOREOGRAPH THE ACTION\n\nControl your character with intuitive finger swipes designed specifically for touch-screens. Make split-second tactical decisions, take cover, select targets, dodge incoming fire, utilize special abilities, and launch countermeasures!\n\nUNRAVEL THE MYSTERY\n\nFollow the story of humanity's downfall, and their final hope for salvation as you discover the truth about the Princess and what she really means to the future of this world. And who is the new interloper that has decided that EPOCH must be stopped at any cost?\n\nA BEAUTIFULLY DESOLATE WORLD\n\nExplore whole new areas across a post-apocalyptic landscape; the crackling desert of the mysteriously drained harbors, the whistling desolation of abandoned spaceports and the clamorous factories that continue to manufacture their robotic wares.\n\nDESTROY, SALVAGE AND UPGRADE\n\nBattle escalating waves of robots and bosses in arena-style combat, and upgrade yourself with pieces scavenged from the ruins! Configure your robot with dozens of weapons, armors, boosters and counters.\n\nNEW WAYS TO PLAY\n\nNew weapons, items and features expand your arsenal and give you new strategies to employ. Equip your Weakening Grenades, risk a Fast Reload for bonus damage, or head-shot an enemy robot with your Sniper Rifle? New levels extend and expand EPOCH's ability to fight, move and dodge. New Play Modes provide tougher challenges for the elite EPOCH player.\n\nENGAGING STORY\n\nHelp the Princess find her bearings in a world that has left her behind. Gather fragments of the past with logs from a cast of characters, each with their own perspective on the apocalyptic events that destroyed a once-proud civilization.\n\nSTUNNING AAA VISUALS\n\nPowered by the latest version of Unreal Engine 3, EPOCH.2 pushes the limits of the enhanced visual capabilities of the latest Android devices, delivering spectacular new enemies, completely revamped models and the most amazingly-realised human character on mobile!\n","torrent":{"xt":"urn:btih:9f6c29be99a4e5a47bcf6be553cce7d96d0088db","amp;dn":"EPOCH.2+v1.2.2+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f6c29be99a4e5a47bcf6be553cce7d96d0088db","infoHashBuffer":{"type":"Buffer","data":[159,108,41,190,153,164,229,164,123,207,107,229,83,204,231,217,109,0,136,219]},"announce":[],"urlList":[]}}