{"title":"Zeitgeist - Der Film German (full reedited)","uid":4455776,"size":732497920,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9f7a6fc8469d0e9d96dbdf7b63b237b877b9f94a&amp;dn=Zeitgeist+-+Der+Film+German+%28full+reedited%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lerotonomen","files":-1,"time":1224470430,"description":"Zeitgeist - Der Film\n\nZeitgeist ist ein nonkommerzielles Film-Projekt, das nach jahrelanger Recherchearbeit im Jahr 2007 von Peter Joseph umgesetzt wurde. Der Film ist Ueber Video-Streams kostenlos zu sehen und kann ausserdem in hoeherer Qualitaet kostenlos heruntergeladen werden.\nSeit der englischen Veroeffentlichung Mitte 2007 ist der Film bis heute in mindestens 20 Sprachen uebersetzt worden, u.a. in Spanisch, Deutsch, Franzoesisch, Japanisch und Russisch. Nach konservativen Schaetzungen wird der Film taeglich allein ueber die Video-Streaming Plattform Google Video mehr als 70000 mal gesehen, das sind mehr als 2 Millionen pro Monat. Der Film nimmt damit weltweit hohe Positionen in den Video-Charts ein.\nDer Film stellt die provokante Frage welche Gemeinsamkeiten Jesus Christus, der 11. September und die Federal Reserve Bank haben.\n\nDabei wird im ersten Teil des Films ausfuehrlich auf die astrotheologischen Hintergruende und Mythen um die Figur Jesus Christus eingegangen und es stellen sich Gemeinsamkeiten mit Goettern anderer, teilweise viel aelterer Kulturen heraus.\n\nDer zweite Teil des Films widmet sich vorwiegend den Terroranschlaegen des 11. September 2001, mit dem Versuch dieses Ereignis kritisch zu betrachten und es in einen Kontext mit anderen terroristischen Anschlaegen zu bringen.\n\nIm dritten Teil wird der Frage nachgegangen wer die Maenner hinter dem Vorhang sind. So wird u.a. die Geschichte rund um die Entstehung des Zentralbankensystems der USA beleuchtet und es wird ein kritischer Blick auf wirtschaftliche und kriegerische Ereignisse des 20. Jahrhunderts geworfen. Der Film schliesst mit der Entlarvung des vorherrschenden Zeitgeistes als gaenzlich auf Angst basiert. Mit deutscher Tonspur von Infokrieg.tv.\n\n==================================================================================\n\nDauer:...........1h 56m\n\nVideo:...........592x448, XViD\n\nAudio:...........128kBit/s, MPEG Layer-3\n\nSprache:.........Deutsch + Untertitel\n\nGrÃƒÂ¶ÃƒÅ¸e:...........698MB\n\n(englisch: zeitgeistmovie .com | deutsch: infokrieg.tv )\n\nHÃƒÂ¶chst interessante Doku ÃƒÂ¼ber das Monopol der Elite Bankiers. Anschauen und sich selbst ein Bild darÃƒÂ¼ber machen, wie es um unsere Zukunft steht. Scheut euch nicht die Doku zu verteilen, dies ist gewollt um mÃƒÂ¶glichst viele Menschen anzusprechen. Bitte weiterhin seeden. Wenn euch die Doku gefÃƒÂ¤llt, unterstÃƒÂ¼tzt bitte infokrieg.tv mit dem Kauf einer DVD im Webshop. Danke.\n\n==================================================================================","torrent":{"xt":"urn:btih:9f7a6fc8469d0e9d96dbdf7b63b237b877b9f94a","amp;dn":"Zeitgeist+-+Der+Film+German+%28full+reedited%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f7a6fc8469d0e9d96dbdf7b63b237b877b9f94a","infoHashBuffer":{"type":"Buffer","data":[159,122,111,200,70,157,14,157,150,219,223,123,99,178,55,184,119,185,249,74]},"announce":[],"urlList":[]}}