{"title":"The Web Application Hacker's Handbook {BBS}","uid":6759520,"size":8020999,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a01f1d347e6fa6f91714aa65e8d0f398e4558690&amp;dn=The+Web+Application+Hacker%5C%27s+Handbook+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1319158784,"description":"This book is a practical guide to discovering and exploiting security flaws in web applications. The authors explain each category of vulnerability using real-world examples, screen shots and code extracts. The book is extremely practical in focus, and describes in detail the steps involved in detecting and exploiting each kind of security weakness found within a variety of applications such as online banking, e-commerce and other web applications.\n\nThe topics covered include bypassing login mechanisms, injecting code, exploiting logic flaws and compromising other users. Because every web application is different, attacking them entails bringing to bear various general principles, techniques and experience in an imaginative way. The most successful hackers go beyond this, and find ways to automate their bespoke attacks. This handbook describes a proven methodology that combines the virtues of human intelligence and computerized brute force, often with devastating results.\n\nThe authors are professional penetration testers who have been involved in web application security for nearly a decade. They have presented training courses at the Black Hat security conferences throughout the world. Under the alias &quot;PortSwigger&quot;, Dafydd developed the popular Burp Suite of web application hack tools.\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 768 pages\n    * Publisher: Wiley; 1 edition (October 22, 2007)\n    * Language: English\n    * ISBN-10: 0470170778\n    * ISBN-13: 978-0470170779","torrent":{"xt":"urn:btih:a01f1d347e6fa6f91714aa65e8d0f398e4558690","amp;dn":"The+Web+Application+Hacker%5C%27s+Handbook+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a01f1d347e6fa6f91714aa65e8d0f398e4558690","infoHashBuffer":{"type":"Buffer","data":[160,31,29,52,126,111,166,249,23,20,170,101,232,208,243,152,228,85,134,144]},"announce":[],"urlList":[]}}