{"title":"Michael Connelly-The Overlook","uid":13731674,"size":176058022,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a12537a7adf403f5c87e4a8aaad45846d7e6b721&amp;dn=Michael+Connelly-The+Overlook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twocows","files":7,"time":1457016735,"description":"The Overlook\r\nby Michael Connelly\r\n\r\n   \r\nA body has been found on the overlook near Mulholland Drive. The victim, identified as Dr. Stanley Kent, has two bullet holes in the back of his head from what looks like an execution-style shooting. LAPD detective Harry Bosch is called out to investigate. It is the case he has been waiting for, his first since being recruited to the city's Homicide Special squad.\r\n\r\nAs soon as Bosch begins retracing Dr. Kent's steps, contradictions emerge. While Kent doesn't seem to have had ties to organized crime, he did have access to dangerous radioactive substances from just about every hospital in Los Angeles County. What begins as a routine homicide investigation opens up before Bosch into something much larger, more dangerous - and much more urgent.\r\n\r\nBreaking in a new rookie partner and chasing his first fresh case in years, Bosch is soon in conflict not just with the LAPD brass but also with FBI hotshots who are convinced that the case is too important for the likes of the LAPD. Harry's onetime lover Rachel Walling is among the federal agents frantically working the case, making Bosch's job all the more complicated. Guarding one slim advantage, he relentlessly follows his own instincts, hoping they are still true enough to solve the crime - and to save all of Los Angeles from a deadly hazard","torrent":{"xt":"urn:btih:a12537a7adf403f5c87e4a8aaad45846d7e6b721","amp;dn":"Michael+Connelly-The+Overlook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a12537a7adf403f5c87e4a8aaad45846d7e6b721","infoHashBuffer":{"type":"Buffer","data":[161,37,55,167,173,244,3,245,200,126,74,138,170,212,88,70,215,230,183,33]},"announce":[],"urlList":[]}}