{"title":"Windows 8 eLearning Kit For Dummies LittleFairyRG","uid":9432155,"size":18361424,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1a73534d2259122fab4be49d6369c095c51589c&amp;dn=Windows+8+eLearning+Kit+For+Dummies+LittleFairyRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SirHates","files":1,"time":1388826928,"description":"\n\n2013 | 416 Pages | ISBN: 1118202872 | EPUB | 18 MB\n\nUse Windows 8 without worry with this complete learning kit If you want to master Windows 8, this value-packed eLearning kit is essential to your learning process. A complete Microsoft Windows 8 course, it includes a full-color printed book and an interactive eLearning course on CD. Each lesson opens with an introduction to the content and explains the importance and potential uses for every task described. Featuring both written and animated step-by-step how-tos, practice labs, helpful videos, numerous examples, and a host of For Dummies hints and tips, this package makes your learning process easier. Follow the material in sequence, or jump in and out as you wish; you learn at your own pace, in your own way. Throughout, you will benefit from illustrations, animations, voiceover explanations, and the option of closed captioning if you find you learn better when you can read the instructions. Helps self-motivated learners master Windows 8 inside and out Includes an easy-to-follow, full-color book and an interactive Dummies eLearning Course that corresponds with the book on CD Hightlights material with integrated audio and video instruction on CD that helps you learn via animations, screencasts, and more Offers chapter summaries, practice exercises, discussions of concepts and essential terms, and other learning aids Allows you to follow the material sequentially or choose separate sections at your own time and pace Windows 8 eLearning Kit For Dummies is the ultimate guide to a productive and flexible learning experience. Note: CD-ROM/DVD and other supplementary materials are not included as part of the e-book file, but are available for download after purchase.\n\nLazyTinker - TinkerTorrents - CrowNephew - AryaN_L33T - CodeBlaze - Kira - DeejayAhmed\nVisit us at www.lfrg.co.vu for more","torrent":{"xt":"urn:btih:a1a73534d2259122fab4be49d6369c095c51589c","amp;dn":"Windows+8+eLearning+Kit+For+Dummies+LittleFairyRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1a73534d2259122fab4be49d6369c095c51589c","infoHashBuffer":{"type":"Buffer","data":[161,167,53,52,210,37,145,34,250,180,190,73,214,54,156,9,92,81,88,156]},"announce":[],"urlList":[]}}