{"title":"Coast to Coast AM March 04 2013","uid":8224352,"size":55646724,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a1ea87693aa5bf671c2a939681bc331e8a5ce443&amp;dn=Coast+to+Coast+AM+March+04+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1362557820,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t03-04-13\nHost: \tGeorge Noory\nGuests: \tJosh Gates, Gerald Celente\n\nAdventurer and explorer of the haunted and unknown, Josh Gates, discussed his travels to over 93 countries exploring how mysterious creatures and hauntings are a worldwide phenomena. As host of the popular Syfy series Destination Truth, Gates said that he logs at least 100,000 flight miles a year and spends 2 or 3 months at a time traveling around the globe investigating paranormal mysteries. &quot;The paranormal is something that is not just an American thing or a Western thing,&quot; he said, &quot;people tell these stories all over the world.&quot; Over the course of the evening, Gates recounted his visits to Chernobyl and the haunted Hoia Baciu forest in Romania as well as the night he spent in King Tut's tomb.\n\nHaving spent the last five years on Destination Truth, Gates shared some insights into the making of the program. For instance, he talked about how visiting these exotic locations often requires dining on local cuisine, such as fried spiders, hot cow's blood, and an egg dish called balut, and it is considered rude to turn down a meal, regardless of how foreign it may be to one's palate. Additionally, Gates explained how the program sometimes uses local guides to help avoid danger. To that end, he recounted traveling to the Amazon to do an episode about the giant anaconda and having the guide stop him before he could exit the boat. The guide warned him about a seemingly innocuous 6-inch long snake nearby in the water and told him &quot;it's lethal. That thing bites you and you're gone.&quot;\n\nGates also discussed his new program, Stranded, which aims to put a different spin on the popular ghost hunting TV show genre. He explained that the program eschews paranormal experts in favor of a group of laypeople, consisting of a believer, a skeptic, and a person &quot;in the middle.&quot; They are then given cameras and tasked with spending five days living in a haunted location. &quot;We cover the property in surveillance cameras,&quot; Gates said, &quot;there's no script and there's no producers or camera operators in there with them.&quot; He noted that the confined quarters, coupled with the frightening experiences therein, can sometimes lead to the team members clashing with one another as the stress mounts. At the conclusion of the five days, the group discuss their experiences and if their perspective on ghosts has changed.\nEconomic Trends\n\nIn the first hour, trends analyst Gerald Celente talked about a news report concerning a decrease inusage as well as the current state of the economy. He said that the novelty ofappears to have greatly diminished as mobile apps, like Instagram, grow in popularity. Celente observed that it is another sign of the fleeting nature of Internet popularity and cited the decrease in value for Myspace which went from $580 million in 2005 to a mere $35 million in 2011. Regarding the economy, Celente warned that there is an &quot;entire global meltdown&quot; underway and lamented that, in previous economic collapses throughout history, world wars soon developed thereafter. He also decried the concept that businesses are &quot;too big to fail&quot; and declared that it was the antithesis of capitalism and, instead, was simply a form of fascism.\n\nNews segment guest: James McCanney\nWebsite(s):\n\n    joshuagates.com\n    syfy.com/stranded\n    trendsresearch.com\n\nBook(s):\n\n    Destination Truth: Memoirs of a Monster Hunter\n    Trend Tracking\n    What Zizi Gave Honeyboy\n    Trends 2000\n\n","torrent":{"xt":"urn:btih:a1ea87693aa5bf671c2a939681bc331e8a5ce443","amp;dn":"Coast+to+Coast+AM+March+04+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1ea87693aa5bf671c2a939681bc331e8a5ce443","infoHashBuffer":{"type":"Buffer","data":[161,234,135,105,58,165,191,103,28,42,147,150,129,188,51,30,138,92,228,67]},"announce":[],"urlList":[]}}