{"title":"VA - JÃƒÂ¤germeister Music Tour (2007) 320 vtwin88cube","uid":6536546,"size":169452701,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a326708b00601f5a0df9d9b4da8b2ad02b4b479b&amp;dn=VA+-+J%C3%83%C2%A4germeister+Music+Tour+%282007%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1310537695,"description":"JÃƒÂ¤germeister Music Tour 2007\n\n\n\n\nFirst JÃƒÂ¤germeister was started in 2002 and had Drowning Pool headlining, featuring Ill NiÃƒÂ±o, Coal Chamber, 40 Below Summer and other local bands. The tour had 37 dates that started March 8 and went to April 23. The tour has happened twice a year since then. Spring 2003 tour went from March 6 to April 20 and featured Saliva, Hed PE headlining, along with Breaking Benjamin, Systematic, Stereomud, and local bands. Fall 2003 went from October 8 to November 29 and featured Slayer Headlining with Hatebreed, Arch Enemy, and local bands. Spring 2004 stretched from March 30 to May 14 and featured Slipknot headlining with Fear Factory, Chimaira, and local bands. Fall 2004 went from October 31 to December 17 and featured Slayer's second headlining of this tour along with Killswitch Engage, Mastodon, and local bands such as Q. Spring 2005 went from March 29 to May 6 and featured Alter Bridge as the headlining band with Future Leaders of the World, Submersed, and local bands. In Fall 2005 the tour was headlined by Disturbed with other bands, Bloodsimple, A Dozen Furies, Corrosion of Conformity, and other local bands. This one stretched from November 11 to February 23. In the spring of 2006 the tour went from April 20 to June 16 and had Staind headlining with Three Days Grace, Hurt, and other local bands.\n\nThe Fall 2006 tour started October 19 and went to December 9, and featured Slightly Stoopid and Pepper as headliners and multiple &quot;guest bands&quot; including Rev. Right Time, Kicking K8, as well as six other bands. Beginning with the Spring 2003 tour, the event has been hosted by The Lizardman who appears onstage throughout the night performing sideshow stunts, stand-up, and introducing the bands. This years Fall 2008 line-up featured Hinder headlining, with Buckcherry headlining in Dallas, Trapt and Rev Theory at most shows, and Drowning Pool, In This Moment, Shinedown, Hollywood Undead, Theory of a Deadman, Shinedown, Puddle of Mudd, The Red Jumpsuit Apparatus and Smile Empty Soul making appearances at some shows, along with a local band from each venue's area in tow. The Spring 2009 line-up will feature longtime staples on the punk scene, Pennywise and returning to the tour are the Hawaiian grown reggae rockers Pepper.[1] Beginning in April 2010, the JÃƒÂ¤germeister Music Tour will embark on a Canadian leg featuring Korn as headliners, with Five Finger Death Punch and 2Cents as support. Starting in September 2010 the Muisc Tour will have Slayer returning as well as Megadeth and Anthrax. In January 2011 the tour will have Buckcherry headlining with Hellyeah and direct support with All That Remains also playing.\n\n\nFormat:\t\t\tMp3\nBit Rate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\n\n\n\n\nAudio-Info:\n\n\n01.Hell &amp; Consequences - Stone Sour\n02.Eyes Of The Insane - Slayer\n03.Xerces - Deftones\n04.Some Day - Shinedown\n05.No Control - Pepper\n06.Thinkin' Bout Cops - Slightly Stoopid\n07.Venus (In Our Blood) - Him\n08.Fragile - Lacuna Coil\n09.Crushing Belial (Live) - Shadows Fall\n10.Daylight Dies - Killswitch Engage\n11.Never Let It Die - Hatebreed\n12.Rio Bravo - Cky\n13.Out To Sea - Smile Empty Soul\n14.Power Player - Clutch\n15.Eighth Lock - Gwar\n16.Survive (American Apathy Mega Mix) - Dope\n17.The Doubt (This Is Wrong Mix) - Mushroomhead\n18.Burn My Words - Soil\n19.Old - Brand New Sin\n\n\n\n\n\n\n\n\n\n\n              ****Support the artists &amp; buy it if you like it.****\n\n\n                  ****Enjoy &amp; please don't forget to seed!****\n\n\n\n\n","torrent":{"xt":"urn:btih:a326708b00601f5a0df9d9b4da8b2ad02b4b479b","amp;dn":"VA+-+J%C3%83%C2%A4germeister+Music+Tour+%282007%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a326708b00601f5a0df9d9b4da8b2ad02b4b479b","infoHashBuffer":{"type":"Buffer","data":[163,38,112,139,0,96,31,90,13,249,217,180,218,139,42,208,43,75,71,155]},"announce":[],"urlList":[]}}