{"title":"WAR OF THE WORLDS H G WELLS [AUDIO BOOK]","uid":7257953,"size":175985961,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a3af3f444a84b69daaba2b1747e39fca0973c033&amp;dn=WAR+OF+THE+WORLDS+H+G+WELLS+%5BAUDIO+BOOK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"uk_spuddybuddy","files":1,"time":1336642487,"description":"this is a public domain recording and free to use for educational purposes\nThe War of the Worlds (1898), a science fiction novel by Herbert George Wells, is the first-person narrative of an unnamed protagonist's adventures in London and the countryside southwest of London as Earth is invaded by Martians. Written in 1895-1897,[2] it is one of the earliest stories that details a conflict between mankind and an alien race.\n\nThe War of the Worlds has two parts, Book One: The Coming of the Martians and Book Two: The Earth under the Martians. The narrator, a philosophically inclined author, struggles to return to his wife while seeing the Martians lay waste to southern England. Book One (Chapters 14, 16, and 17) imparts the experience of his brother, also unnamed, who describes events in the capital and escapes the Martians by boarding a ship near Tillingham on the coast sixty-five miles northeast of London and is not mentioned again.\n\nThe plot has been related to invasion literature of the time. The novel has been variously interpreted as a commentary on evolutionary theory, British imperialism, and generally Victorian fears and prejudices. At the time of publication it was classified as a scientific romance, like his earlier novel The Time Machine. The War of the Worlds has been both popular (it has never gone out of print) and influential, spawning half a dozen feature films, radio dramas, various comic book adaptations, a television series, and sequels or parallel stories by other authors. It has even influenced the work of scientists, notably Robert Hutchings Goddard.[3][4]\n\n","torrent":{"xt":"urn:btih:a3af3f444a84b69daaba2b1747e39fca0973c033","amp;dn":"WAR+OF+THE+WORLDS+H+G+WELLS+%5BAUDIO+BOOK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3af3f444a84b69daaba2b1747e39fca0973c033","infoHashBuffer":{"type":"Buffer","data":[163,175,63,68,74,132,182,157,170,186,43,23,71,227,159,202,9,115,192,51]},"announce":[],"urlList":[]}}