{"title":"Wallace_Randall-The_Touch.epub","uid":9145690,"size":355030,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a411153e0594c407ecf55246ce7d50f3b2931246&amp;dn=Wallace_Randall-The_Touch.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1383589693,"description":"2012 Christy Award finalist, Contemporary series category. Andrew Jones was once one of the few surgeons in the world to have that rare, God-given ability called &quot;The Touch.&quot; But after failing to save his young fiancee, Faith, at the scene of a car accident, Jones abandons his gift and shuns the operating room. Lara Blair owns a Chicago-based biomedical engineering company developing a surgical tool that will duplicate precisely the movement of a surgeon's hands, reducing or eliminating failed surgical procedures. Lara has pursued the best surgeons in the world to test this surgical tool, and all of them have failed. As Lara pursues Jones's skill for her project, Jones's stubborn resistance cracks, and he begins to open up to her about the wounds that still haunt him. But when Jones discovers the urgency behind Lara's work, he must choose to move beyond his past. As each is forced to surrender secret fears, they are bonded together through the lives of the people Jones serves and by the healing secret that Faith left behind.\nGenre: Fiction/General","torrent":{"xt":"urn:btih:a411153e0594c407ecf55246ce7d50f3b2931246","amp;dn":"Wallace_Randall-The_Touch.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a411153e0594c407ecf55246ce7d50f3b2931246","infoHashBuffer":{"type":"Buffer","data":[164,17,21,62,5,148,196,7,236,245,82,70,206,125,80,243,178,147,18,70]},"announce":[],"urlList":[]}}