{"title":"Adler's Appetite - E.P. and Singles (V.B.R. MP3)","uid":7219806,"size":88280152,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a4a40d5e6d221906aba2f58c3d9e779267d40859&amp;dn=Adler%27s+Appetite+-+E.P.+and+Singles+%28V.B.R.+MP3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jerrbear","files":-1,"time":1335495191,"description":"Adler's Appetite, previously Suki Jones, is an American rock band from Los Angeles, California, formed in 2003. As of 2011, the lineup consists of Patrick Stone (lead vocals), Michael Thomas (guitar), Lonnie Paul (guitar), Chip Z'nuff (bass) and Steven Adler (drums, percussion). Along with original material, the band perform covers of Adler's former band Guns N' Roses, primarily songs from the album Appetite for Destruction.\n\nFormer Slash's Snakepit guitarist Keri Kelli first formed the band in 2003, with the original lineup consisting of Adler, Faster Pussycat guitarist Brent Muscat, former Ratt bassist Robbie Crane as well as then-Ratt singer Jizzy Pearl, also formerly of Love/Hate. The band toured the US and Europe, with a number of musicians filling in for band members due to other commitments. Following the departure of Muscat in 2004, they recorded and released the Adler's Appetite EP in January 2005. The same year, Adler announced a new lineup of the band, adding singer Sheldon Tarsha, Enuff Z'nuff bassist Chip Z'nuff, former Beautiful Creatures and Tuff guitarist Michael Thomas as well as Izzy Stradlin guitarist JT Longoria in place of Pearl, Crane and Kelli.\n\nAdler's Appetite toured before briefly going on hiatus in 2006. They returned in 2007, with Hollywood Roses singer Colby Veil replacing Tarsha, and Pretty Boy Floyd guitarist Kristy Majors replacing Longoria. The following year, Tarsha returned to the band, while Majors was replaced by former Quiet Riot and Beautiful Creatures guitarist Alex Grossi. Tarsha's return would be short-lived, once again departing the band with Ladyjack vocalist Rick Stitch joining in his place. With this lineup, they released new material, for the first time since 2005, releasing the singles &quot;Alive,&quot; &quot;Stardog&quot; and &quot;Fading&quot; in 2010. When Quiet Riot reformed the same year, Grossi departed Adler's Appetite in 2011, with Ladyjack guitarist Robo filling in for a European tour. However, following the tour, both Stitch and Robo departed the band, replaced by Aces 'N' Eights singer Patrick Stone as well as guitarist Lonnie Paul.","torrent":{"xt":"urn:btih:a4a40d5e6d221906aba2f58c3d9e779267d40859","amp;dn":"Adler%27s+Appetite+-+E.P.+and+Singles+%28V.B.R.+MP3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4a40d5e6d221906aba2f58c3d9e779267d40859","infoHashBuffer":{"type":"Buffer","data":[164,164,13,94,109,34,25,6,171,162,245,140,61,158,119,146,103,212,8,89]},"announce":[],"urlList":[]}}