{"title":"Bob Dylan Does Cat in the Hat","uid":3669857,"size":58499921,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a4ccf5d57c8be253de6ae8a4c22a44f1478d3b6f&amp;dn=Bob+Dylan+Does+Cat+in+the+Hat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smartlikeafish","files":1,"time":1177178010,"description":"THe artwork is included in the zip folder. My first upload. This is someone who sounds just like early Dylan doing covers of his songs with the lyrics of Dr. Seuss\n\nTangled up in Seuss- article on album by Salon.com\n\nWhen a musician recorded \\\\\\&quot;Green Eggs and Ham\\\\\\&quot; in the voice of vintage Bob Dylan and posted it online, the Grinch estate promptly replied: One fish, two fish, cease and desist.\n\nBy Dan Brekke\n\n\nApril 13, 2007 | Kevin Ryan doesn&amp;#039;t want to talk about his recent fling with Web stardom. He&amp;#039;s a bit rueful and more than a little nervous about it, in fact, and wishes the whole thing would just go away.\n\nIf you missed his star turn, here&amp;#039;s what happened: Ryan, a 33-year-old Houston music producer and author, went into his home studio and engineered a sort of retro mash-up of two of his favorite artists, Bob Dylan and Dr. Seuss.\n\nRyan took the text from seven Seuss classics, including \\\\\\&quot;The Cat in the Hat\\\\\\&quot; and \\\\\\&quot;Green Eggs and Ham,\\\\\\&quot; and set them to original tunes that sounded like they were right off Dylan\\\\\\&amp;#039;s mid-\\\\\\&amp;#039;60s releases. He played all the instruments and sang all the songs in Dylan\\\\\\&amp;#039;s breathy, nasal twang. He registered a domain name, dylanhearsawho.com, and in February posted his seven tracks online, accompanied by suitably Photoshopped album artwork, under the title \\\\\\&quot;Dylan Hears a Who.\\\\\\&quot;\n\n\\\\\\&quot;Green Eggs and Ham\\\\\\&quot; was set to a tune and arrangement somewhere between \\\\\\&quot;Highway 61 Revisited\\\\\\&quot; and \\\\\\&quot;Subterranean Homesick Blues,\\\\\\&quot; complete with Dylan\\\\\\&amp;#039;s rushed, occasionally sneering phrasing. Familiar passages are run together in impatient run-ons:\n\nWould you eat them in a box?\nWould you eat them with a fox?\nNot in a box not with a fox\nNot in a house not with a mouse\nI would not eat them here or there\nI would not eat them anywhere\n\nAll this accompanied by an up-tempo electric band, complete with the jaunty skirling of a Hammond organ.\n\nIt was clever and delightful. Ryan had immersed himself so fully in Seuss\\\\\\&amp;#039; words and Dylan\\\\\\&amp;#039;s style that he managed to merge two quite different creative intelligences. Many who have heard the tracks come away convinced they\\\\\\&amp;#039;re really listening to Bob Dylan.\n\nReached in Houston, Ryan confirmed the work was his but declined to speak about it on the record except to say he never expected it to attract any attention. Instead, \\\\\\&quot;Dylan Hears a Who\\\\\\&quot; was quickly picked up by bloggers and the popular Web site BoingBoing and went viral, attracting hundreds of thousands of visitors.\n\nThen Dr. Seuss Enterprises, the La Jolla, Calif., firm that publishes the works of the late Theodor Geisel, heard \\\\\\&quot;Dylan Hears a Who.\\\\\\&quot; Only two weeks after word of the site began spreading, Ryan got a cease-and-desist demand from the Seuss lawyers, who said the site and songs infringed the company\\\\\\&amp;#039;s copyrights and trademarks. Ryan complied quickly and quietly. Instead of the Dylan/Seuss tracks, visitors to dylanhearsawho.com find a brief message saying the site has been \\\\\\&quot;retired\\\\\\&quot; at the request of Dr. Seuss Enterprises.\n\nIf you were caught up in the momentary wonder of how someone could execute such an ingeniously perfect blending of period musical style, \\\\\\&amp;#039;60s attitude and loopy storytelling, it was tempting to see all of this as just another case of a heavy-handed corporate copyright holder -- a master of copyright war, to call on the old Dylan oeuvre -- sticking it to the little guy.\n\nRyan -- best known as the coauthor of \\\\\\&quot;Recording the Beatles,\\\\\\&quot; a meticulous investigation of every track, take and song the group committed to vinyl -- was face-to-face with a company that zealously guards its intellectual property. Losing a copyright-infringement case can be extremely expensive. In addition to the federal law\\\\\\&amp;#039;s $150,000 maximum in statutory damages, defendants can find themselves on the hook for the plaintiff\\\\\\&amp;#039;s legal fees. (Dr. Seuss Enterprises declined comment on \\\\\\&quot;Dylan Hears a Who,\\\\\\&quot; questioning why it was even a subject of interest. Dylan\\\\\\&amp;#039;s attorney did not return a call for comment on Ryan\\\\\\&amp;#039;s work.)\n\nAs it happens, if Ryan was going to get into a fight over the legal limits of parody, he couldn\\\\\\&amp;#039;t have run into a better-prepared opponent than Dr. Seuss Enterprises. The company helped write an important chapter in current case law regarding what is and what isn\\\\\\&amp;#039;t parody for purposes of fair use. In 1996, Dr. Seuss successfully sued Penguin Books to stop publication of \\\\\\&quot;The Cat NOT in the Hat,\\\\\\&quot; a send-up of the O.J. Simpson murder written and illustrated in the Seuss style.\n&lt;A HREF=\\\\\\&quot;http://a.tribalfusion.com/h.click/a6mMvf3svgTsYbVVJhRmFnWtrUWFFP3baqWEnvWEvcQEYFSGFBPUupStr8Wcr54UXvnteo0aav4WbZbPsrD2mQZcptXsVWBb0UQkXrBeXaAnPbQHWFv0WHJ1oF3tPrfp1TFr4TFi5EM2mTFKYUURmSTwKV/1595069818\\\\\\&quot; TARGET=\\\\\\&quot;_blank\\\\\\&quot;&gt;&lt;IMG SRC= WIDTH=300 HEIGHT=250 BORDER=0&gt;&lt;/A&gt;\n\nStill, the Copyright Law of the United States was put on the books by the very first Congress not to secure the intellectual property rights of the corporate few, but to \\\\\\&quot;promote the progress of Science and the Useful Arts\\\\\\&quot; -- even when that progress involves a writer, artist or musician lifting words, images or melodies from one source as part of making something new.\n\nSo if there was a legal defense for Ryan using Dr. Seuss\\\\\\&amp;#039; words and images -- and Dylan\\\\\\&amp;#039;s name and likeness, for that matter -- it probably lay in the Copyright Law\\\\\\&amp;#039;s \\\\\\&quot;fair use\\\\\\&quot; exception. The provision, which reaches back at least to early 18th century English law, allows \\\\\\&quot;the fair use of a copyrighted work ... for purposes such as criticism, comment, news reporting, teaching ... scholarship, or research.\\\\\\&quot;\n\nWhat does that mean when it comes to the unlikely trio of Dylan, Seuss and Ryan?\n\nI asked Jennifer Rothman, an assistant professor at Washington University Law School in St. Louis who specializes in intellectual property, entertainment law and the First Amendment. Her take surprised me, coming from someone who said she\\\\\\&amp;#039;s on the side of small creators vs. corporate intellectual property interests.\n\n\\\\\\&quot;There\\\\\\&amp;#039;s no question that big intellectual property holders are intimidating small-time players with cease-and-desist letters and unreasonable I.P. claims and that the small players often buckle under,\\\\\\&quot; she said. \\\\\\&quot;This does chill speech.\\\\\\&quot;\n\nBut the general climate aside, she said Ryan \\\\\\&quot;is not standing on solid ground. If I were him, I wouldn\\\\\\&amp;#039;t want to litigate this because most courts would likely find he violated current I.P. law.\\\\\\&quot;\n\n Then she walked me through her reasoning, using as a primer Campbell v. Acuff-Rose, the U.S. Supreme Court\\\\\\&amp;#039;s unanimous 1992 ruling that found 2 Live Crew\\\\\\&amp;#039;s smutty, suggestive and sophomoric take-off on Roy Orbison\\\\\\&amp;#039;s \\\\\\&quot;Oh, Pretty Woman\\\\\\&quot; deserved fair-use protection as parody.\n\nThe key to the court\\\\\\&amp;#039;s finding was that Luther Campbell, the author of the 2 Live Crew work, did more than grab snippets of the original lyrics and sample portions of the song\\\\\\&amp;#039;s instrumental track. In the language of fair use, Campbell\\\\\\&amp;#039;s version was a \\\\\\&quot;transformative\\\\\\&quot; new work.\n\n\\\\\\&quot;While we might not assign a high rank to the parodic element here, we think it fair to say that 2 Live Crew\\\\\\&amp;#039;s song reasonably could be perceived as commenting on the original or criticizing it, to some degree,\\\\\\&quot; Associate Justice David Souter wrote for the court. \\\\\\&quot;2 Live Crew juxtaposes the romantic musings of a man whose fantasy comes true, with degrading taunts, a bawdy demand for sex, and a sigh of relief from paternal responsibility. The later words can be taken as a comment on the naivete of the original of an earlier day, as a rejection of its sentiment that ignores the ugliness of street life and the debasement that it signifies.\\\\\\&quot;\n\nHowever, whether a work is \\\\\\&quot;transformative\\\\\\&quot; in going beyond an original with \\\\\\&quot;new expression, meaning, or message,\\\\\\&quot; is just one of the factors courts must consider when assessing fair use. Judges must also weigh whether a new work is created for profit; whether the original work merits protection from copying; how much of the original was appropriated to make a new work; and what market impact the appropriation might have on the original work.\n\nIn Rothman\\\\\\&amp;#039;s opinion, Ryan\\\\\\&amp;#039;s work flunks two essential tests.\n\nFirst, it fails to be a transformative work in that there\\\\\\&amp;#039;s no clear comment on or criticism of the Seuss original. \\\\\\&quot;I think he\\\\\\&amp;#039;s not even close to the line on this. He\\\\\\&amp;#039;s far in the infringing camp,\\\\\\&quot; Rothman said.\n\nSecond, \\\\\\&quot;Dylan Hears a Who\\\\\\&quot; appropriates too much of the original material. \\\\\\&quot;It takes the entire Dr. Seuss material; it\\\\\\&amp;#039;s not like taking just a few lines to make a point,\\\\\\&quot; Rothman said. \\\\\\&quot;One question a court would ask is, Did the defendant take more than was necessary for a parody? and here I think the answer is clearly yes.\\\\\\&quot; The one factor that might weigh in Ryan\\\\\\&amp;#039;s favor, Rothman said, is that \\\\\\&quot;Dylan Hears a Who\\\\\\&quot; did not appear to be commercial.\n\nI asked Rothman to back up for a moment and consider an argument that went like this: By inserting Dr. Seuss\\\\\\&amp;#039; words into a novel context, specifically, the voice and style of a radical 1960s troubadour, the \\\\\\&quot;Dylan Hears a Who\\\\\\&quot; project comments on the original work by exposing a sly, rebellious, countercultural dimension to his work that has remained hidden. At the same time, it exposes a playful though pointed creative intelligence shared by two of the most important figures of the 1960s.\n\nRothman said that wasn\\\\\\&amp;#039;t a bad stab at a defense, but didn\\\\\\&amp;#039;t think a court would buy it. \\\\\\&quot;It\\\\\\&amp;#039;s too obvious that the point of the site is, Wouldn\\\\\\&amp;#039;t it be fun to sing Dr. Seuss in a Dylan voice? And that\\\\\\&amp;#039;s not something most courts would be sympathetic to.\\\\\\&quot;\n\nRyan himself -- speaking, of course, after he heard from Seuss\\\\\\&amp;#039; lawyers -- seems to confirm Rothman\\\\\\&amp;#039;s judgment when he wrote in an online forum that \\\\\\&quot;Dylan Hears a Who\\\\\\&quot; was merely \\\\\\&quot;a fun little project.\\\\\\&quot; Having fun doesn\\\\\\&amp;#039;t make it impossible to produce parody, but to have a ghost of a chance of prevailing in a fair-use dispute, you need some serious justification and the ability to demonstrate it. In a sense, Ryan undid his most serious defense by admitting he used someone else\\\\\\&amp;#039;s protected material just for fun.\n\nRyan\\\\\\&amp;#039;s work aside, Rothman said the current copyright regime is an increasing burden to artists and one that, the three-century history of fair use notwithstanding, is drawing an ever tighter circle around the choices of writers, musicians, filmmakers and creators of all stripes.\n\nA case in point is an often-cited incident involving filmmaker Jon Else and his 1999 documentary \\\\\\&quot;Sing Faster: The Stagehands\\\\\\&amp;#039; Ring Cycle.\\\\\\&quot; As detailed in \\\\\\&quot;Free Culture,\\\\\\&quot; by Stanford University law professor Lawrence Lessig, Else shot a scene of stagehands playing checkers. In the background, \\\\\\&quot;The Simpsons\\\\\\&quot; was on TV. Else wanted to use a four-and-a-half-second shot that included the cartoon, which was incidental to the scene. It was probably a case of fair use, but he sought permission from the copyright owners. Fox said Else could use the 4.5 seconds at its educational rate: $10,000. Dismayed by the cost and the prospect of costly and time-consuming litigation to keep the shot intact, the filmmaker dropped his request and wound up digitally substituting a documentary he owns the rights to onto the TV in the scene.\n\n\n\\\\\\&quot;In theory, fair use means you need no permission,\\\\\\&quot; Lessig concludes. \\\\\\&quot;The theory therefore supports free culture and insulates against a permission culture.\\\\\\&quot; But summarizing Else\\\\\\&amp;#039;s experience, he says, \\\\\\&quot;The fuzzy lines of the law, tied to the extraordinary liability if lines are crossed, means that the effective fair use for many types of creators is slight. The law has the right aim; practice has defeated the aim.\\\\\\&quot;\n\nSo is there hope for daring creators? Even those who, like Ryan, make something remarkable on a lark? Rothman points to efforts such as the Chilling Effects Clearinghouse, set up by the Electronic Frontier Foundation and law clinics at Harvard, UC-Berkeley, Stanford and several other universities to help pool information on copyright issues and advice for artists facing cease-and-desist demands.\n\nBut she also suggests that the most effective response might be fighting fire with fire: being prepared to go to court to fight unreasonable intellectual property demands from corporations. Of course, a movement like that would need deep pockets, and Rothman says some have arrived on the scene: Google, for instance, which has seen copyright law become a major factor in many of its activities.\n\n\\\\\\&quot;We\\\\\\&amp;#039;re just starting to see a movement to push back,\\\\\\&quot; she said. \\\\\\&quot;I and other I.P. scholars are saying we need more litigation of these questions.\\\\\\&quot;\n\nIn the meantime, \\\\\\&quot;Dylan Hears a Who\\\\\\&quot; lives on, even if Ryan\\\\\\&amp;#039;s site is shut down. The songs were online long enough for music fans to do what fans do on the Web: copy the songs and repost them. Despite the fumings of the intellectual property grinches, Bob Dylan\\\\\\&amp;#039;s gig with Dr. Seuss is guaranteed a long run.  \n","torrent":{"xt":"urn:btih:a4ccf5d57c8be253de6ae8a4c22a44f1478d3b6f","amp;dn":"Bob+Dylan+Does+Cat+in+the+Hat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4ccf5d57c8be253de6ae8a4c22a44f1478d3b6f","infoHashBuffer":{"type":"Buffer","data":[164,204,245,213,124,139,226,83,222,106,232,164,194,42,68,241,71,141,59,111]},"announce":[],"urlList":[]}}