{"title":"Dear_Tony(2013)","uid":9082465,"size":553827,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a5156ef367b1a47f5c0b769f7680651d7dddaee9&amp;dn=Dear_Tony%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dear_Tony","files":-1,"time":1382402418,"description":"v1.01\n                                                                                        \n    _/_/_/                                      _/_/_/_/_/                              \n   _/    _/    _/_/      _/_/_/  _/  _/_/          _/      _/_/    _/_/_/    _/    _/   \n  _/    _/  _/_/_/_/  _/    _/  _/_/              _/    _/    _/  _/    _/  _/    _/    \n _/    _/  _/        _/    _/  _/                _/    _/    _/  _/    _/  _/    _/     \n_/_/_/      _/_/_/    _/_/_/  _/                _/      _/_/    _/    _/    _/_/_/      \n                                                                               _/       \n                                                                          _/_/           \n\n\n\n\nIntroduction to this version:\n\nDear_Tony (2013) is an unauthorized, distributed retrospective of the public sculptures of Tony Smith by Christian de Vietri and A.E. Benenson.\n\nAddressed as much to the deceased sculptor and his practice as our contemporary audience, Dear_Tony rethinks the artist's historic investigations into modular construction, phenomenology, and public space within the contexts of digital fabrication, interactivity, and networked communication. At the same time, Dear_Tony is a means to reflect on the form of the retrospective and how its requirements may be adapted to contemporary conditions of viewership.\n\nDear_Tony consists of a digital sculpture by Christian de Vietri, which is composed of extractable models of every Tony Smith public sculpture, and is archived in several 3D file formats (.stl, .obj, .3ds); photographic documentation of a 3D printed version of de Vietri's sculpture; as well as a text by A.E. Benenson on the public disposition of Smith's sculptures in contemporary digital culture. \n\nAll the files in the retrospective are considered open-source and can be experienced, \nedited, and shared by anyone.\n\n\nVersion History:\n\nOver the course of nearly two decades (1961-'79), Tony Smith made forty-seven public sculptures using an iterative process for arranging monochrome, modular triangular units into different configurations. Smith made very few advance drawings of these sculptures, instead designing them ad-hoc with three-dimensional models in his studio space, often times borrowing pieces from an earlier sculpture to begin or finish the next.\n\nDespite the fact that Smith's experimental approach to modular, triangle based design precisely predicted the tenets of polygonal computer modeling, there has been no attempt, until now, to critically evaluate his practice's relationship to digital technology.\n\nFor his part, Smith had almost no contact with the then emerging field of art and technology besides an ill-fated partnership with a corrugated box manufacturer organized by LACMA in 1967. This despite the fact that many of the relevant CGI techniques were being developed by contemporaries at Bell Labs (Murray Hill, NJ) less than fifteen minutes away from where the sculptor lived and worked.\n\nCONTACT: info@dear-tony(dot)com","torrent":{"xt":"urn:btih:a5156ef367b1a47f5c0b769f7680651d7dddaee9","amp;dn":"Dear_Tony%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5156ef367b1a47f5c0b769f7680651d7dddaee9","infoHashBuffer":{"type":"Buffer","data":[165,21,110,243,103,177,164,127,92,11,118,159,118,128,101,29,125,221,174,233]},"announce":[],"urlList":[]}}