{"title":"MacTeX 2013 Distribution","uid":8656735,"size":2364636452,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:a557f1c9aa2571416925b668e31c3b2593ca8590&amp;dn=MacTeX+2013+Distribution+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"D_Nelson","files":-1,"time":1373234894,"description":"This is an untouched download of the .pkg file downloaded from the MacTeX homepage (http://tug.org/mactex/) on 7 July, 2013.\n\nI have asked permission to host the file and have requested they add a link to this torrent on their homepage.  As yet I have not heard back so I will either remove this torrent should they ask me to, or I will update this description if I receive permission. Since it's a free download I assume they won't mind me making it available over TPB.\n\nThe description from the MacTeX page is as follows:\n\n&quot;MacTeX is a product produced by the MacTeX TeXnical working group of the TeX Users Group (TUG). It is the Macintosh component of the TeX Collection DVD, the reference edition of TeX distributed by TeX User Groups across the world. The reference edition runs on Mac OS X, Windows, GNU/Linux, various BSD Unix systems, and most other computer architectures.\nThe MacTeX Distribution is available on CTAN or on the TeX Collection DVD (free with membership of TUG or with many of the other Users Groups around the world). Redistribution of files from the MacTeX collection should be done with care after reading the License restrictions by copyright holders.\n\nMacTeX consists of two pieces: MacTeX-2013 and MacTeXtras. MacTeX-2013 is an install package which installs everything needed to run TeX on Mac OS X. The package uses Apple's standard installer; installation takes four to eight minutes and is automatic. MacTeXtras is a collection of optional extras: Additional Front Ends, Spell Checkers, Documentation, and Showcase items.&quot; \nSource: (http://tug.org/mactex/aboutmactex.html)\n\nAgain, I am in no way associated with the development team, nor am I aware of any copyright violations in hosting this file.  Should anyone wish to have it taken down, please contact me via my TPB userpage.  This file is being hosted simply because there are few mirror links (only 1 in the US) and I believe this will allow more users to adopt the system more rapidly.\n\nTHIS IS AN UNTOUCHED COPY OF THE .PKG FILE DOWNLOADED FROM (http://tug.org/mactex/).  ALL I HAVE DONE IS TO PLACE THE .PKG FILE IN A FOLDER ALONG WITH THE LICENSE FILE AVAILABLE ON THE MACTEX USERS GROUP PAGE (http://tug.org/mactex/aboutmactex.html) UNDER THE &quot;License Restrictions&quot; LINK.\n\nEnjoy!","torrent":{"xt":"urn:btih:a557f1c9aa2571416925b668e31c3b2593ca8590","amp;dn":"MacTeX+2013+Distribution+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a557f1c9aa2571416925b668e31c3b2593ca8590","infoHashBuffer":{"type":"Buffer","data":[165,87,241,201,170,37,113,65,105,37,182,104,227,28,59,37,147,202,133,144]},"announce":[],"urlList":[]}}