{"title":"Eco-Library Design -Flannery/Smith- [Non-Fiction] PDF_(K-Slender","uid":9036896,"size":36668016,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a68044f83284c610d68bef6e76a97d4ad4f70809&amp;dn=Eco-Library+Design+-Flannery%2FSmith-+%5BNon-Fiction%5D+PDF_%28K-Slender&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":3,"time":1381530251,"description":"\nPublication Date: April 8, 2014 | ISBN-10: 9400740778 | ISBN-13: 978-9400740778 | Edition: 2014\n\nThe ancient pairing of architecture and books has always been an interesting topic for debate, and the increasing popularity of electronic books has recently added fuel to the fire. However, the bonfires built for the printed version remain unlit. Research undertaken for this publication suggests that the traditional reading room is currently enjoying a renaissance in many different guises, with print and digital media enjoying a symbiotic relationship.\n\nThe digital revolution is just one of the many challenges faced by the library architect. To satisfy the varied requirements of library users, flexible, future proof, indoor and outdoor spaces must now support both passive and active pursuits. These often contrasting demands can vary dramatically from quiet, contemplative reading to audible public performance.\n\nThis publication explores in detail the evolution of the eco-library, focusing on how design teams cope with diminishing resources in diverse geographic and climatic conditions. The featured projects demonstrate measurable reductions in both construction and operating costs through innovative designs that utilise the ecology of a selected site in a positive way. A library development will now inevitably seek to lead by example, visibly demonstrating sound environmental practice, and providing an enhanced user experience for increasingly more discerning patrons.\n\nEco-Library Design provides a worldwide perspective on 21st century trends in library architecture.\nSharing Widget","torrent":{"xt":"urn:btih:a68044f83284c610d68bef6e76a97d4ad4f70809","amp;dn":"Eco-Library+Design+-Flannery%2FSmith-+%5BNon-Fiction%5D+PDF_%28K-Slender","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a68044f83284c610d68bef6e76a97d4ad4f70809","infoHashBuffer":{"type":"Buffer","data":[166,128,68,248,50,132,198,16,214,139,239,110,118,169,125,74,212,247,8,9]},"announce":[],"urlList":[]}}