{"title":"French Literature_ A Very Short Introduction - Lyons. John D","uid":8527963,"size":20609714,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a76bec268e2dbbefa001cdc5abb419185ec3cc1a&amp;dn=French+Literature_+A+Very+Short+Introduction+-+Lyons.+John+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":5,"time":1370073334,"description":"The heritage of literature in the French language is rich, varied, and extensive in time and space; appealing both to its immediate public, readers of French, and also to a global audience reached through translations and film adaptations.\n\nThe first great works of this repertory were written in the twelfth century in northern France, and now, at the beginning of the twenty-first century, include authors writing in many parts of the world, ranging from the Caribbean to Western Africa.\n\nFrench Literature: A Very Short Introduction introduces this lively literary world by focusing on texts - epics, novels, plays, poems, and screenplays - that concern protagonists whose adventures and conflicts reveal shifts in literary and social practices.\n\nFrom the hero of the medieval Song of Roland to the Caribbean heroines of I, Tituba, Black Witch of Salem or the European expatriate in Japan in Fear and Trembling, these problematic protagonists allow us to understand what interests writers and readers across the wide world of French.","torrent":{"xt":"urn:btih:a76bec268e2dbbefa001cdc5abb419185ec3cc1a","amp;dn":"French+Literature_+A+Very+Short+Introduction+-+Lyons.+John+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a76bec268e2dbbefa001cdc5abb419185ec3cc1a","infoHashBuffer":{"type":"Buffer","data":[167,107,236,38,142,45,187,239,160,1,205,197,171,180,25,24,94,195,204,26]},"announce":[],"urlList":[]}}