{"title":"McBirnie - The Truth About de Gaulle (1966)","uid":4739423,"size":1159828,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8b8606e4b7999097a0b1c96072f10518dc028f0&amp;dn=McBirnie+-+The+Truth+About+de+Gaulle+%281966%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"red_gonzo","files":1,"time":1235436732,"description":"This William S. McBirnie's amazing booklet The Truth About de Gaulle (1966) which is an analysis of the political career of Charles de Gaulle, its impact on France, its allies, upon Europe and a world in turmoil. De Gaulle was a French general and statesman who led the Free French Forces during World War II. He later founded the French Fifth Republic in 1958 and served as its first President from 1959 to 1969. As president, Charles de Gaulle ended the political chaos and violence that preceded his return to power. Although he initially supported French rule over Algeria, he controversially decided to grant independence to that country, ending an expensive and unpopular war. A new currency was issued to control inflation and industrial growth was promoted. De Gaulle oversaw the development of atomic weapons and promoted a pan-European foreign policy, seeking to diminish U.S. and British influence; withdrawing France from the NATO military command, he objected to Britain's entry into the European Community and he recognized Communist China. During his term, de Gaulle also faced controversy and political opposition from Communists and Socialists, and a spate of widespread protests in May 1968. De Gaulle retired in 1969, but remains the most influential leader in modern French history. 30 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:a8b8606e4b7999097a0b1c96072f10518dc028f0","amp;dn":"McBirnie+-+The+Truth+About+de+Gaulle+%281966%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8b8606e4b7999097a0b1c96072f10518dc028f0","infoHashBuffer":{"type":"Buffer","data":[168,184,96,110,75,121,153,9,122,11,28,150,7,47,16,81,141,192,40,240]},"announce":[],"urlList":[]}}