{"title":"Yoga Journal (USA) - January/February 2013 (gnv64)","uid":8161886,"size":63988257,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8bf54bfebe50a9eb2c4a63b5ce3f0ada8a473d5&amp;dn=Yoga+Journal+%28USA%29+-+January%2FFebruary+2013+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1361266167,"description":"Yoga Journal - January/February 2013 (USA)\nEnglish | PDF | 170 pages | 61 mb\n\nYoga Journal is an American based media company that publishes a magazine, a website, DVDs, and puts on conferences all devoted to yoga, food and nutrition, fitness, wellness, and fashion and beauty.\n\non the cover\n94 | 5 poses to create stability inside and out\n65 | 3 moves to lengthen your entire spine\n73 | 16 poses for strength &amp; poise\nA1 | Free! Yoga Directory: Classes, teacher trainings, retreats, &amp; more\n90 | Injuries: Why they happen &amp; how to avoid them\n24 | Ready to lose weight? Start by nourishing yourself\n76 | Get a willpower boost: Poses, meditations, &amp; guidance to set you up for success\n\nfeatures\n76 | BOOST YOUR WILLPOWER Discover inner resources that can help you make healthier choices, meet your goals, and change your life for good! by Hill si Dowdfe\n84 | VISIONS OF GRACE With a mat in one hand and a camera in the other, Spanish photographer Wari Om explores the global art of yoga, by Carmei Wroth\n90 | PRACTICE AWARENESS Injuries happen. Four respected yogis weigh in on when and why they're likely to occur, how you can avoid them, and what you can learn from them.\n\nyoga lifestyle\n21 | OM Bringing your practice to life Silent yoga retreats; nourishing ways to lose weight; tips for a healthy, happy heart; guilt-free chocolate; yogi body art.\n34 | KITCHEN Well stocked Treat yourself to the tools you'll need for a healthy and delicious now year.\n39 | EATING WISELY Comfortredefined What if eating feel-good food actually made you feel good? by Tamar Adler\n101 | REVIEWS New books, music, and DVDsr including an Ashtanga video set and the latest musical offering from Benjy Wertheimer; an interview with Cyndi Lee on body image and self-acceptance.\n\npractice\n46 | BASICS Warrior pose I Reveal the flexibility of your hip joints and hip flexor muscles, as well as your abdominal strength, in a vigorous standing pose, by Annie Carpenter\n65 | ALIGN + REFINE Spacc odysscy Take a journey toward greater flexibility and spaciousness with these supported side body stretches, by Jason Crandell\n73 | HOME PRACTICE WITH AME WREN Poise in action Build strength and confidence as you learn to balance in challenging poses,\n94 | MASTER CLASS WITH MARLA APT Positive spin When you focus on simple actions, Parivrtta Janu Sirsasana becomes sweetly calming,\n\ninspiration\n57 | INTERVIEW Light on practice Geeta Iyengar shares memories of a life infused by yoga-learning at 3r teaching at 13, and aEways deepening her relationship to the tradition, by Derek Biermann\n164 | YOGA SCENE Higher ground A hike in Nepal, near Mount Everest takes Tree Pose to the top of the world,\n\nin every issue\n10 | EDITOR'S LETTER\n159 | YOGA PAGES\n12 | CONTRIBUTORS\n161 | LIVING WELL\n16 | LETTERS\n161 | CLASSIFIEDS\n\ncover credits\nmodel: Cristi Christensen; stylist: Kathryn McRrtchte; photography: David Roth.","torrent":{"xt":"urn:btih:a8bf54bfebe50a9eb2c4a63b5ce3f0ada8a473d5","amp;dn":"Yoga+Journal+%28USA%29+-+January%2FFebruary+2013+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8bf54bfebe50a9eb2c4a63b5ce3f0ada8a473d5","infoHashBuffer":{"type":"Buffer","data":[168,191,84,191,235,229,10,158,178,196,166,59,92,227,240,173,168,164,115,213]},"announce":[],"urlList":[]}}