{"title":"Negroes and the Gun: The Black... (2014) Nicholas Johnson (multi","uid":9505887,"size":17158857,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a94a53028d70bdd924d60e75a88e70a57a7f0130&amp;dn=Negroes+and+the+Gun%3A+The+Black...+%282014%29+Nicholas+Johnson+%28multi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1390317179,"description":"Negroes and the Gun: The Black Tradition of Arms (2014) Nicholas Johnson (multi)\n\n\nNegroes and the Gun: The Black Tradition of Arms by Nicholas Johnson\n\n\nFormat: mobi/epub/azw3\nLength: 382 pages\nGenre: Non-Fiction/Social History\nDate: 14 January 2014\n\nAmerica's gun culture is often thought to be lily white. In this groundbreaking book, Nicholas Johnson shows how African Americans, from the abolitionists to the Deacons for Defense and Justice, have taken up arms time and again to fight for their rights and their lives. You'll never look at guns and the Second Amendment in the same way again.\n\nExpected to be subservient first as slaves and then as second-class freedmen, African-Americans spent generations expecting neither legal justice nor fair treatment from law enforcement. In this provocative book, Johnson, a legal expert on gun issues, agrees with Ida B. Wells and Frederick Douglass that gun ownership for blacks helped level the disparity between races, allowing both men and women to protect themselves from being returned to slavery or becoming the next lynching victims while also allowing some to work as Buffalo soldiers or as cowboys.\n\nJohnson notes that the presence of guns sometimes unwittingly escalated violence, and he devotes a brief chapter to modern black-on-black violence, the result of a strain of historical gun ownership evolving into a 'criminal microculture'. Filled with tightly packed, well-documented anecdotes - with some of the best centering on women such as 'Black Mary' Fields, who worked for nuns and successfully dueled with a white man in front of them - this book redefines the image of black Americans who chose a strong, spirited fight for self-preservation.\n\nAuthor:\n\nNicholas Johnson (New York, NY) is professor of Law at Fordham Law School, where he has taught since 1993. A graduate of Harvard Law School, he is the lead author of Firearms Law and the Second Amendment: Regulation, Rights and Policy (Aspen 2012). ","torrent":{"xt":"urn:btih:a94a53028d70bdd924d60e75a88e70a57a7f0130","amp;dn":"Negroes+and+the+Gun%3A+The+Black...+%282014%29+Nicholas+Johnson+%28multi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a94a53028d70bdd924d60e75a88e70a57a7f0130","infoHashBuffer":{"type":"Buffer","data":[169,74,83,2,141,112,189,217,36,214,14,117,168,142,112,165,122,127,1,48]},"announce":[],"urlList":[]}}