{"title":"A Century of War 3 of 6 World War I","uid":6467169,"size":3578610776,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aa595d00357b807e45c4261df7f6218a319ffa0d&amp;dn=A+Century+of+War+3+of+6+World+War+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"rambam1776","files":-1,"time":1308001124,"description":"A Century of War 3 of 6 - WWI \n\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1231kbps \nDuration.............: 1:25:59\nResolution...........: 600*452 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 224 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 946,233,764 \n\n\n***Uploaders Note*** - This remarkable boxed set of over 85 films was released in 2009 by the United States National Archives. It consists of wartime footage, movie newsreels, and propaganda films made from World War I through the Vietnam Conflict. No subtitles are available. Furthermore, the majority of the DVDs were produced so that it was not possible to fully separate the films with normal ripping software. Therefore, many of the disks had to be ripped as one long AVI file; some containing multiple films. I have ripped every disk to the highest resolution possible, with an average bit pixel ratio of 1.50. I would have liked to have released it all as one huge torrent (I still might if the demand is high enough), but after all this work, I really do not want this to die an unseeded death, so I have decided to release it in 6 batches to keep the size down. The DVDs contained no special features of any kind. Several of these films were either nominated or even won Academy Awards back in the day, and are not commercially available in any other venue I am aware of. For each torrent, I will include the screenshots and technical stats for one representative film.\n\nRambam 1776\n\n &lt;a href=&quot;\nhttp://www.amazon.com/National-Archives-Century-War-None/dp/B002MD3UL4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/National-Archives-Century-War-None/dp/B002MD3UL4&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/CAilHaaDJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/CAilHaaDJ&lt;/a&gt;\n\n\nDVD 09\nThe Yanks are Coming (1935) A compilation film showing a capsule history of America's involvement in WWI.\nPatriotic Activities (1918) A silent film featuring women war workers, high school boys training for war and more.\nThe Air Force Story: World War I (1953) The history of the United States Air Force and the role of airplanes in WWI.\nWhispering Wires of War (1918) A silent film on the military use of telephones and radios, and how orders are relayed.\nBattle of the North Sea (1918) An animated silent film on the battle of Jutland, plus the sinking of the Hindenburg.\nThe AEF in Siberia (1963) The Allied Expeditionary Force intervention in Russia during a time of revolution.\n\nDVD 10\nWoodrow Wilson: Spokesman for Tomorrow (1956) Newsreel clips, reproductions of documents and cartoons on Woodrow Wilson.\nThe Battle of the Somme (1917) A silent film showing graphic scenes of trench warfare as the British defeat the Germans.\nWorld War I Aircraft (1973) A brief history of the Army Air Service, plus the manufacture of warplanes and training.\n\nDVD 11\nSome Bonds I have Known (1917, 1942) Skits by Charlie Chaplin dramatizing the bonds of friendship, love, marriage, and victory.\nTraining of Colored Troops (1918) This silent film follows a black soldier from his letter of induction to his arrival overseas.\nUniversal Current Events (1917) A silent theatrical newsreel showing Red Cross work in the war and more.\nMeuse-Argonne Offensive (1936) A silent film with dramatic footage of a battlefield under an artillery barrage.\nGas Alarm (1918) silent footage of an anti-gas drill, including clearing trenches with Ayerton fans.\nThe Story of Gen. John J. Pershing (1964) a biography on the general narrated by Bucky Kozlow, introduced by Walter Matthau.\n\nDVD 12\nAllied Offensive, July 1918 (1918) Silent film of US aircraft downing a German plane, plus a vaudeville show and more.\nPershing's crusaders (1919) A silent propaganda film featuring a capsule history of World War I.\nThe Jambon Theatrical Players of the AEF (1918) A silent film featuring performances at base hospitals.\nWorld War I Overseas Flyers Reunion (1962) A color film on the exploits of America's first fighter pilots as they hold a reunion.\nThe League of Nations at Work (1937) A documentary tracing the history of the League of Nations from its birth to its successes.\n","torrent":{"xt":"urn:btih:aa595d00357b807e45c4261df7f6218a319ffa0d","amp;dn":"A+Century+of+War+3+of+6+World+War+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa595d00357b807e45c4261df7f6218a319ffa0d","infoHashBuffer":{"type":"Buffer","data":[170,89,93,0,53,123,128,126,69,196,38,29,247,246,33,138,49,159,250,13]},"announce":[],"urlList":[]}}