{"title":"Quake 2 SS Wehrmacht with Ground Zero Mission Pack","uid":8383068,"size":362217562,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:aa6e0d6cca24342c3e6d513c3e61242eb893258e&amp;dn=Quake+2+SS+Wehrmacht+with+Ground+Zero+Mission+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xbox06032","files":2,"time":1366220116,"description":"Game: Quake 2 v3.20 SS Wehrmacht Pak with Ground Zero-Mission Pack\n\nPlatform: Windows OS\n\nVersion: 3.20 &amp; 3.23\n\nSize: (Post Installation) 345mb\n\n\nThis is a Loaded Quake 2 Installer. Too big for other hosting sites so I picked Piratebay. Quake 2 SS Wehrmacht with Ground Zero Mission Pack and Server Browser. It has many aspect redone starting with all Consoles, (Conback, of course) Conchars, Inventory Menu, New Health and Ammo Numbers. A 100% revamped Power &amp; Weapons Icons.\nAs well as Ammo Icons that are very colorful and of high quality. \n\nEvery Icon from A-Z has been &quot;Germanized&quot; as well as their sounds. Also some items in the game have been replaced along with their sounds. Your weapons Inventory right down to the the Health kits have new look to them. Plus remember you have a Mission Pack known as Ground Zero to check out. Which has entirely more maps and weapons to check out. Even if your sick of Single Player- you can find other players from\nany country in the world through the Online Browser which is included.\n\n(I do not mean the browser in the game but a external one added) :-) All you need to do is load the Quake 2 Server Browser. Pick from hundreds of MAPS and MODs to play in. This version of Quake 2 Installer is well worth the download. This also contains the version 3.23 Upgrade Patch with it's documentation. You also have a Dedicated Server for both the Quake 2 and the Mission Pack's Ground Zero.\n\nWell enjoy your download and most of all- by all means......\n\nSEED ! SEED ! SEED ! SEED ! SEED ! SEED ! SEED ! SEED ! ","torrent":{"xt":"urn:btih:aa6e0d6cca24342c3e6d513c3e61242eb893258e","amp;dn":"Quake+2+SS+Wehrmacht+with+Ground+Zero+Mission+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa6e0d6cca24342c3e6d513c3e61242eb893258e","infoHashBuffer":{"type":"Buffer","data":[170,110,13,108,202,36,52,44,62,109,81,60,62,97,36,46,184,147,37,142]},"announce":[],"urlList":[]}}