{"title":"Delhi Noir (Akashic Noir)- Hirsh Sawhney","uid":8833376,"size":647840,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aad4b77de66f9cac6ede4028153b949419b25fe0&amp;dn=Delhi+Noir+%28Akashic+Noir%29-+Hirsh+Sawhney&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":1,"time":1377048315,"description":"Brand-new stories by: Irwin Allan Sealy, Omair Ahmad, Radhika Jha, Ruchir Joshi, Nalinaksha Bhattacharya, Meera Nair, Siddharth Chowdhury, Mohan Sikka, Palash K. Mehrotra, Hartosh Singh Bal, Hirsh Sawhney, Tabish Khair, Uday Prakash, and Manjula Padmanabhan.\n\nThe eyes of the world are gazing at India--the world's largest democracy. But the books you read about this Asian giant only show part of the picture. Delhi Noir offers bone-chilling, mesmerizing takes on the country's chaotic capital, a city where opulence and poverty are constantly clashing, where old-world values and the information age wage a constant battle.\n\nDelhi Noir's fifteen original stories are written by the best Indian writers alive today--the ones you haven't yet heard of but should have. They are veteran authors who have appeared on the Booker Prize short list and budding geniuses who your grandchildren will read about in English class. Delhi Noir is a world of sex in parks, male prostitution, and vigilante rickshaw drivers. It is one plagued by religious riots, soulless corporate dons, and murderous servants. This is India uncut, the one you're missing out on because mainstream publishing houses and glossy magazines can't stomach it.","torrent":{"xt":"urn:btih:aad4b77de66f9cac6ede4028153b949419b25fe0","amp;dn":"Delhi+Noir+%28Akashic+Noir%29-+Hirsh+Sawhney","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aad4b77de66f9cac6ede4028153b949419b25fe0","infoHashBuffer":{"type":"Buffer","data":[170,212,183,125,230,111,156,172,110,222,64,40,21,59,148,148,25,178,95,224]},"announce":[],"urlList":[]}}