{"title":"Pettersson- Sym #12 - Honeck Swedish RSO (2004) [Philidor]","uid":15447386,"size":266803471,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ab8180d6e85425103df6cda4918ac9f85d6bcee8&amp;dn=Pettersson-+Sym+%2312+-+Honeck+Swedish+RSO+%282004%29+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Philidor","files":12,"time":1469903868,"description":"Allan Pettersson is now considered one of the most important Swedish composers of the 20th century. In his lifetime, he had several champions but stood outside the musical mainstream, with his large-scaled, expressively grim scores. A Honegger pupil, his life wasn't easy: a violent, alcoholic father, and a mid-life diagnosis of crippling arthritis. Still, he continued composing to the end. His entire symphonic legacy--effectively 15, since the first and seventeenth were unfinished--have now been recorded complete, though a few have multiple recordings to their credit.\r\n\r\nWith the Twelfth Symphony we end our cycle. It was, curiously, a commission by Uppsala University to celebrate their 500th year of existence. No one, least of all the administration, expected Pettersson to produce anything remotely resembling Brahms' Academic Festival Overture, so the commission specified that the results should be tied to important issues of the times. Pettersson--just out of a lengthy hospital stay that pulled him back from death--in turn responded with an angry, defiant symphony that focused, as it often did in his music, with the wide discrepency between the haves and the have-nots, and the grinding poverty that turns the poor upon themselves. The work was a great success upon its initial performance, and went on to many others throughout Europe.\r\n\r\n\r\nTransfers are made at 768 kBits/s, directly from the disc.\r\n\r\nBio enclosed. You can find all my classical uploads by searching on Philidor, or just looking in this regularly updated thread:\r\n \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:ab8180d6e85425103df6cda4918ac9f85d6bcee8","amp;dn":"Pettersson-+Sym+%2312+-+Honeck+Swedish+RSO+%282004%29+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab8180d6e85425103df6cda4918ac9f85d6bcee8","infoHashBuffer":{"type":"Buffer","data":[171,129,128,214,232,84,37,16,61,246,205,164,145,138,201,248,93,107,206,232]},"announce":[],"urlList":[]}}