{"title":"Dianne Reeves - I Remember 1991","uid":7028314,"size":258714669,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:adcc2048d77ca4a750cf7a0a3f042dd372e6f130&amp;dn=Dianne+Reeves+-+I+Remember+1991&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1329145494,"description":"Dianne Reeves (born October 23, 1956) is an American jazz singer. She currently lives in Denver, Colorado. \n\nReeves was born in Detroit, Michigan to a very musical family. Her father, who died when she was two years old, was also a singer. Her mother, Vada Swanson, played trumpet. A cousin, George Duke, is a well known piano and keyboard player and producer. Dianne and her sister Sharon were raised by their mother in Denver, Colorado. As a child Dianne took piano lessons and sang at every opportunity. When she was 11 years old her interest in music was enhanced by an inspiring teacher who thought that music was the best way to bring students together. Dianne discovered a love of music and that she wanted to be a singer.\nHer uncle, Charles Burrell, a bass player with the Denver Symphony Orchestra, introduced her to the music of jazz singers, from Ella Fitzgerald to Billie Holiday. She was especially impressed by Sarah Vaughan.\n\nAt the age of 16, Reeves was singing at the George Washington High School (Denver) in Denver, in a high school big-band. That same year the band played at a music festival (Convention of the National Association of Jazz Educators). Her band won first place and it was there she met the trumpeter Clark Terry, who became her mentor.\nA year later Reeves began studying music at the University of Colorado, before she moved in 1976 to Los Angeles. In L.A. her interest in Latin-American music grew. She began experimenting with different kinds of vocal music and finally decided to pursue a career as a singer. She met Eduardo del Barrio, toured with his group 'Caldera' and sang in Billy Childs' jazz band 'Night Flight'. Later she toured with Sergio Mendes.\nFrom 1983 until 1986 Reeves toured with Harry Belafonte as a lead singer. This period saw her first experiences with world music.\nIn 1987 Reeves was the first vocalist signed to the reactivated Blue Note/EMI label. Reeves moved back to Denver from Los Angeles in 1992. Reeves sang at the closing ceremony of the 2002 Winter Olympic Games in Salt Lake City.\nReeves' musical director, Peter Martin, tours regularly with her. (wikipedia)\n\n- - -\n\nDianne Reeves - I Remember 1991\n(Blue Note)\n\n 1. Afro Blue\n 2. The Nearness Of You - Misty\n 3. I Remember Sky\n 4. Love For Sale\n 5. Softly As In The Morning Sunrise\n 6. Like A Lover\n 7. How High The Moon\n 8. You Taught My Heart To Sing\n 9. For All We Know\n","torrent":{"xt":"urn:btih:adcc2048d77ca4a750cf7a0a3f042dd372e6f130","amp;dn":"Dianne+Reeves+-+I+Remember+1991","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adcc2048d77ca4a750cf7a0a3f042dd372e6f130","infoHashBuffer":{"type":"Buffer","data":[173,204,32,72,215,124,164,167,80,207,122,10,63,4,45,211,114,230,241,48]},"announce":[],"urlList":[]}}