{"title":"FastStone Capture 6.3-serial incl","uid":4687457,"size":1785125,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:adf44da8ff7874e6c87bdb63bf55ab917b91581b&amp;dn=FastStone+Capture+6.3-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jmb2012","files":2,"time":1233280639,"description":"FastStone Capture is a powerful, lightweight, yet full-featured screen capture tool that allows you to easily capture and annotate anything on the screen including windows, objects, menus, full screen, rectangular/freehand regions and even scrolling windows/web pages. You can choose to send captures to editor, file, clipboard, printer, email, Word/PowerPoint document or upload them to your website. Editing tools include annotating (texts, arrowed lines, highlights), resizing, cropping, sharpening, watermarking, applying edge effects and many more. It also allows you to record screen activities and sound into highly compressed video files. Other features include global hotkeys, automatic filename generation, support for external editors, a color picker, a screen magnifier and a screen ruler.\n\nFastStone Capture saves files in BMP, GIF, JPEG, PCX, PNG, TGA,\n\n\nFeatures \n\n \nA small handy Capture Panel that provides quick access to its capture tools and output options\nGlobal hotkeys to activate screen capturing instantly\nCapture windows, objects, menus, full screen, rectangular/freehand regions and scrolling windows/web pages\nCapture multiple windows and objects including multi-level menus\nOptions to specify output destination (internal editor, clipboard, file, printer ...)\nDraw annotation objects such as texts, arrowed lines, highlights, watermarks, rectangles and circles\nApply effects such as drop-shadow, frame, torn-edge and fade-edge \nAdd image caption\nResize, crop, rotate, sharpen, brighten, adjust colors ...\nUndo/Redo\nSupport external editors\nSave in BMP, GIF, JPEG, PCX, PNG, TGA, TIFF and PDF formats\nSend captured images by email\nSend captured images to Word and PowerPoint documents\nSend captured images to a Web (FTP) server\nRecord screen activities and sound into video files\nScreen Color Picker\nScreen Magnifier\nScreen Ruler\nSupport multiple monitors\nRun when Windows starts (optional)\nMinimize to System Tray area\nSmall footprint in memory\nAnd many more ...","torrent":{"xt":"urn:btih:adf44da8ff7874e6c87bdb63bf55ab917b91581b","amp;dn":"FastStone+Capture+6.3-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adf44da8ff7874e6c87bdb63bf55ab917b91581b","infoHashBuffer":{"type":"Buffer","data":[173,244,77,168,255,120,116,230,200,123,219,99,191,85,171,145,123,145,88,27]},"announce":[],"urlList":[]}}