{"title":"OmniBus (GOG)","uid":14699098,"size":73437310,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ae8442cb269141f7b03ff7a6917d6f6c8d57e32e&amp;dn=OmniBus+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":2,"time":1464282622,"description":"Install instructions:\r\n- Run &quot;setup_omnibus_2.0.0.3.exe&quot;\r\n- Play\r\nCredits: this release was made possible by Swapware Games Network!\r\nIf you like this game, support the developers and BUY IT!\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\n\r\nTitle: OMNIBUS\r\nGenre: Racing - Action - Off-road\r\nWorks on: Windows (7, 8, 10), Mac OS X (10.9.0+) and Linux (Ubuntu 14.04, Ubuntu 16.04)\r\nLanguages: Audio and text: English\r\nFeatures: single-player - co-op\r\nReleased: May 26, 2016\r\nSize: 70.1 MB\r\nCompany: Buddy Cops LLC / Devolver Digital\r\nStore page: https://www.gog.com/game/omnibus\r\n\r\nAbout:\r\nOmniBus is next-to-last gen physics game about the most powerful bus in the universe that can’t stop or even slow down for reasons incomprehensible to the simple human mind. OmniBus must complete missions at the behest of citizens as its speed increases to unsafe speeds and without landing on its head or sides. OmniBus drivers will choose from the bizarre mission mode, thrilling trick mode and versus multiplayer mode for up to four players to achieve goals, set high scores, and receive total enlightenment.\r\nDeep Emotional Narrative: Throughout history man has looked to the noble bus in times of chaos and turmoil to bring peace, prosperity, and a lift to those that it serves during hours of operation. Slay demon buses, harvest space corn, and transport astronauts to a wedding as the legend foretold to become the one true OmniBus. There’s also a pretty cool level with a football field on the top of a skyscraper.\r\nMultiplayer Derby Mode: Jump into the chaotic free-for-all multiplayer versus mode where drivers are pitted against each other in a high score trick mode or the visceral deathmatch mode sure to raise tensions down at the bus depot.\r\nFree Play Trick Mode: Choose your favorite bus and pull off unbelievable jumps, flips and twists to hit incredible high scores and impress friends, family, and other OmniBus drivers on the leaderboards.\r\nCutting Edge Everything: OmniBus has the best of everything from graphics and sound effects to physics and an options menu. This is the future. This is OmniBus.\r\n\r\nMinimum system requirements - Windows: 7 / 8 / 10\r\nProcessor: Dual Core 1.7 GHz or higher\r\nMemory: 2 GB RAM\r\nGraphics: NVIDIA GeForce 9500 GT or equal AMD Video Card / Intel HD4000\r\nDirectX: 10.0 or higher\r\nHard Drive: 150 MB available space","torrent":{"xt":"urn:btih:ae8442cb269141f7b03ff7a6917d6f6c8d57e32e","amp;dn":"OmniBus+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae8442cb269141f7b03ff7a6917d6f6c8d57e32e","infoHashBuffer":{"type":"Buffer","data":[174,132,66,203,38,145,65,247,176,63,247,166,145,125,111,108,141,87,227,46]},"announce":[],"urlList":[]}}