{"title":"Dagmar Herzog - Sexuality in Europe. A Twentieth-Century History","uid":9979488,"size":4710106,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af913b881b799c99a9c979f84a0ee6d174272b38&amp;dn=Dagmar+Herzog+-+Sexuality+in+Europe.+A+Twentieth-Century+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Anette14","files":-1,"time":1397718750,"description":"Description\nProduct Details\nBook Title: Sexuality in Europe: A Twentieth-Century History (New Approaches to European History)\t\nBook Author: Dagmar Herzog (Author)\nSeries: New Approaches to European History (Book 45)\nPaperback: 238 pages\nPublisher: Cambridge University Press; Reissue edition (September 30, 2011)\nLanguage: English\nISBN-10: 0521691435\nISBN-13: 978-0521691437\n\nThis original book brings a fascinating and accessible new account of the tumultuous history of sexuality in Europe from the waning of Victorianism to the collapse of Communism and the rise of European Islam. Although the twentieth century is often called &quot;the century of sex&quot; and seen as an era of increasing liberalization, Dagmar Herzog instead emphasizes the complexities and contradictions in sexual desires and behaviours, the ambivalences surrounding sexual freedom, and the difficulties encountered in securing sexual rights. Incorporating the most recent scholarship on a broad range of conceptual problems and national contexts, the book investigates the shifting fortunes of marriage and prostitution, contraception and abortion, queer and straight existence. It analyzes sexual violence in war and peace, the promotion of sexual satisfaction in fascist and democratic societies, the role of eugenics and disability, the politicization and commercialization of sex, and processes of secularization and religious renewal.\n\nReviews\n&quot;Everything you always wanted to know about the 'century of sex' - here it is, beautifully written, admirably strong in its analysis, compelling in its plea for different narratives that add ambivalences, conflicts and shadow lines to what at first sight appears as a clear-cut story of liberalization.&quot; -Ute Frevert, Director of the Max Planck Institute for Human Development, Berlin\n\n&quot;A masterly synthesis of sexuality's most extreme century. From prostitution to porn, from eugenics to abortion, from homophobia to the gay liberation movement, or from 'sexual reform' in the 1920s to the return of romance in a post-AIDS age, Dagmar Herzog's book convincingly demonstrates that sex is anything but 'natural.' This virtuoso account always links sex to politics, but its real merit is to give emotions, bodies, and pleasures a history.&quot; -Philipp Sarasin, Professor of Modern History, University of Zurich\n\n&quot;Licit and illicit, gay and straight, it's all here, in Dagmar Herzog's bold and productive overview of a century of sexual behaviors and beliefs. Both the politicization of desire and the relation of sex to cardinal values including love, consent, toleration, and personal autonomy figure in her canny treatment of national similarities and differences in Europe. There is no better comparativist than Herzog to illuminate the unexpected twists and turns of this composite history - a landmark in European synthesis and a must-read for all historians of sexuality.&quot; -Nancy F. Cott, Jonathan Trumbull Professor of American History, HarvardUniversity\n\n&quot;Herzog develops a sweeping analysis of the central role of sexual practices, cultures, politics, and violence in a century of war, mass mobilization, and wrenching social conflict and change. Her synthesis of the last generation of historical research is especially valuable because of the significant new insights she derives by considering together the histories of East and West, heterosexuality and homosexuality, and sexual liberalism and conservatism. A model of both comparative and transnational history.&quot; -George Chauncey, Professor of History, Yale University\n\n&quot;fascinating history&quot; -Andrew Moravcsik, Foreign Affairs\n\n&quot;Herzog's compelling, well-reasoned work adds nuance to understanding the history of sexuality. Recommended.&quot; -Choice\n\nBook Description\nCompelling new account of the tumultuous history of Europe's 'century of sex'. From the role of activists and social movements to the impact of war, disease and economic change, Dagmar Herzog charts how sexual preferences, politics and identities as well as the very nature of desire and happiness have changed.\n\nAbout the Author\nDagmar Herzog is Professor of History and Daniel Rose Faculty Scholar at the Graduate Center, City University of New York. Her previous publications include Sex after Fascism: Memory and Morality in Twentieth-Century Germany (2005), Brutality and Desire: War and Sexuality in Europe's Twentieth Century (as editor, 2009) and Sex in Crisis: The New Sexual Revolution and the Future of American Politics (2008).\n","torrent":{"xt":"urn:btih:af913b881b799c99a9c979f84a0ee6d174272b38","amp;dn":"Dagmar+Herzog+-+Sexuality+in+Europe.+A+Twentieth-Century+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af913b881b799c99a9c979f84a0ee6d174272b38","infoHashBuffer":{"type":"Buffer","data":[175,145,59,136,27,121,156,153,169,201,121,248,74,14,230,209,116,39,43,56]},"announce":[],"urlList":[]}}