{"title":"Eerie Publications (incomplete)","uid":9215074,"size":4046547608,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:afc29bc0336eaa4eecd5b29855bc2197b82bd06f&amp;dn=Eerie+Publications+%28incomplete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Ichthypod_Crane","files":121,"time":1384849145,"description":"Dreck I promised you, and Dreck you shall have!\n\nFirst, let's hear what Wikipedia has to say:\n\n&quot;Eerie Publications was a publisher of black-and-white horror-anthology comics magazines. Less well-known and more downscale than the field's leader, Warren Publishing (Creepy, Eerie, Vampirella), the New York City-based company was one of several related publishing ventures run by comic-book artist and 1970s magazine entrepreneur Myron Fass. Titles published during their 15 years of operation included Weird, Horror Tales, Terror Tales, Tales from the Tomb, Tales of Voodoo, and Witches' Tales. All of these magazines featured grisly, lurid color covers.\n\n&quot;New material was mixed with reprints from 1950s pre-Comics Code horror comics. Writer and artist credits seldom appeared, but included Marvel Comics penciler/inkers Dick Ayers and Chic Stone, as well as Fass himself, with brother Irving Fass and Ezra Jackson serving as art directors. Mel Lenny initially and then Golden Age of Comic Books producer Robert W. Farrell had the title of publisher. Carl Burgos, creator of the Golden Age original Human Torch, was editor.&quot;\n\nAhahahahahahahahahaha! Talk about a turd in a tux!\n\nEerie Publications was a cheap hack of an operation that for nine-or-so years foisted oft-blurry B&amp;W horror magazines onto the buying public, primarily composed of 50's Pre-Code reprints, frequently with different names and re-penciled artwork, wrapped with a cover so colorful, lurid and batshit-insane that there's no way in the world the actual contents could ever measure up. Ever seen a close-up of a blood-spattered robot 'Deliverance'-smiling while a woman is hung from her hair into a glass vat, where acid eats her flesh away? No? Then, step right up and let Uncle Ichthy make a man outta ya.\n\nSeriously. The covers. So whack they use some of them two or three times. \n\nAlso, they did. NOT. know how to number their magazines. #2 might be v1 no. 9 and #3 could be v2 no. 6. Eerie's 'Tales from the Crypt' had one-issue, yet it's listed on the interior title page as Vol. 1, no. 10. Sphinctersayswhat?\n\nAnd, O my God, those fucking covers.\n\nYet... yet, somehow, despite (or because of) the qualities listed above, I have outrageously fond memories of these books. I bought many, many Eerie Publications during my mis-spent youth. Surprisingly, a lot of us did. And several comic creators (Steve Bissette comes to mind) have credited EP as a big influence during their artistic development. (&quot;See that page?&quot; &quot;Yeah?&quot; &quot;Don't ever draw like that!&quot;)\n\nSo. Here ya go. This is a very incomplete torrent - out of 230 quality (snicker) publications, I'm bestowing/inflicting 120 upon you. You're welcome/I'm sorry. \n\nYou know the deal - pay it forward and keep the torrent alive. Thank you creative teams!! Thank you scanners!!","torrent":{"xt":"urn:btih:afc29bc0336eaa4eecd5b29855bc2197b82bd06f","amp;dn":"Eerie+Publications+%28incomplete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afc29bc0336eaa4eecd5b29855bc2197b82bd06f","infoHashBuffer":{"type":"Buffer","data":[175,194,155,192,51,110,170,78,236,213,178,152,85,188,33,151,184,43,208,111]},"announce":[],"urlList":[]}}