{"title":"No B.S. Business Success","uid":8361054,"size":5653056,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aff7e108e697ad7e4d40a3ac007748fa6651c1cc&amp;dn=No+B.S.+Business+Success&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":1,"time":1365625875,"description":"No B.S. Business Success By Dan Kennedy\n2004 | 286 Pages | ISBN: 1932531106 | PDF | 6 MB\n\n\n\nSucceed on Business Wisdom, Not Business Banks!\nDan Kennedy has been called the &quot;Professor of Harsh Reality&quot; because he's provocative, irreverent, sarcastic, and tells it like it is in a humorous, but chillingly serious fashion that cuts to the core of the issues in a way no other business author does. You want sugar-coated cliches that go down easy? Seek them elsewhere - this book isn't for the faint heart. Kennedy steers you along the bumpy road to growing a business, showing you potholes along the way.\nExpose yourself to Dan's &quot;25 Eternal Business Truths&quot; and prepare for a lot of chin-rubbing insight. Get Dan Kennedy's take on your sales, cash flow, payroll, productivity, and on getting out of trouble wherever it arises. It's the kind of streetwise wisdom his readers (and high-paying consulting clients) swear by - all the way to the bank.\nWho is Dan Kennedy?\nDan's business adventures have included ownership of six businesses. He appeared for nine consecutive years on THE #1 seminar tour in America sharing the platform with former U.S. President Reagan, Ford, and Bush, General Colin Powell, and business leaders such as Debbi Fields.","torrent":{"xt":"urn:btih:aff7e108e697ad7e4d40a3ac007748fa6651c1cc","amp;dn":"No+B.S.+Business+Success","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aff7e108e697ad7e4d40a3ac007748fa6651c1cc","infoHashBuffer":{"type":"Buffer","data":[175,247,225,8,230,151,173,126,77,64,163,172,0,119,72,250,102,81,193,204]},"announce":[],"urlList":[]}}