{"title":"The Audible Past - Cultural Origins of Sound Reproduction","uid":8931167,"size":2535571,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0b1722184f2f6fe209879cc35e1552b1df5a94c&amp;dn=The+Audible+Past+-+Cultural+Origins+of+Sound+Reproduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"livhre","files":-1,"time":1379467158,"description":"The Audible Past explores the cultural origins of sound reproduction. It describes a distinctive sound culture that gave birth to the sound recording and the transmission devices so ubiquitous in modern life. With an ear for the unexpected, scholar and musician Jonathan Sterne uses the technological and cultural precursors of telephony, phonography, and radio as an entry point into a history of sound in its own right. Sterne studies the constantly shifting boundary between phenomena organized as &quot;sound&quot; and &quot;not sound.&quot; In The Audible Past, this history crisscrosses the liminal regions between bodies and machines, originals and copies, nature and culture, and life and death.\nBlending cultural studies and the history of communication technology, Sterne follows modern sound technologies back through a historical labyrinth. Along the way, he encounters capitalists and inventors, musicians and philosophers, embalmers and grave robbers, doctors and patients, deaf children and their teachers, professionals and hobbyists, folklorists and tribal singers. The Audible Past tracks the connections between the history of sound and the defining features of modernity: from developments in medicine, physics, and philosophy to the tumultuous shifts of industrial capitalism, colonialism, urbanization, modern technology, and the rise of a new middle class.","torrent":{"xt":"urn:btih:b0b1722184f2f6fe209879cc35e1552b1df5a94c","amp;dn":"The+Audible+Past+-+Cultural+Origins+of+Sound+Reproduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0b1722184f2f6fe209879cc35e1552b1df5a94c","infoHashBuffer":{"type":"Buffer","data":[176,177,114,33,132,242,246,254,32,152,121,204,53,225,85,43,29,245,169,76]},"announce":[],"urlList":[]}}