{"title":"Umberto D (1952) Criterion DVD9","uid":8161377,"size":8119257235,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b1136bf6298480621fdd1512cdcfcdd316cda7d5&amp;dn=Umberto+D+%281952%29+Criterion+DVD9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zigi169","files":-1,"time":1361256229,"description":"Umberto Ferrari, aged government-pensioner, attends a street demonstration held\nby his fellow pensioners. The police dispense the crowd and Umberto returns to\nhis cheap furnished room which he shares with his dog Flick. Umberto's lone\nfriend is Maria, servant of the boarding house. She is a simple girl who is\npregnant by one of two soldiers and neither will admit to being the father. When\nUmberto's landlady Antonia demands the rent owed her and threatens eviction if\nshe is not paid, Umberto tries desperately to raise the money by selling his\nbooks and watch. He is too proud to beg in the streets and can not get a loan\nfrom any of his acquaintances. He contracts a sore throat, is admitted to a\nhospital and this puts a delay on his financial difficulty. Discharged, he finds\nthat his dog is gone and, following a frantic search, locates him in the city\ndog pound. His room has been taken over by the landlady and the now-homeless\nUnberto determines to find a place for his beloved dog, and then kill himself.\nUnsuccessful, he resolves that his dog must die with him and he stands in the\npath of a train, with his dog in his arms. \n\nMasterpiece by Vittorio De Sica.","torrent":{"xt":"urn:btih:b1136bf6298480621fdd1512cdcfcdd316cda7d5","amp;dn":"Umberto+D+%281952%29+Criterion+DVD9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1136bf6298480621fdd1512cdcfcdd316cda7d5","infoHashBuffer":{"type":"Buffer","data":[177,19,107,246,41,132,128,98,31,221,21,18,205,207,205,211,22,205,167,213]},"announce":[],"urlList":[]}}