{"title":"2 Fast 2 Furious (2003) DVD9 PAL ENG GER","uid":9867867,"size":8442683392,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b187dfa52a9c7f1a34ca3cd6f3a14ce6e94f0e4b&amp;dn=2+Fast+2+Furious+%282003%29+DVD9+PAL+ENG+GER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1396379941,"description":"audio: english,german\n\n\nsubs: english,german\n\n\n\n\n2 Fast 2 Furious is a 2003 American action film directed by John Singleton. It is the second installment of The Fast and the Furious series. Brian O'Conner (Paul Walker) teams up with his ex-con friend Roman Pearce (Tyrese Gibson) and works with undercover U.S. Customs Service agent Monica Fuentes (Eva Mendes) to bring Miami-based drug lord Carter Verone (Cole Hauser) down.\n\n\nAfter allowing fugitive Dominic Toretto (Vin Diesel) to evade arrest in The Fast and the Furious, former Los Angeles Police Department officer Brian O'Conner (Paul Walker) finds himself on the run from the L.A.P.D. and the U.S. Federal Bureau of Investigation and leaves Los Angeles, California to start a new life. He travels across the U.S., racing against the locals using a silver Nissan Skyline BNR34 GT-R R34 and the driving skills he learned as a member of Toretto's now disbanded crew, earning money for the trip. After traveling for few days, he arrives in Miami, Florida. There, he makes new friends with Tej Parker (Ludacris), an ex-street racer and organizer who leads a top racing garage and is the man-to-know in Miami, and Jimmy (Jin Auyeung), a well-known car tuner who works with Tej, as well as Suki (Devon Aoki), also a street racer, and now lives in a small cot near his garage. Brian has now modified his Skyline to top grade. He has also added details and under glow lights to give it a stunning look. He takes his Skyline to the streets of Miami, and after a while he is given the credit of being the best racer there is.","torrent":{"xt":"urn:btih:b187dfa52a9c7f1a34ca3cd6f3a14ce6e94f0e4b","amp;dn":"2+Fast+2+Furious+%282003%29+DVD9+PAL+ENG+GER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b187dfa52a9c7f1a34ca3cd6f3a14ce6e94f0e4b","infoHashBuffer":{"type":"Buffer","data":[177,135,223,165,42,156,127,26,52,202,60,214,243,161,76,230,233,79,14,75]},"announce":[],"urlList":[]}}