{"title":"Demonic Confidence and Super Confidence by Archer Sloan","uid":3993442,"size":35319410,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b2e0eb1c123e1dc393798f63a65f74cba63edff3&amp;dn=Demonic+Confidence+and+Super+Confidence+by+Archer+Sloan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"spins18","files":40,"time":1201187358,"description":"Do You Want PERMANENT Self-Confidence with Women, In ANY Situation, in just 3 Weeks?\n\nIntroducing the Demonic Confidence Fear Annihilation and Confidence Installation System\n \nThe Demonic Confidence Progressive Conditioning System is a 21 day program that is the only one on the market designed to permanently install a state of fearlessness, confidence and control.\n\nIn just three weeks, you can eliminate all approach anxiety, install a state of total self-assurance, and never hesitate when talking to another woman. You can walk up to any woman in any situation at any time.\n\nDemonic Confidence is far beyond NLP visualizations. \n\nIt is far beyond repetitive affirmations that never work. \n\nIt is beyond parroting somebody else&amp;#039;s converstion openers.\n\nDemonic Confidence is like nothing else on the market. It is a methodology designed to progressively install a new habit of confidence, power and fearlessness when it comes to women, over the course of 21 days.\n\nWhat makes this work where the others fail is that it&amp;#039;s designed with permanence in mind. Just follow the course for three weeks, and you&amp;#039;ll get rid of all the fear and self-doubt that took a lifetime to build up.\n\nAfter the three weeks, you never have to do anything again. You don&amp;#039;t have to &quot;boost&quot; it, or go through any daily ritual. The installed emotional states will be automatic and permanent, not something you have to pop into place before talking to a girl.\n\n_________________________________________\n\nWARNING TO ALL BITTORRENT USERS: \n\nDo not download torrents containing DAA or UIF. These file(s) contains viruses that will be activated when opened with PowerISO or MagicISO.\n\nThese torrents are duplicates of existing torrents, re-packaged to contain a virus. If you want the clean torrent version, do another search for the title of the torrent. An existing clean one will ALWAYS be found.\n\nTorrent sites are being SPAMMED continously with torrents using these formats to spread their shit. LET&amp;#039;S STOP THIS NONSENSE.\n\n** Do not use POWERISO or MAGICISO. SPREAD THE WORD. BEWARE. **","torrent":{"xt":"urn:btih:b2e0eb1c123e1dc393798f63a65f74cba63edff3","amp;dn":"Demonic+Confidence+and+Super+Confidence+by+Archer+Sloan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2e0eb1c123e1dc393798f63a65f74cba63edff3","infoHashBuffer":{"type":"Buffer","data":[178,224,235,28,18,62,29,195,147,121,143,99,166,95,116,203,166,62,223,243]},"announce":[],"urlList":[]}}