{"title":"Rich Gang (2013) [FLAC] PERFECT","uid":8764253,"size":542245390,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b406394780ac75386f2ed703344f4690bab4bbfc&amp;dn=Rich+Gang+%282013%29+%5BFLAC%5D+PERFECT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1375298926,"description":"\n  Rich Gang (2013) [FLAC] PERFECT\n\n  Genre: Hip-Hop\n  Source: Scene CD\n  Codec: FLAC\n  Bit Depth 16\n  Sampling Rate: 44,100 Hz\n\n  Tracks\n\n  01. R.G. (Feat. Mystikal)\n  02. Million Dollar (Feat. Detail &amp; Future)\n  03. Tapout (Feat. Lil Wayne, Birdman, Nicki Minaj, Mack Maine &amp;   Future)\n  04. We Been On (Feat. R. Kelly, Birdman &amp; Lil Wayne)\n  05. Dreams Come True (Feat. Yo Gotti, Birdman, Mack Maine &amp; Ace Hood)\n  06. 50 Plates (Feat. Rick Ross)\n  07. Bigger Than Life (Feat. Chris Brown, Tyga, Birdman &amp; Lil Wayne)\n  08. 100 Favors (Feat. Detail, Birdman &amp; Kendrick Lamar)\n  09. Everyday (Feat. Cory Gunz, Birdman, Busta Rhymes &amp; Mystikal)\n  10. Burn The House (Feat. Detail)\n  11. Panties To The Side (Feat. French Montana, Bow Wow, Tyga &amp; Gudda Gudda)\n  12. Angel (Feat. Birdman, Lil Wayne, Mystikal, Ace Hood, Jae Millz, Gudda Gudda &amp; Mack Maine)\n  13. Sunshine (Feat. Limp Bizkit, Flo Rida, Birdman &amp; Caskey)\n\n  Deluxe \n\n  14 Paint Tha Town (Feat. The Game, Birdman &amp; Lil Wayne)\n  15 Have It Your Way (Feat. T.I., Birdman &amp; Lil Wayne)\n  16 Fly Rich (Feat. Stevie J, Future, Tyga, Meek Mill &amp; Mystikal)\n\n  Bonus\n\n  17. Here We Are (feat. Kevin Rudolf, Limp Bizkit, Birdman and Lil Wayne)\n  18. Savage (feat. T Rone and Jae Millz)\n\nThe story of Birdman's label Cash Money is a fascinating one, being born on the streets and then thriving/grinding there for a decade before Lil Wayne took it to the penthouse with a series of mammoth albums, and then Nicki Minaj took it to America's living room with her pop hits and gig as a judge on American Idol. Rich Gang, the collective and/or compilation -- even with the evidence in front of you, you're not really sure -- starts off with the label boss looking back all starry-eyed while narrating the opening &quot;R.G.,&quot; which features veteran rapper and new Cash Money signee Mystikal. This slow track is followed by the slower &quot;Million Dollar&quot; with Future and Detail, and suddenly listeners are led to believe they are at the edge of something epic and awesome, something that will tie the whole Cash Money/Young Money/YMCMB universe together with style and purpose. Nope. &quot;Tapout&quot; is an all-star bit of flash that brings Future back to mix with the label's A-list (Wayne, Minaj, and Birdman) while the great &quot;50 Plates&quot; brings Maybach boss Rick Ross into the family for something as exciting as a Marvel/DC Comics crossover, but these high points are matched by a cut called &quot;Panties to the Side&quot; (simple, strip-club fluff) featuring upstart French Montana (not a Cash Money artist) and a decent Birdman cut dubbed &quot;We Been On&quot; where R. Kelly and Wayne sound tacked on. The closing &quot;Sunshine&quot; finds Limp Bizkit and Flo Rida helping to deliver a breezy Birdman ballad, and suddenly, one begins to wonder if Rich Gang the album is simply a scrapped solo album from the label boss, one that was retooled and retitled, then hyped up to look like a Cash Money celebration piece. After all, Young Money superstar Drake is MIA, as is both the usual quality control and Cash Money sense of purpose. Fanatics only; everyone else can grab the singles.","torrent":{"xt":"urn:btih:b406394780ac75386f2ed703344f4690bab4bbfc","amp;dn":"Rich+Gang+%282013%29+%5BFLAC%5D+PERFECT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b406394780ac75386f2ed703344f4690bab4bbfc","infoHashBuffer":{"type":"Buffer","data":[180,6,57,71,128,172,117,56,111,46,215,3,52,79,70,144,186,180,187,252]},"announce":[],"urlList":[]}}