{"title":"Love at Goon Park- Harry Harlow and the Science of Affection by ","uid":11189595,"size":7073225,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b41876ad10b66952ccfb00470033ebf01b04b24f&amp;dn=Love+at+Goon+Park-+Harry+Harlow+and+the+Science+of+Affection+by+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":7,"time":1412972229,"description":"In this meticulously researched and masterfully written book, Pulitzer Prize-winner Deborah Blum examines the history of love through the lens of its strangest unsung hero: a brilliant, fearless, alcoholic psychologist named Harry Frederick Harlow. Pursuing the idea that human affection could be understood, studied, even measured, Harlow (1905-1981) arrived at his conclusions by conducting research-sometimes beautiful, sometimes horrible-on the primates in his University of Wisconsin laboratory. Paradoxically, his darkest experiments may have the brightest legacy, for by studying &quot;neglect&quot; and its life-altering consequences, Harlow confirmed love's central role in shaping not only how we feel but also how we think. His work sparked a psychological revolution. The more children experience affection, he discovered, the more curious they become about the world: Love makes people smarter. The biography of both a man and an idea, The Measure of Love is a powerful and at times disturbing narrative that will forever alter our understanding of human relationships.","torrent":{"xt":"urn:btih:b41876ad10b66952ccfb00470033ebf01b04b24f","amp;dn":"Love+at+Goon+Park-+Harry+Harlow+and+the+Science+of+Affection+by+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b41876ad10b66952ccfb00470033ebf01b04b24f","infoHashBuffer":{"type":"Buffer","data":[180,24,118,173,16,182,105,82,204,251,0,71,0,51,235,240,27,4,178,79]},"announce":[],"urlList":[]}}