{"title":"A Perfect Circle - [2004] - eMOTIVe - Live","uid":10573149,"size":186033380,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b528c6655da147db31573e96b28b15df8db2f050&amp;dn=A+Perfect+Circle+-+%5B2004%5D+-+eMOTIVe+-+Live&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"RiPPlNKiTTlN","files":-1,"time":1405608031,"description":"T r a c k l i s t\n\n\n1           Annihilation (LIVE) \t                A Perfect Circle    2:24\n\n2           Imagine (LIVE) \t                        A Perfect Circle    4:56\n\n3           Peace Love And Understanding (LIVE) \tA Perfect Circle    5:20\n\n4           What's Going On (LIVE) \t                A Perfect Circle    5:01\n\n5           Passive (LIVE) \t                        A Perfect Circle    4:14\n\n6           Gimmie Gimmie Gimmie (LIVE) \t        A Perfect Circle    4:55\n\n7           People Are People (LIVE) \t                A Perfect Circle    3:48\n\n8           Freedom Of Choice (LIVE) \t                A Perfect Circle    3:25\n\n9           Let's Have A War (LIVE) \t                A Perfect Circle    3:38\n\n10          Counting Bodies Like Sheep To               A Perfect Circle    6:02\n            The Rhythm Of The War Drums (LIVE)\n\n11          When The Levee Breaks (LIVE) \t        A Perfect Circle    7:03\n\n12          Fiddle And The Drum (LIVE) \t                A Perfect Circle    4:21\n\n13          Diary Of A Love Song (LIVE) \t        A Perfect Circle   14:58\n\n14          By And Down (LIVE)                   \tA Perfect Circle    5:33\n\n\n\n\nG e n r e s\n\nRock, Hard Rock, Adult Alternative\nMetal, Alternative\n\n\n\nR e l e a s e   D a t e\n\nNov 2 2004\n2014 A Perfect Circle\n\n\n\nA l b u m r e c e n s i o n\n\nWhen Tool frontman Maynard James Keenan covered Wings' &quot;Silly Love Songs&quot; as a guest vocalist for the Replicants, it was amusing and well thought out. When Tool covered &quot;No Quarter&quot; in concert it was intense, appropriate, and staggeringly good. And when Maynard continued the tradition with the beautiful recording of Failure's &quot;The Nurse Who Loved Me,&quot; it became apparent that Maynard had a penchant for re-recording songs that were of high quality but not necessarily anthems. But then there's the notion of recording a whole album of covers, which immediately sends off red flags that the water may be running dry and the record label is thirsty for a new release. A Perfect Circle's album of covers, Emotive, falls flat and fails to raise the bar set so high by the quality of their previous two releases. Turning some of popular music's most potent songs into a soundtrack ideal for background music at your local teen-angst mall-chain clothing store, A Perfect Circle work their way through 12 songs that would almost be unrecognizable in their current arrangement if one weren't familiar with the original versions of each song. John Lennon's somber, optimistic anthem for peace, &quot;Imagine,&quot; is changed from its original major key to a funereal minor key dirge. Marvin Gaye's perfect &quot;What's Going On&quot; is turned into a horrible industrial track that would be permissible on a budget-line compilation but is simply unforgivable in its inclusion here. The same could apply to the butchering of Black Flag's &quot;Gimmie Gimmie Gimmie&quot; and a few other numbers. However, the album's sole moment of tranquility and its most effective moments lie in the band's treatment of Led Zeppelin's &quot;When the Levee Breaks&quot; and the disturbing a cappella of Joni Mitchell's &quot;Fiddle and the Drum.&quot; But it's almost too little too late by the time these two roll around. Emotive is a slight dent in the armor of Maynard's nearly flawless career as a frontman, and it's (hopefully) a mere detour for A Perfect Circle. [A clean version of Emotive has been issued for those with a sensitive constitution to excessive profanity.]\n\n\n\nB i o g r a p h y\n\nFormed by Tool vocalist Maynard James Keenan and former Tool guitar tech Billy Howerdel, A Perfect Circle is an extension of the alt-metal-fused-with-art rock style popularized by Tool in the early to mid-'90s. While similar to Tool in intensity and melancholy, A Perfect Circle is less dark and more melodic, with a theatrical, ambient quality that incorporates occasional strings and unusual instrumentation.\n\nAfter the release of Ã†nima in 1996, Tool found themselves in the midst of an extended legal battle with former label Freeworld Entertainment. When the dust settled two years later, the band reached a 50/50 joint venture agreement for future recordings and, feeling a little burned out, decided to take some time off. It was at this point that Keenan joined up with Howerdel and Paz Lenchantin to form A Perfect Circle. Keenan had met Howerdel in 1992 when Tool opened for Fishbone. Howerdel had been Fishbone's tech at the time and had played Keenan a few of his songs. Keenan was impressed and the two talked of collaborating in the future. However, the opportunity didn't present itself until after the Freeworld settlement. With Keenan on vocals, Howerdel on guitar, and Lenchantin on bass, the trio recruited ex-Failure and Enemy member Troy Van Leeuwen on guitar and ex-Vandals and Guns N' Roses member Josh Freese on drums.\n\nThe quintet rehearsed together but didn't announce the formation of a new band until performing for the first time on August 15, 1999, at a benefit concert at the Viper Room in Los Angeles. Howerdel, who had been composing songs for years, as well as working with bands such as the Smashing Pumpkins and Nine Inch Nails, became the band's chief songwriter and producer. A Perfect Circle released their debut album, Mer de Noms, in 2000. Thirteenth Step followed in 2003, and the covers album Emotive appeared in 2004.\n\nShortly after the release of their DVD set aMOTION, A Perfect Circle went on hiatus. During their downtime, Keenan went on to record albums with his solo project, Puscifer, while Howerdel began making albums with his new band, Ashes Divide. While rumors of the band writing songs cropped up now and again, A Perfect Circle returned (to the stage, at least) in 2010, and released their first new song, &quot;By and Down,&quot; on their 2013 greatest-hits compilation, Three Sixty.","torrent":{"xt":"urn:btih:b528c6655da147db31573e96b28b15df8db2f050","amp;dn":"A+Perfect+Circle+-+%5B2004%5D+-+eMOTIVe+-+Live","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b528c6655da147db31573e96b28b15df8db2f050","infoHashBuffer":{"type":"Buffer","data":[181,40,198,101,93,161,71,219,49,87,62,150,178,139,21,223,141,178,240,80]},"announce":[],"urlList":[]}}