{"title":"&quot;8&quot; A Play about the Fight for Marriage Equality","uid":7112025,"size":1215009694,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b5a94977683ecdbe4d435e130828b2cc6e9e180b&amp;dn=%26quot%3B8%26quot%3B+A+Play+about+the+Fight+for+Marriage+Equality&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"scott51189","files":1,"time":1332097734,"description":"This is the Prop 8 play. The pre-show begins at 17:55 and the play itself begins at 29:50\n\nFeaturing an all-star cast including George Clooney, Brad Pitt, Martin Sheen, Jamie Lee Curtis, Jane Lynch, Kevin Bacon and others, &quot;8&quot; is a play written by Academy Award winning screenwriter Dustin Lance Black and directed by acclaimed actor and director Rob Reiner. It is a powerful account of the case filed by the American Federation for Equal Rights (AFER) in the U.S. District Court in 2010 to overturn Proposition 8, a constitutional amendment that eliminated the rights of same-sex couples to marry in the state of California. Framed around the trial's historic closing arguments in June 2010, 8 provides an intimate look what unfolded when the issue of same-sex marriage was on trial.\n\n\nAFER is the sole sponsor of Perry v. Brown, the federal constitutional challenge to California's Proposition 8. After bringing together Theodore B. Olson and David Boies to lead its legal team, AFER successfully advanced the Perry case through Federal District Court and the Ninth Circuit Court of Appeals. The Foundation is committed to achieving full federal marriage equality for all Americans.","torrent":{"xt":"urn:btih:b5a94977683ecdbe4d435e130828b2cc6e9e180b","amp;dn":"%26quot%3B8%26quot%3B+A+Play+about+the+Fight+for+Marriage+Equality","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5a94977683ecdbe4d435e130828b2cc6e9e180b","infoHashBuffer":{"type":"Buffer","data":[181,169,73,119,104,62,205,190,77,67,94,19,8,40,178,204,110,158,24,11]},"announce":[],"urlList":[]}}