{"title":"Pulp v 2.0 (1532) [K]racked","uid":6477660,"size":1994976,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:b7600016ef116f5f4a48760bd206065475197f3f&amp;dn=Pulp+v+2.0+%281532%29+%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1308377274,"description":"Official Web Site: &lt;a href=&quot; http://www.acrylicapps.com/pulp/mac/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.acrylicapps.com/pulp/mac/&lt;/a&gt;\n\nNews shouldn't be like email. Pulp takes your favorite news feeds and presents them in a beautifully friendly &amp; familiar format, making it easy to quickly scan through headlines, previews, and photos to find the stories that interest you most. It's like your very own personalized newspaper.\n\nA Richer Experience\n\nForget tedious lists of boring headlines. Pulp shows you the latest news alongside rich photos and descriptions, making it easier to find the articles you're actually interested in reading.\n\nFeed Search\n\nRSS and URLs can be a pain. Pulp includes Google-powered search built in, so you can instantly find your favorite news sites, blogs, and more simply by typing in their name, then add them with one click.\n\nCustomize Everything\n\nPulp makes it easy to customize every aspect of your newspaper. Build unique categories to separate your feeds by, modify the layouts, change feed appearances and rules, and more.\n\nSee the WHOLE Story\n\nWhen you want to read an article, Pulp gets the clutter out of the way and elegantly curls down the main page, revealing the full articles behind it. If you want to read more than what's available in the feed, enable Magic Reader to pull in the full article from the web.\n\nAbracadabra\n\nTired of feeds that only publish short text previews? Introducing Magic Reader - with a tap of a button, it lets you see the full story formatted into a clean and easy-to-read format, regardless of where it's from. Magic? You could say that.\n\nRead Later\n\nCoffee breaks aren't endless, so Pulp makes it easy to save articles you want to read later. Drag interesting articles to the shelf, the perfect place to quickly store and organize the stories you don't have time to read. Come back at any time to check them out in more detail.\n\n\nSimple Sharing\n\nWant to tell others about a great article you found? When you've discovered a story you want to share with the world, Pulp makes it easy to do so. Quickly email any article, publish it on Facebook, or post it to your Twitter feed, all without leaving the app.\n\nSeamless Cloud Syncing\n\nSometimes you're catching up with the latest news at work on your Mac, sometimes you're sitting comfortably on a sofa with your iPad. Wouldn't it be great if you always had the same feeds and settings with you, regardless of where you were?\n\n\nSystem Requirements:\n\nMac OS x.5 or better, iPad, iPhone (latest iOS)\n\n--- PLEASE SEED ---\n","torrent":{"xt":"urn:btih:b7600016ef116f5f4a48760bd206065475197f3f","amp;dn":"Pulp+v+2.0+%281532%29+%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7600016ef116f5f4a48760bd206065475197f3f","infoHashBuffer":{"type":"Buffer","data":[183,96,0,22,239,17,111,95,74,72,118,11,210,6,6,84,117,25,127,63]},"announce":[],"urlList":[]}}