{"title":"fIREHOSE - fROMOHIO","uid":4769634,"size":196521830,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b773f32cc450b57baa7f24fc1796ab7887fac977&amp;dn=fIREHOSE+-+fROMOHIO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nfck","files":-1,"time":1236993803,"description":"fROMOHIO is the third studio album by fIREHOSE, released in 1989. It is regarded as one of the biggest highlights of their career, even getting a spot in the prolific book 1001 Albums You Must Hear Before You Die. The album marked a change in the bands sound, where If'n left off. Many regard this album as a step closer to country music.[citation needed] This type of sound was dropped for a heavier sound however, when 1991's Flyin' the Flannel was released.\n\nFirehose (stylized as fIREHOSE) was an alternative rock band consisting of Mike Watt (bass, vocals), Ed Crawford (guitar, vocals), and George Hurley (drums).\n\nFirehose was formed in 1986 after the death of D. Boon brought an end to Minutemen. Watt and Hurley teamed up with the then 22-year-old Crawford, a guitarist and Minutemen fanatic. Crawford was from Ohio, and started the band when he found Watt's phone number in the phone book and called him, saying he wanted to play with Mike and George in California.\n\nIn the spring of 1986, Crawford traveled to San Pedro and the band went on from there. The name of the band was taken from a line in a Bob Dylan song, &quot;Subterranean Homesick Blues&quot; : &quot;...Better stay away from those that carry around a fire hose...&quot;.\n\nFirehose released five full-length albums and two EPs before disbanding in 1994. Inclusion of early material in several key skateboarding videos from the late 1980s led to a sizeable underground skateboarding audience. Notably, &quot;Brave Captain&quot; from Ragin', Full On, and &quot;Sometimes&quot;, &quot;Hear Me&quot;, and &quot;Windmilling&quot; from If'n were in the Santa Cruz Skateboards video &quot;Streets on Fire.&quot;","torrent":{"xt":"urn:btih:b773f32cc450b57baa7f24fc1796ab7887fac977","amp;dn":"fIREHOSE+-+fROMOHIO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b773f32cc450b57baa7f24fc1796ab7887fac977","infoHashBuffer":{"type":"Buffer","data":[183,115,243,44,196,80,181,123,170,127,36,252,23,150,171,120,135,250,201,119]},"announce":[],"urlList":[]}}