{"title":"Unconventional Oil and Gas Resources Handbook","uid":14751840,"size":78956043,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7c652da9c868bf9420bd71e358319f0f5470284&amp;dn=Unconventional+Oil+and+Gas+Resources+Handbook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1464771268,"description":"Unconventional Oil and Gas Resources Handbook - Y. Zee Ma, Stephen A. Holditch (GPP, 2016).pdf\r\n\r\nISBN 978-0-12-802238-2\r\n\r\nUnconventional Oil and Gas Resources Handbook: Evaluation and Development is a must-have, helpful handbook that brings a wealth of information to engineers and geoscientists. Bridging between subsurface and production, the handbook provides engineers and geoscientists with effective methodology to better define resources and reservoirs. Better reservoir knowledge and innovative technologies are making unconventional resources economically possible, and multidisciplinary approaches in evaluating these resources are critical to successful development. Unconventional Oil and Gas Resources Handbook takes this approach, covering a wide range of topics for developing these resources including exploration, evaluation, drilling, completion, and production. Topics include theory, methodology, and case histories and will help to improve the understanding,integrated evaluation, and effective development of unconventional resources.\r\n\r\nPresents methods for a full development cycle of unconventional resources, from exploration through production\r\nExplores multidisciplinary integrations for evaluation and development of unconventional resources and covers a broad range of reservoir characterization methods and development scenarios\r\nDelivers balanced information with multiple contributors from both academia and industry\r\nProvides case histories involving geological analysis, geomechanical analysis, reservoir modeling, hydraulic fracturing treatment, microseismic monitoring, well performance and refracturing for development of unconventional reservoirs","torrent":{"xt":"urn:btih:b7c652da9c868bf9420bd71e358319f0f5470284","amp;dn":"Unconventional+Oil+and+Gas+Resources+Handbook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7c652da9c868bf9420bd71e358319f0f5470284","infoHashBuffer":{"type":"Buffer","data":[183,198,82,218,156,134,139,249,66,11,215,30,53,131,25,240,245,71,2,132]},"announce":[],"urlList":[]}}