{"title":"Sexually Broken--Cutie Casey Calvert bound, drilled by BBC &amp;","uid":9217633,"size":755036091,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b8916182d031bbddc425dcc51579d8c3d9958721&amp;dn=Sexually+Broken--Cutie+Casey+Calvert+bound%2C+drilled+by+BBC+%26amp%3B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1384885308,"description":"\nCutie Casey Calvert strictly bound, mercilessly drilled down by BBC &amp; made to squirt everywhere! | Casey Calvert | Matt Williams\n\nNovember 18, 2013\n\n\nMP4 only.\n\n\nCasey Calvert started out as a bondage model before she realized that she liked the dick as much as she likes the rope, and she went down to LA to make a name for herself in boy-girl porn. Lucky for her, Sexuallybroken combines both the best of bondage AND all the dick a slut could possibly want.\n\nBound on our well-used bed in a classic fuck me position, Casey awaits her fate. A tape blindfold prevents her from seeing what is coming her way and a tape gag holds a rag wedged firmly in her mouth hole. She is starting to realize the true definition of &quot;helpless.&quot; Taking advantage of her wide open legs, we warm up that slutty pussy with some flogging. She can't anticipate the strikes, and her helpless body quivers with each strike.\n\nOnce she is properly warmed up, we introduce 10 inches of black thunder that goes by the name of Jack Hammer. Jack is not the sort of person a pussy forgets easily, and he makes himself right at home. What follows is the total deconstruction of a person by penis. He never lets up, never shows mercy, never lets Casey get on top of it. It is a teeth-rattling, bone-jarring dick down, made all the more intense by the bondage, blindfold and gag. It is the type of fucking most people will never even get to experience. You are welcome Casey.\n\nNot content to let Jack reshape Casey's cunt with his massive tool, we add in some truly skilled finger blasting that rips out an epic squirting orgasm, leaving her gasping and drenched in her own cum. We know that Casey has more orgasms locked in that pussy, and we add the vibrator to mix. It is a total onslaught of the senses, and Casey slips off into subspace, completely checking out. That is fine by us, she can enjoy the ride. We aren't done with her quite yet and Jack unleashes another round of fury on her cum drenched hole. Casey is reduced to a fuckdoll for the using, limp and dizzy, hardly aware of her own name. It is a good look on her. We use her until we are bored, then walk away, leaving her wet and bound. Welcome back to Sexuallybroken Casey! \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/11_18ccalvert6/SexuallyBroken-Casey-Calvert-Matt-Williams-Cutie-Casey-Calvert-strictly-bound-mercilessly-drilled-down-by-BBC--made-to-squirt-everywhere.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/11_18ccalvert6/SexuallyBroken-Casey-Calvert-Matt-Williams-Cutie-Casey-Calvert-strictly-bound-mercilessly-drilled-down-by-BBC--made-to-squirt-everywhere.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:b8916182d031bbddc425dcc51579d8c3d9958721","amp;dn":"Sexually+Broken--Cutie+Casey+Calvert+bound%2C+drilled+by+BBC+%26amp%3B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8916182d031bbddc425dcc51579d8c3d9958721","infoHashBuffer":{"type":"Buffer","data":[184,145,97,130,208,49,187,221,196,37,220,197,21,121,216,195,217,149,135,33]},"announce":[],"urlList":[]}}