{"title":"Blonde on Blonde - Contrasts - 1969","uid":3613790,"size":70587217,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b8cffdd0131a1c631ed83872379b2b643c4135ea&amp;dn=Blonde+on+Blonde+-+Contrasts+-+1969&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"old_mick","files":15,"time":1170963621,"description":"Blonde on Blonde&amp;#039;s 1969 album is from the period when progressive rock, or more so pop, was new and fresh. Years before the likes of Emerson, Lake &amp; Palmer, Yes, and Genesis made the genre a dirty word and punk evolved in order to destroy it, Blonde on Blonde were taking their pop and psychedelic roots that little bit further. Progressive, in the sense that the term was originally conceived: a new catchall name to describe the emerging form of music that arose from Sgt. Pepper, filled the Middle Earth Club, and by 1969, was increasingly getting more diverse than the quaint psychedelic form from which it was spurned. Blonde on Blonde had the then contemporary match of folky vocals (which could easily turn it up a gear into rock territory), fuzz guitar leads galore, and some interesting material, which veered from an almost cinematic version of &quot;Eleanor Rigby&quot; to the post-mod (think U.S. garage meets the Small Faces) snotty strut of &quot;Conversationally Making the Grade,&quot; the archetypal heavy rock jam &quot;Ride With Captain Max,&quot; and the slightly old-styled ballad &quot;Goodbye.&quot; Of course, more dynamic musical interplay crept into the fold: classical-intoned aspirations, acoustic folk, ornate pop, and full-on rock. Contrasts is indeed an album that is characteristic of the music that was being bandied around the music press in 1969 as progressive, not the preposterous entity that it became.","torrent":{"xt":"urn:btih:b8cffdd0131a1c631ed83872379b2b643c4135ea","amp;dn":"Blonde+on+Blonde+-+Contrasts+-+1969","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8cffdd0131a1c631ed83872379b2b643c4135ea","infoHashBuffer":{"type":"Buffer","data":[184,207,253,208,19,26,28,99,30,216,56,114,55,155,43,100,60,65,53,234]},"announce":[],"urlList":[]}}