{"title":"Jean Shepherd Vol 03 - 1965-1966","uid":7866207,"size":727632502,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b9563122d958922b4315f04671ac8b125bef9616&amp;dn=Jean+Shepherd+Vol+03+-+1965-1966&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"topec","files":56,"time":1354070057,"description":"Who was Jean Shepherd?\nJean Shepherd was a writer, humorist, satirist, actor, radio raconteur, TV &amp; film personality and an American original. He was a master story teller in the league of Mark Twain, S.J. Perlman and P.G. Wodehouse. Taking bits and pieces from his own life, he weaved tales of the joys, humor, intrigue and angst of growing up. His youth in Hammond, Indiana, his adventures in the Army Signal Corps and stories of the obscure and infamous were all fertile sources for his tales. For almost three decades, he told these stories to eager radio audiences. In Cincinnati between 1950 and 1954 Shep did a DJ show from Shuller's Wigwam on WSAI and a nightly comedy show on WLW called &quot;Rear Bumpers&quot;. This led to a television version at KYW in Philadelphia. In 1956 Shep moved to the Big Apple on WOR New York where for 21 years listeners all over the Northeast were treated to a nightly dose of genius. His shows were a menagerie of comments, silly songs, jokes and other digressions all orbiting around a central tale. For 45 minutes you laughed and wondered if he would remember to conclude the story at hand. He always made it! His other great radio enterprise was live broadcasts on Saturday night from The Limelight, a nightclub in Greenwich Village. Marshall McLuan once called Shep &quot;the first radio novelist.&quot;","torrent":{"xt":"urn:btih:b9563122d958922b4315f04671ac8b125bef9616","amp;dn":"Jean+Shepherd+Vol+03+-+1965-1966","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9563122d958922b4315f04671ac8b125bef9616","infoHashBuffer":{"type":"Buffer","data":[185,86,49,34,217,88,146,43,67,21,240,70,113,172,139,18,91,239,150,22]},"announce":[],"urlList":[]}}