{"title":"Amir Taheri - The Persian Night [Khomeinist Revolution]","uid":6941537,"size":1179153,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba7ef0c990936e8023f6cdb807299855fe9a6bc5&amp;dn=Amir+Taheri+-+The+Persian+Night+%5BKhomeinist+Revolution%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1326056725,"description":"The Persian Night: Iran Under the Khomeinist Revolution\n\nWritten in sorrow rather than anger, The Persian Night clearly and calmly describes Iran's descent into unreality. It is a masterwork of information and argument. Formerly editor of Iran's most influential paper, Amir Taheri is now perforce an exile but he remains in touch with all sorts of insiders. In addition to his native Farsi, he is fluent in Arabic and the main European languages. Frequent quotations from Persian poetry, old or contemporary, reveal his love of his native country and its culture, but he is equally likely to make good use of Plato and Cicero, Hobbes and Goethe, or even Frantz Fanon to illustrate a point. More than ironic, it seems outright improbable that one and the same Iran could be home to ignorant bigots like Ayatollah Khomeini and his successors--in particular the vicious and narrow-minded president, Mahmoud Ahmadinejad--and a sophisticated humanist like Taheri.\n\n&quot;Killing is the same as mercy,&quot; Khomeini wrote. A favorite dictum of his was &quot;To kill and be killed are the supreme duties of Muslims.&quot; He also liked to say that war is a &quot;divine blessing.&quot; That was the point of departure for the transformation of the state into a cause, which according to Taheri dates to a conference of Islamists in Sudan in 1993. At the time, the collapse of the Soviet Union was taken as evidence that God was indeed making Muslims masters of the world. The turn of the United States had now come.\n\nTo prepare for jihad and mass mobilization, the ayatollahs had to manufacture multiple fears and hatreds--notably of women, the U.S., and Israel, all reduced to stereotypes that bear no relation to reality. Taheri points out, usefully, that the ayatollahs and Ahmadinejad do not have enemies with whom it might be possible to compromise; they have foes who have to be conquered and subdued.\n\nThere is hopeful news, however.\n\nIranians know perfectly well that they are victimized by those claiming to be acting on their behalf. The man in the street understands that the U.S. befriended Iran in the past and would willingly do so again, and to call it the &quot;Great Satan&quot; is mere fascist sloganeering. Similarly, the popular perception of Jews tends to be positive and does not correspond to Ahmadinejad's raving about Israel as a &quot;dead rat&quot; and a &quot;cancerous tumor.&quot; Women do not accept subordination. Workers demand rights. Minorities are close to armed revolt. Nationalism is likely to prove strong enough for a return to the conventional nation-state. The conditions and the timing for regime change, Taheri maintains, seem right.\n\nAuthor: Amir Taheri\nPublisher: Encounter Books\nPublication Date: October 19, 2010\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:ba7ef0c990936e8023f6cdb807299855fe9a6bc5","amp;dn":"Amir+Taheri+-+The+Persian+Night+%5BKhomeinist+Revolution%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba7ef0c990936e8023f6cdb807299855fe9a6bc5","infoHashBuffer":{"type":"Buffer","data":[186,126,240,201,144,147,110,128,35,246,205,184,7,41,152,85,254,154,107,197]},"announce":[],"urlList":[]}}