{"title":"Sun&amp;rsquo;s Heartbeat: And Other Stories from the Life of the St","uid":8872031,"size":8900880,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:baddc681f4fc25b51566d78dce5a553b6f150eaf&amp;dn=Sun%26rsquo%3Bs+Heartbeat%3A+And+Other+Stories+from+the+Life+of+the+St&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"K-Slender","files":5,"time":1378091842,"description":"The beating heart of the sun is the very pulse of life on earth. And from the ancients who plotted its path at Stonehenge to the modern scientists who unraveled the nuclear fusion reaction that turns mass into energy, humankind has sought to solve its mysteries. In this lively biography of the sun, Bob Berman ranges from its stellar birth to its spectacular future death with a focus on the wondrous and enthralling, and on the heartbreaking sacrifice, laughable errors, egotistical battles, and brilliant inspirations of the people who have tried to understand its power.\n\nWhat, exactly, are the ghostly streaks of light astronauts see-but can't photograph-when they're in space? And why is it impossible for two people to see the exact same rainbow? Why are scientists beginning to think that the sun is safer than sunscreen? And how does the fluctuation of sunspots-and its heartbeat-affect everything from satellite communications to wheat production across the globe?\n\nPeppered with mind-blowing facts and memorable anecdotes about spectral curiosities-the recently-discovered &quot;second sun&quot; that lurks beneath the solar surface, the eerie majesty of a total solar eclipse-THE SUN'S HEARTBEAT offers a robust and entertaining narrative of how the Sun has shaped humanity and our understanding of the universe around us. ","torrent":{"xt":"urn:btih:baddc681f4fc25b51566d78dce5a553b6f150eaf","amp;dn":"Sun%26rsquo%3Bs+Heartbeat%3A+And+Other+Stories+from+the+Life+of+the+St","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baddc681f4fc25b51566d78dce5a553b6f150eaf","infoHashBuffer":{"type":"Buffer","data":[186,221,198,129,244,252,37,181,21,102,215,141,206,90,85,59,111,21,14,175]},"announce":[],"urlList":[]}}