{"title":"John Phillips: The Story Of The Mamas And The Papas (1988)","uid":6971486,"size":678353798,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bc392dca8df091b14be254070a44cd3be866d18f&amp;dn=John+Phillips%3A+The+Story+Of+The+Mamas+And+The+Papas+%281988%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mesahawni","files":1,"time":1327105907,"description":"This is the definitive video biography of one of the 60s' most influential bands, The Mamas and The Papas, and its founder, John Phillips.  Straight Shooter documents the group's beginning in the Greenwich Village folk scene through their inception in the Virgin Islands and travels to California, the inspiration for one of their biggest hits and the event of the 'Summer of Love,' the Monterey Pop Festival.  In exclusive interviews, founding members John Phillips, Michelle Phillips and Denny Doherty tell the story of the Mamas and the Papas, supplemented by home movies and personal photographs and interviews with others who witnessed it all. Features performance footage of their greatest hits including: California Dreamin', Monday, Monday, Go Where You Wanna Go and Creeque Alley\n\nIncludes Bonus Material: The Chronicles of The Mamas and The Papas; featuring never-before-seen footage and extended archival interviews with John Phillips, Michelle Phillips, Denny Doherty, Scott McKenzie, John Stewart (Kingston Trio), Mick Fleetwood (Fleetwood Mac), Spanky McFarlane, Mackenzie Phillips, Susan Adams and others who were there through the good and bad times, recount the stories of the band, their break-up, the death of Mama Cass Elliott, John's addiction and recovery and much more. ","torrent":{"xt":"urn:btih:bc392dca8df091b14be254070a44cd3be866d18f","amp;dn":"John+Phillips%3A+The+Story+Of+The+Mamas+And+The+Papas+%281988%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc392dca8df091b14be254070a44cd3be866d18f","infoHashBuffer":{"type":"Buffer","data":[188,57,45,202,141,240,145,177,75,226,84,7,10,68,205,59,232,102,209,143]},"announce":[],"urlList":[]}}