{"title":"Jello Biafra &amp; Nomeansno - [1991] - The Sky Is Falling &amp; I Want","uid":4611681,"size":268705461,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bddc76dc5325c667b67f8b83a838f4d447f91935&amp;dn=Jello+Biafra+%26+Nomeansno+-+%5B1991%5D+-+The+Sky+Is+Falling+%26+I+Want&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kislithepothead","files":-1,"time":1230658957,"description":"Released\tJuly 1, 1991\nGenre\t\thardcore punk\nLabel\t\tAlternative Tentacles\nArtwork\t\tWinston Smith\n\nAfter working with Canadian punks D.O.A. on his previous collaboration album, Jello Biafra hooked up with fellow Canucks and Alternative Tentacles signees Nomeansno for an abrasive, brilliantly skewed thrash of a record, The Sky Is Falling, and I Want My Mommy. Nomeansno, with their angular art aggression, makes for a more distinct vehicle for Jello than D.O.A., bursting with power and screwy inventiveness both. The title track alone is worth the price of admission; Jello's rant about nuclear satellites and paranoia perfectly is matched by the music, and in ways the track serves as the missing link between an older style of punk and the work of underground '90s acts like Unwound. White-hot guitar lines scrape and snarl over the stuttering rhythm while Jello rages through as only he can. &quot;Chew&quot; starts with minimal guitar snarls and whines floating around a low-key rhythm before fully springing to life, alternating between epic explosions and low-key tension over the song's length. Other tracks have a more straightforward, thrash feeling but still kick along very nicely, often throwing in odd solos or other touches to prevent sound-alike disease. Jello's pithy way around any number of subjects doesn't fail him here, with everything from recontextualized religion (&quot;Jesus Was a Terrorist&quot;) to the joys of white-knuckle trips down mountain rivers (&quot;Ride the Flume&quot; with its lyrics &quot;forget log rides in amusement parks, this one's 50 miles long!&quot;). Nomeansno's Ramones-worshipping alter egos, the Hanson Brothers, sneak in for the song &quot;Bad,&quot; which is delivered in appropriately quick time, though Jello avoids sounding like Joey Ramone. The album wraps up with two great stormers, &quot;Sharks in the Gene Pool,&quot; which constantly shifts tempos and feels over its length, and &quot;The Myth Is Real - Let's Eat,&quot; with a wickedly snarling bassline that helps carry it along. Jello lets go in full effect over both, with all of the energy that fans would come to expect.\n\t\t- AMG\n\nNot my rip, found on torrents dot ru; split, tagged, replay gain scanned, added lyrics","torrent":{"xt":"urn:btih:bddc76dc5325c667b67f8b83a838f4d447f91935","amp;dn":"Jello+Biafra+%26+Nomeansno+-+%5B1991%5D+-+The+Sky+Is+Falling+%26+I+Want","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bddc76dc5325c667b67f8b83a838f4d447f91935","infoHashBuffer":{"type":"Buffer","data":[189,220,118,220,83,37,198,103,182,127,139,131,168,56,244,212,71,249,25,53]},"announce":[],"urlList":[]}}