{"title":")Legend (Director's Cut) [1985] .avi","uid":7167581,"size":1405878272,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:be0939598988c577b15f358cff8a4192b767109f&amp;dn=%29Legend+%28Director%27s+Cut%29+%5B1985%5D+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"alien99","files":-1,"time":1333832783,"description":"First i thank the original source for this file\n\nThis is the extended version of this film 153 minutes \n\nStoryline\n\nA demon who seeks to create eternal night by destroying the last of the unicorns and marrying a fairy princess is opposed by the forest boy Jack and his elven allies in this magical fantasy\n\nreview\n\nI will join the chorus... This is a beautiful, and thoroughly enjoyable fantasy film as long as you watch it in digital widescreen and do not bother with the 1hr 30min version. The Director's Cut(better known as the European release) is worthy of an IMDb rating of 8. The American theatrical release is worthy of a 6.5.\n\nThis is a fairly straightforward fantasy conceived and directed by Ridley Scott, one of the greatest mainstream directors of our time. The story follows a young man who lives in a forest (Jack, played by Tom Cruise) and a spirited young princess (Lily - Mia Sara) who is in love with him. The lord of darkness (Tim Curry) has sent forth his minions to capture the last two remaining unicorns so that he can banish light from the world forever. Unicorns are attracted to innocence, and so they find themselves in Jack and Lily's company just as the dark lord's play begins to unfold. Before long, Jack and his magical forest friends must save Lily, the one remaining unicorn and the world from the grasp of the dark lord at any price.\n  ","torrent":{"xt":"urn:btih:be0939598988c577b15f358cff8a4192b767109f","amp;dn":"%29Legend+%28Director%27s+Cut%29+%5B1985%5D+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be0939598988c577b15f358cff8a4192b767109f","infoHashBuffer":{"type":"Buffer","data":[190,9,57,89,137,136,197,119,177,95,53,140,255,138,65,146,183,103,16,159]},"announce":[],"urlList":[]}}