{"title":"Shaken Not Stirred by Matthew Papcun","uid":9626205,"size":492022,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be4abfe4fd626d2358072893aacb8ba2bad3e673&amp;dn=Shaken+Not+Stirred+by+Matthew+Papcun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":2,"time":1392596262,"description":"\nVodka is one of the oldest distilled spirits in existence and remains one of the top-selling in the world. Everyone has drank vodka in some shape or form at some point in their life; whether it was in a Cosmopolitan, Apple Martini or one hazy night with a bottle of Popov. Maybe you spent one night on your yacht, rolling around in gold records with a bottle of Ciroc. \n\nOk, maybe that last example was a little reaching but I think we can all agree that it would be awesome. You're interested in this book because you are or want to become a vodka drinker. Or maybe you're a long-time bartender, like me, who wants some more knowledge on one of your favorite spirits. Whatever your reason, thank you for taking the time to read my ramblings, and I've got you covered.\n\nAs you explore this book, you will learn about the history of the most versatile spirit ever made, the differences between grain, potato and fruit-based vodkas and the secrets to making the perfect martini. I also introduce you to vodka's best friend, the Bloody Mary and share with you the history and best recipes of the ultimate breakfast drink. Plus over 100 vodka-based craft cocktail recipes from around the world. So read on, my new drinking buddies. Let's get started. But first, I need to refresh my drink.\n\nGenre: Non-Fiction, Cookery, Drinks","torrent":{"xt":"urn:btih:be4abfe4fd626d2358072893aacb8ba2bad3e673","amp;dn":"Shaken+Not+Stirred+by+Matthew+Papcun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be4abfe4fd626d2358072893aacb8ba2bad3e673","infoHashBuffer":{"type":"Buffer","data":[190,74,191,228,253,98,109,35,88,7,40,147,170,203,139,162,186,211,230,115]},"announce":[],"urlList":[]}}