{"title":"Elvis Costello - My Aim Is True (1977) [24 bit FLAC] 180g vinyl","uid":9397859,"size":758559536,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:beacceec2f880329f8bd9de806ac4c76972d7853&amp;dn=Elvis+Costello+-+My+Aim+Is+True+%281977%29+%5B24+bit+FLAC%5D+180g+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1388013904,"description":"\n  Elvis Costello - My Aim Is True (1977) [24 bit FLAC] 180g vinyl\n\n  Genre: Pop/Rock\n  Style: New Wave\n  Source: Mobile Fidelity Records 180g LP\n  Codec: FLAC\n  Bit Rate: ~ 2,800 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n  \n  Side A\n\n  A1 Welcome To The Working Week\n  A2 Miracle Man \n  A3 No Dancing \n  A4 Blame It On Cain \n  A5 Alison\n  A6 Sneaky Feelings \n  A7 Watching The Detectives \n\n  Side B\n\n  B1 (The Angels Wanna Wear My) Red Shoes \n  B2 Less Than Zero \n  B3 Mystery Dance \n  B4 Pay It Back \n  B5 I'm Not Angry \n  B6 Waiting For The End Of The World\n\n    Elvis Costello was as much a pub rocker as he was a punk rocker and nowhere is that more evident than on his debut, My Aim Is True. It's not just that Clover, a San Franciscan rock outfit led by Huey Lewis (absent here), back him here, not the Attractions; it's that his sensibility is borrowed from the pile-driving rock &amp; roll and folksy introspection of pub rockers like Brinsley Schwarz, adding touches of cult singer/songwriters like Randy Newman and David Ackles. Then, there's the infusion of pure nastiness and cynical humor, which is pure Costello. That blend of classicist sensibilities and cleverness make this collection of shiny roots rock a punk record -- it informs his nervy performances and his prickly songs. Of all classic punk debuts, this remains perhaps the most idiosyncratic because it's not cathartic in sound, only in spirit. Which, of course, meant that it could play to a broader audience, and Linda Ronstadt did indeed cover the standout ballad &quot;Alison.&quot; Still, there's no mistaking this for anything other than a punk record, and it's a terrific one at that, since even if he buries his singer/songwriter inclinations, they shine through as brightly as his cheerfully mean humor and immense musical skill; he sounds as comfortable with a '50s knockoff like &quot;No Dancing&quot; as he does on the reggae-inflected &quot;Less Than Zero.&quot; Costello went on to more ambitious territory fairly quickly, but My Aim Is True is a phenomenal debut, capturing a songwriter and musician whose words were as rich and clever as his music. [Ryko/Demon's 1993 reissue contained several bonus tracks, including the country B-sides &quot;Radio Sweetheart&quot; and &quot;Stranger in the House,&quot; plus demos of his first group, Flip City.]","torrent":{"xt":"urn:btih:beacceec2f880329f8bd9de806ac4c76972d7853","amp;dn":"Elvis+Costello+-+My+Aim+Is+True+%281977%29+%5B24+bit+FLAC%5D+180g+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"beacceec2f880329f8bd9de806ac4c76972d7853","infoHashBuffer":{"type":"Buffer","data":[190,172,206,236,47,136,3,41,248,189,157,232,6,172,76,118,151,45,120,83]},"announce":[],"urlList":[]}}