{"title":"Paullina Simons - The Bronze Horseman","uid":8230235,"size":1757594,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bef886308c08da4712c5fde540ebc9ee44e540ed&amp;dn=Paullina+Simons+-+The+Bronze+Horseman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"geo358","files":5,"time":1362710566,"description":"epub and mobi\n\n\n\nThe golden skies, the translucent twilight, the white nights, all hold the promise of youth, of love, of eternal renewal. The war has not yet touched this city of fallen grandeur, or the lives of two sisters, Tatiana and Dasha Metanova, who share a single room in a cramped apartment with their brother and parents. Their world is turned upside down when Hitler's armies attack Russia and begin their unstoppable blitz to Leningrad.\n\nYet there is light in the darkness. Tatiana meets Alexander, a brave young officer in the Red Army. Strong and self-confident, yet guarding a mysterious and troubled past, he is drawn to Tatiana--and she to him. Starvation, desperation, and fear soon grip their city during the terrible winter of the merciless German siege. Tatiana and Alexander's impossible love threatens to tear the Metanova family apart and expose the dangerous secret Alexander so carefully protects--a secret as devastating as the war itself--as the lovers are swept up in the brutal tides that will change the world and their lives forever.","torrent":{"xt":"urn:btih:bef886308c08da4712c5fde540ebc9ee44e540ed","amp;dn":"Paullina+Simons+-+The+Bronze+Horseman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bef886308c08da4712c5fde540ebc9ee44e540ed","infoHashBuffer":{"type":"Buffer","data":[190,248,134,48,140,8,218,71,18,197,253,229,64,235,201,238,68,229,64,237]},"announce":[],"urlList":[]}}