{"title":"Coraline HC (Neil Gaiman)","uid":4566873,"size":140235584,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:bfb6b71f78145bc4451d03b559c0739d0f50b107&amp;dn=Coraline+HC+%28Neil+Gaiman%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ParrowJack","files":1,"time":1228907264,"description":"This is Neil Gaiman&amp;#039;s graphic adaptation of his novella, Coraline, illustrated by P. Craig Russell and lettered by Todd Klein.\n\nShortly after moving into an old house with strange tenants above and below, Coraline discovers a big, carved, brown wooden door at the far corner of the drawing room. She unlocks the door to find a dark hallway in front of her. Stepping inside, the place beyond has an eerie familiarity about it. The carpet and wallpaper are the same as in her flat. The picture hanging on the wall is the same. Almost. Strangest of all, her mum and dad are there too. Only they have buttons for eyes and seem more possessive than normal. It&amp;#039;s a twisted version of her world that is familiar, and yet sinister. And matters get even more surreal for Coraline when her &quot;other&quot; parents seem reluctant to let her leave.\n\nIt has been compared to Lewis Carroll&amp;#039;s Alice in Wonderland books because of its surreality and its alternate-reality based plot. The Novella was awarded the 2003 Hugo Award for Best Novella, the 2003 Nebula Award for Best Novella, and the 2002 Bram Stoker Award for Best Work for Young Readers.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:bfb6b71f78145bc4451d03b559c0739d0f50b107","amp;dn":"Coraline+HC+%28Neil+Gaiman%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfb6b71f78145bc4451d03b559c0739d0f50b107","infoHashBuffer":{"type":"Buffer","data":[191,182,183,31,120,20,91,196,69,29,3,181,89,192,115,157,15,80,177,7]},"announce":[],"urlList":[]}}