{"title":"Star Wars Jedi Knight Jedi Academy Portable - [Espera]","uid":6394208,"size":1216284492,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bfcf5e7da3b8313bca5493c60da475f8859fa033&amp;dn=Star+Wars+Jedi+Knight+Jedi+Academy+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1305464419,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;REG1.exe&quot;\n3.Run &quot;REG2.exe&quot;\n4.Run &quot;Star Wars Jedi Knight Jedi Academy 1 Click.exe&quot;\n5.Enjoy\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\nhis article is about the video game. For information on Luke Skywalker's Jedi Academy, see Jedi Academy.\nStar Wars Jedi Knight: Jedi Academy\nCover art\nDeveloper(s) \tRaven Software\nVicarious Visions (Xbox)[1]\nPublisher(s) \tLucasArts, Activision\nSeries \tStar Wars: Jedi Knight\nEngine \tQuake III: Team Arena (with Raven's custom SDK)\nVersion \t1.01[2]\nPlatform(s) \tMicrosoft Windows\nMac OS X\nXbox\nRelease date(s) \tSeptember 17, 2003\nGenre(s) \tFirst-person shooter, action\nMode(s) \tSingle-player, multiplayer\nRating(s) \t\n\n    ESRB: T\n\nMedia/distribution \t2 CD-ROMs, Xbox DVD or download\nSystem requirements\n\nWindows: 700 MHz Pentium, 128MB RAM, 32MB graphics card, 4x CD-ROM drive, 1.3GB hard drive space\nMac: Mac OS X 10.2.6 or later, G3/G4/G5 500 MHz, 256MB RAM, ATI Radeon 7500/nVidia GeForce 2 with 32MB of VRAM, 4x CD-ROM drive, 1.3GB hard drive space\n\nStar Wars Jedi Knight: Jedi Academy is a first and third-person shooter action game set in the Star Wars universe. It was developed by Raven Software and published, distributed and marketed by LucasArts in North America and by Activision in the rest of the world. Jedi Academy was released in September 2003 and received positive reviews, achieving an 81% aggregate score. In September 2009, the game was re-released along with its 3 predecessors through Steam and Direct2Drive.\n\nJedi Academy is powered by the same version of the Quake III: Team Arena engine used in its predecessor, Star Wars Jedi Knight II: Jedi Outcast, containing modifications to the Quake code to include lightsaber combat. In a new feature to the series, the player can modify the character's gender and appearance, and can construct a lightsaber by choosing the hilt style and blade color.\n\nThe player takes control of the character Jaden Korr, a student at the Jedi Academy under the tutelage of Kyle Katarn. The player must complete various missions assigned to them by Katarn and Luke Skywalker. There is a multiplayer mode that allows the player to play against other people over a network.\n\nAs a first/third person shooter set in the Star Wars universe, Jedi Academy puts the player into combat wielding a variety of firearms from the universe, as well as lightsabers and Force powers. The player can choose perspective for every weapon but the lightsaber can only be used in third person.\n\nThe shooter aspects of the game are typical, including a variety of projectile and energy weapons and explosives. Players have a health meter and a shield meter, which are replenished separately.\n\nIn both single player and multiplayer, the player character is a Force-user, who has access to a variety of Force powers in addition to his or her lightsaber(s). Powers include pushing and pulling, jumping, healing, lightning, and other abilities from the Star Wars universe. Force powers are categorized into Light (defensive), neutral, and Dark (offensive), and each Force power has three ranks. The power will increase in effectiveness with each rank. In both singleplayer and multiplayer, players choose how to rank up their powers, adding a layer of customizability. During gameplay, the player has a &quot;Force meter&quot; which is depleted when powers are used, and recharges when no powers are in use.\n\nJedi Academy places a heavy emphasis on lightsaber combat. The player can create a custom lightsaber by selecting a hilt and one of five blade colors.[3] The player can choose to wield a single saber, one saber in each hand, or a &quot;saber staff&quot; similar to Darth Maul's double ended lightsaber in Star Wars: The Phantom Menace.[4] The different sabers each have unique styles and special moves. When using a single saber, the player can choose between three stances which affect the speed and power of attacks; if using dual sabers, the player can switch off the second saber and use the &quot;Fast&quot;-style single-saber stance.\n\nSystem requirements\n\nWindows: 700 MHz Pentium, 128MB RAM, 32MB graphics card, 4x CD-ROM drive, 1.3GB hard drive space\n\n","torrent":{"xt":"urn:btih:bfcf5e7da3b8313bca5493c60da475f8859fa033","amp;dn":"Star+Wars+Jedi+Knight+Jedi+Academy+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfcf5e7da3b8313bca5493c60da475f8859fa033","infoHashBuffer":{"type":"Buffer","data":[191,207,94,125,163,184,49,59,202,84,147,198,13,164,117,248,133,159,160,51]},"announce":[],"urlList":[]}}