{"title":"Jazz Moods - Jazz at Week's End (1999) [Jazz][mp3","uid":4964190,"size":141723838,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c0db9e7be3e76629996617f6719f3d75bd2ed429&amp;dn=Jazz+Moods+-+Jazz+at+Week%5C%27s+End+%281999%29+%5BJazz%5D%5Bmp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":17,"time":1245450656,"description":"Jazz Moods - Jazz at Week's End \nOriginal Release Date: August 3, 1999\nAudio CD: August 3, 1999\nLabel: Concord Records \nBitrate: 320 kbps\n\nConcord Jazz was clever enough to realize that there are legions of jazz listeners that use the music as mood music, on occasion. Knowing this, the label compiled a whole series entitled Jazz Moods, designing each disc to fit a specific mood. With Jazz at Week's End, it's a collection of lightly swinging soul-jazz and cool jazz, ideal for relaxation. Some jazz purists may scoff at this idea, but they would likely be satisfied by the music itself, since the disc contains first-class performances from Ernestine Anderson, George Van Eps &amp; Howard Alden, Marian McParland, Jeff Linsky, Hank Jons, Rosemary Clooney, Carol Sloane and Stan Getz, among others. They help make this a substantive collection, as well as one that is entertaining. But the highest compliment one can pay Jazz at Week's End is that it sounds like jazz that should be played at the end of the week. ~ Stephen Thomas Erlewine, AMG\n\nConcord Records has come up with another winner in it's series of Jazz Moods - &quot;Jazz At Week's End&quot;. The label has compiled eleven tracks for that special mood at the end of a hectic week. A collection of cool and lightly swinging jazz sets the listener in a relaxing and meditating mood.\n\nStand out performances include - Ernestine Anderson, Stan Getz, Hendrik Meurkens, Marian McPartland, Rosemary Clooney, Laurindo Almeida, Carlos Barbosa-Lima, Charlie Byrd, Hank Jones, Jeff Linsky, Carol Sloane, George Van Eps, Howard Alden and Ali Ryerson. If you need to unwind at the end of your week, this album is for you. Each track is designed to fit that specific mood for your - JAZZ AT WEEK'S END! ~ J. Lovins \n\nJazz Moods - Jazz at Week's End Tracks:\n01  Ernestine Anderson - Sunny \n02  Stan Getz - Easy Living \n03  Hendrick Meurkens - A Summer In San Francisco \n04  Marian Mcpartland - A Delicate Balance \n05  Rosemary Clooney - Haven't Got A Worry \n06  Laurindo Almeida-Carlos Barbosa-Lima-Charlie Byrd - Weekend Cruise To Catalina\n07  Hank Jones - Lazy Afternoon \n08  Jeff Linsky - Pacifica \n09  Carol Sloane - Sunday \n10  George Van Eps &amp; Howard Alden - Blue Skies \n11  Ali Ryerson - Estate (Summer) \n","torrent":{"xt":"urn:btih:c0db9e7be3e76629996617f6719f3d75bd2ed429","amp;dn":"Jazz+Moods+-+Jazz+at+Week%5C%27s+End+%281999%29+%5BJazz%5D%5Bmp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0db9e7be3e76629996617f6719f3d75bd2ed429","infoHashBuffer":{"type":"Buffer","data":[192,219,158,123,227,231,102,41,153,102,23,246,113,159,61,117,189,46,212,41]},"announce":[],"urlList":[]}}