{"title":"Mary Wollstonecraft - Political Writings &amp; Letters (2 books)","uid":10230115,"size":7145120,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c19eb243be471f923a1148fcbf43fd2d53a444fc&amp;dn=Mary+Wollstonecraft+-+Political+Writings+%26amp%3B+Letters+%282+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1401127848,"description":"\nMARY WOLLSTONECRAFT (1759-1797) was an 18-century English writer, philosopher, and advocate of women's rights.  During her brief career, she wrote novels, treatises, a travel narrative, a history of the French Revolution, a conduct book, and a children's book.  Her husband was the philosopher William Godwin, one of the forefathers of the anarchist movement, and her daughter, Mary Wollstonecraft Godwin, became an accomplished writer herself, as Mary Shelley, the author of &quot;Frankenstein&quot;.\n\nAfter Wollstonecraft's early death, her widower published a Memoir of her life, revealing her unorthodox lifestyle, which inadvertently destroyed her reputation for almost a century.  However, with the emergence of the feminist movement at the turn of the twentieth century, Wollstonecraft's advocacy of women's equality and critiques of conventional femininity became increasingly important.  Today she is regarded as one of the founding feminist philosophers, and feminists often cite both her life and work as important influences.\n\nWollstonecraft is best known for A VINDICATION OF THE RIGHTS OF WOMAN (1792), in which she argues that women are not naturally inferior to men, but appear to be only because they lack education.  She suggests that both men and women should be treated as rational beings and imagines a social order founded on reason.  Janet Todd's edition of VINDICATION brings together Wollstonecraft's major political writings in the order in which they appeared in the revolutionary 1790s, tracing her passionate and indignant response to the excitement of the early days of the French Revolution and then her uneasiness at its later bloody phase; her developing understanding of women's involvement in the political and social life of the nation; and her growing awareness of the relationship between politics and economics and between political institutions and the individual.\n\nLETTERS WRITTEN IN SWEDEN, NORWAY, AND DENMARK was Wollstonecraft's most popular book during her lifetime.  Part travel book, part personal, social, and political memoir, her response to nature and society contains some of her most brilliant writing and gives us a genuine insight into her personality.  Appendices include her lover Imlay's commission to recover his lost silver, Wollstonecraft's recently discovered letter to the Danish Prime Minister asking for assistance, the private letters she wrote during her travels in Scandinavia, a chapter from Godwin's memoir of Wollstonecraft, and a selection of contemporary reviews.\n\n\nBoth the following books are in PDF format:\n\n* LETTERS WRITTEN IN SWEDEN, NORWAY, AND DENMARK (Oxford World's Classics, 2009).  Edited with an Introduction and Notes by Tone Brekke and Jon Mee.\n\n* A VINDICATION OF THE RIGHTS OF MEN; A VINDICATION OF THE RIGHTS OF WOMAN; AN HISTORICAL AND MORAL VIEW OF THE FRENCH REVOLUTION (Oxford World's Classics, 1993).  Edited with an Introduction and Notes by Janet Todd.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                          &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n\n","torrent":{"xt":"urn:btih:c19eb243be471f923a1148fcbf43fd2d53a444fc","amp;dn":"Mary+Wollstonecraft+-+Political+Writings+%26amp%3B+Letters+%282+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c19eb243be471f923a1148fcbf43fd2d53a444fc","infoHashBuffer":{"type":"Buffer","data":[193,158,178,67,190,71,31,146,58,17,72,252,191,67,253,45,83,164,68,252]},"announce":[],"urlList":[]}}