{"title":"Making Life Wonderful","uid":10198627,"size":3351612811,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c2d98e3927181c5f72c8d8e58b930e8439289f5d&amp;dn=Making+Life+Wonderful&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":8,"time":1400731253,"description":"Making Life Wonderful (DVD)\nAn intermediate training in Nonviolent Communication with Marshall Rosenberg, Ph.D. Improve relationships with yourself and others by increasing fluency in NVC. A two-day training session in San Francisco filled with insights, examples, extended role plays, stories, and songs that will deepen your grasp of NVC. This set of four DVDs runs over eight hours. (4 DVD set) \n\nNonviolent Communication (NVC) provides powerful tools for resolving differences at personal, professional, and political levels. Dr. Rosenberg first created and began to over NVC skills training to peacefully integrate schools and other public institutions during the 1960's. Since then NVC has been widely introduced . . . . This set of videos, based on a two day training, is filled with insights, examples, extended role plays, stories, and songs showing how NVC can be used to find solutions to perplexing problems and to celebrate our power to make life more wonderful. Marshall B. Rosenberg is founder and director of educational services for the Center for Nonviolent Communication. Dr. Rosenberg, a clinical psychologist, is author of Nonviolent Communication: A Language of Compassion. ","torrent":{"xt":"urn:btih:c2d98e3927181c5f72c8d8e58b930e8439289f5d","amp;dn":"Making+Life+Wonderful","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2d98e3927181c5f72c8d8e58b930e8439289f5d","infoHashBuffer":{"type":"Buffer","data":[194,217,142,57,39,24,28,95,114,200,216,229,139,147,14,132,57,40,159,93]},"announce":[],"urlList":[]}}