{"title":"Mac Bootable Utilities Image","uid":6052963,"size":848918712,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:c3c4214765f8d6192a76b303815ddcc82cf3011d&amp;dn=Mac+Bootable+Utilities+Image&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"purpl3","files":2,"time":1292802741,"description":"WHAT IS IT?\nMany operations require you to &quot;unmount&quot; your hard drive or partition such as: Fixing, Optimizing, Defragmenting, Partitioning, Cloning and Data Recovery. There are many great tools to do these functions, but to use them you either need a second operating system installed or a bunch of bootable discs. To make your life easier I have compiled a bootable image which contains as many of these tools as possible. This image can be burnt to a DVD or cloned to a iPod/flash USB stick/hard drive/partition; the resulting product will then be bootable.\n\nWARNING:\nBootable Utilities Image comes with absolutely no warranty whatsoever. You are using this entirely at your own risk. This image was designed to help computers, and while I have done everything reasonable to ensure that it functions as intended, I cannot test it in every situation. If this causes something bad to happen to your computer, don't come crying to me. You should always backup your system. Remember: You get what you pay for.\n\nWhat's included?\n\n    * Carbon Copy Cloner 3.3\n    * Clone X 3.3.0\n    * CopyCatX 4.0\n    * Data Rescue 3.0.1 {107}\n    * Disk Utility 11.1 {252.4}\n    * DiskWarrior 4.2 {909}\n    * Drive Genius 2.2.1 {2200.27.79}\n    * FileSalvage 7.0\n    * Firmware Password Utility 1.4.3 {1}\n    * iDefrag 1.7.2 {227}\n    * iPartition 3.2.0 {161}\n    * MacForensicsLab 2.5.4\n    * MemTest 4.22\n    * OfficeSalvage 6.1.5\n    * Preview 4.2 {469.5}\n    * RescuePRO 3.3.0.0 {3.3}\n    * SpeedTools 2.8.1 {2.4.3}\n    * Startup Disk 1.4 {56}\n    * TechTool Pro 5.0.6 {4594}\n    * Terminal 2.0.2 {240.2}\n    * TestDisk 6.11.3\n    * TextMate 1.5.9 {1510}\n    * VolumeWorks 1.5\n\n{}=Build numbers where applicable\n\nBranches:\nThe latest bootable image Apple released to developers doesn't seem to boot their old machines anymore. Because of that I'm now making two different branches of BUI. One for old macs(2.2.x) and one for new(2.3.x)+. I've made a chart to help you find the image(s) that's right for you:\n\n\n    * 'Old macs' are ones with the PowerPC(PPC) architecture.\n    * The 'Lite' version only has: Carbon Copy Cloner, CopyCatX, Data Rescue, Disk Utility, DiskWarrior, DriveGenius, FileSalvage, Firmware Password Utility, iDefrag, iPartition, MemTest, TechTool Pro and the Terminal.\n\n\nSources:\nMac-BB.orgMacSerialJunkie.com\n\nCOMMENTS:\n\n    * Thanks to the owner of DoStuffRight for letting me host this page here and to the person who made the icon/logo for this image.\n    * You should always read the compatibly reports for a program before using it. Not all of these tools support all macs.\n    * Don't try to launch or quit &quot;QuickerPicker&quot;.\n    * TechTool Pro will ask you to update the TechTool Protection when it first loads; just hit cancel.\n    * If you are going to run this from a hard drive and you have an additional 128MB of free space beyond what you need for the files on here, I would advise the you use it to appease TechTool Pro.\n    * I plan to release periodic updates as I change various important parts of the image. However, I find it unlikely that I will release an update of this entire image just because a new program update came out. I do highly advise that you download all program updates and install them. Most of them are pretty straight forward, or you can read &quot;DIY&quot; to see what individual files you need for any one program.\n    * Questions, comments, suggestions, ideas and complaints are all very welcome. Please read the &quot;For Those Who Care&quot; before contacting me though. I may answer your question in there.\n\n\nHOW TO USE IT:\nThere are two basic options when it comes to using this image. 1)Burn it to a DVD. 2)Run it from a hard drive(partition, flash, iPod...) I believe there has been a common misconception that this image was intended to be mounted then run from your working installation. This will not work for most applications as they require other files to be installed. You either need to burn this to DVD or copy it to a new hard drive/partition.\n\nOption 1:\n\n   1. Make sure the disk image is locked. To do this, either right-click/control-click the disk image, or select it and hit apple+i or go to File-&gt;Get Info. Make sure the box to the left of &quot;Locked&quot; has a check in it.\n   2. Open the disk utility in /Applications/Utilities/\n   3. Drag this disc image into the left part of the disk utility, somewhere under your hard drive(s).\n   4. Make sure the image is 'unmounted'. To do this, click on the image you just dragged into the disk utility on the left side. At the very top, if the button furthest to the right says 'eject', click on it. Otherwise you are good to go.\n   5. Insert your blank DVD.\n   6. At the very top left of the disk utility window click 'burn'. Make sure 'Verify burned data' is selected. Then click 'burn'\n   7. Restart your computer while holding down the 'c' key. This will cause your computer to boot from whatever is in the cd drive.\n   8. Wait. It will take a while to boot up. Anywhere from 5-15 minutes depending on your machine.\n   9. Use the tools on the disc. They don't really have any help or instructions, but they should be pretty straight forward.\n  10. When you are done open StartupDisk and make sure the operating system/hard drive you want to boot from is selected, then hit &quot;restart&quot;.*\n\n*If upon restarting your computer doesn't boot up from your hard drive, try restarting while holding down the 'option' key. This will give you a list of bootable devices to restart from. Simply select your hard drive, then click the forward pointing arrow.\nYou can also hold down your mouse, or eject button(depending on your mac) to eject the DVD while starting up.\n\nOption 2:\nIf you can boot up from a hard drive instead of a DVD I recommend it. You will find that things are much faster that way. Also, if you are planning on running this off any disk of reasonable size, I would suggest that you simply install OS X and all these tool on there. They will function more flawlessly and you will be able to multitask while optimizing or repairing your drive.\nSee option 2.1 for iPods.\n\n   1. Open the disk utility in /Applications/Utilities/\n   2. Drag this disc image into the left part of the disk utility, somewhere under your hard drive(s).\n   3. Make sure the image is 'unmounted'. To do this, click on the image you just dragged into the disk utility on the left side. At the very top, if the button furthest to the right says 'eject', click on it. Otherwise you are good to go.\n   4. Click on the hard drive/partition you are going to be copying this image to, from the panel on the left.\n   5. Select the &quot;Erase&quot; tab(Second from the left).\n   6. The next step will erase your hard drive/partition! Leave the format at &quot;Mac OS Extended (Journaled)&quot; and the name at whatever, then click &quot;Erase&quot;.\n   7. You need to format the drive differently depending on what type of computer you plan to use this with. For intel you must do a 'GUID partition table', for PPC you need 'Apple Partition Map'. To format a disk, click on the 'Partition' tab, then on 'Options' to access these advanced options. You'll need to repartition to whole drive to change the scheme.\n   8. Click on the 'Restore' tab. It is the one furthest to the right in the main part of the disk utility window.\n   9. Drag the this disc image into the 'Source:' field. You should see a green plus sign next to your cursor when it is ready to be dropped.\n  10. Drag your hard drive or partition from the left part of the disk utility window to the 'Destination:' field. Again you should see a green plus sign.\n  11. Restart your computer while holding down the 'option' key. It might take a little while to index your bootable devices. When possible, select the device that you just restored this image too. Then click the forward arrow. It might take slightly longer than normal to start up.\n  12. If you would prefer, you may go to 'Startup Disk' in the 'System Preferences' and select the drive you just installed this image onto.\n  13. Word on the street is that to get your iMac G5 to boot from usb flashdrive, go to your open firmware and type: boot ud:3,\\:tbxi\n  14. Use the tools on the disc. They don't really have any help or instructions, but they should be pretty straight forward.\n  15. When you are done you may launch the 'Startup Disk' application to select which disk you would like to startup from, then click 'Restart.'*\n\n*If upon restarting your computer doesn't boot up from your hard drive, try restarting while holding down the 'option' key. This will give you a list of bootable devices to restart from. Simply select your hard drive, then click the forward pointing arrow.\n\nOption 2.1:\nSupposedly you can use a program called DasBoot with iPods to copy the tools over while leaving the iPod usable as a music player. I haven't tested this option yet. If someone wants to report back to me I would be happy to post something about the results.\n\nHackintosh/x86:\nCheck out: http://pcwizcomputer.com/index.php?option=com_content&amp;task=view&amp;id=98&amp;Itemid=45&lt;-I have nothing to do with that page.\n\nKnown issues:\n\n    * Can't restore: If you receive the message: &quot;Unable to scan&quot;, &quot;Source image needs to be imagescanned before it can be restored&quot; or that it has no checksum; use Carbon Copy Cloner to make bootable backup to your intended disk instead of the disk utility.\n    * Macs made after December 2009 wont boot. Apple boot discs are never forward compatible meaning that any mac released after a particular apple boot image wont boot. This will likely always be the case with all BUI releases. If your mac was made after the last BUI release, it probably wont work.\t","torrent":{"xt":"urn:btih:c3c4214765f8d6192a76b303815ddcc82cf3011d","amp;dn":"Mac+Bootable+Utilities+Image","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3c4214765f8d6192a76b303815ddcc82cf3011d","infoHashBuffer":{"type":"Buffer","data":[195,196,33,71,101,248,214,25,42,118,179,3,129,93,220,200,44,243,1,29]},"announce":[],"urlList":[]}}