{"title":"Nanocharacterisation - Augus I Kirkland, John L Hutchison","uid":15481185,"size":9916431,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c731a33dc5018d31b01910a472c5d7f3e783207f&amp;dn=Nanocharacterisation+-+Augus+I+Kirkland%2C+John+L+Hutchison&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470257323,"description":"Nanocharacterisation - Augus I Kirkland, John L Hutchison (RSC, 2007).pdf\r\n\r\nChemical characterisation techniques have been essential tools in underpinning the explosion in nanotechnology in recent years and nanochaterisation is a rapidly developing field. Contributions in this book from leading teams across the globe provide an overview of the different microscopic techniques now in regular use for the characterisation of nanostructures. Essentially a handbook to all working in the field this indispensable resource provides a survey of microscopy based techniques with experimental procedures and extensive examples of state of the art characterisation methods including: Transmission Electron Microscopy, Electron Tomography, Tunneling Microscopy, Electron Hologrpahy, Electron Energy Loss Spectroscopy. This timely publication will appeal to academics, professionals and anyone working fields related to the research and development of nanocharacterisation and nanotechnology. The Editors A I Kirkland is Professor of Materials at Oxford University and the author of over 170 refereed papers. He was awarded &quot;&quot;best materials paper&quot;&quot; of 2005 by the Microscopy Society of America. Since 2000 he has also been involved in the characterisation of CCD cameras for TEM. His most recent work involves the development of approaches to complex phase extension and diffractive imaging to further improve resolution. J l Hutchinson is a Reader in Materials at Oxford University and has published over 300 refereed papers during his career.. He is currently Vice-President of the Royal Microscopical Society (President 2002-2004), and from 2000-2004 was also a member of the Executive Board of the European Microscopy Society. He has also been involved in the development of the world's first double-aberration-corrected electron microscope.&quot;","torrent":{"xt":"urn:btih:c731a33dc5018d31b01910a472c5d7f3e783207f","amp;dn":"Nanocharacterisation+-+Augus+I+Kirkland%2C+John+L+Hutchison","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c731a33dc5018d31b01910a472c5d7f3e783207f","infoHashBuffer":{"type":"Buffer","data":[199,49,163,61,197,1,141,49,176,25,16,164,114,197,215,243,231,131,32,127]},"announce":[],"urlList":[]}}