{"title":"POtHS - Fire and Brimstone Vol 15 - Journey To The Underworld","uid":7998048,"size":4790932757,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c7ea4e78a240016f39f015bb2d01e9db98dae416&amp;dn=POtHS+-+Fire+and+Brimstone+Vol+15+-+Journey+To+The+Underworld&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":-1,"time":1357671696,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Fire and Brimstone Vol 15 - Journey To The Underworld\n\n\n\nPOtHS Comment: Out to the &quot;Woodshed&quot; with you.\n\nDescription:\nPerry Stone's Journey To The Underworld:\nThis DVD from Perry Stone Ministries is unlike any you will ever find! It includes some of the most interesting teaching on the subject of heaven and hell.\nOn this 2-hour spiritual documentary, Perry presents Biblical evidence of the subterranean chambers under the earth that presently house the fallen angels metioned in 2 Peter 2:4, and the lost souls of mankind mentioned in Luke 16.\nHe reveals key scriptures relating how the entrances to the underworld are spiritual gates located under the seas. By studying the five Hebrew and Greek words used in the Bible, you will have a fresh understanding of where the unsaved go at moment of death.\n\nDVD-Journey to the Underworld Manna-Fest package includes: DVD - Journey to the Underworld CD059 Praying Your Bloodline out of Sodom This package from Perry Stone Ministries is unlike any you will ever find! It includes some of the most interesting teaching on the subject of heaven and hell. On this 2-hour spiritual documentary, Perry presents Biblical evidence of the subterranean chambers under the earth that presently house the fallen angels metioned in 2 Peter 2:4, and the lost souls of mankind mentioned in Luke 16. He reveals key scriptures relating how the entrances to the underworld are spirit.\n-----------------------------------------------------------\n\nEPHESIANS 6:12 - UNDENIABLE PROOF:\nWarning, this is very disturbing.  EPHESIANS 6:12 says we're in a spiritual war, and prove it in this video. Demons, and spiritual evil runs our world, and pulls the strings. Willing men who sell their souls for a lie they bought from satan himself. If he deceived a 3rd of the angels in heaven, how much more so can he can deceive humans on earth into believing his lies? I however have reserved my house in heaven, bought with the blood of Yeshua (Jesus)...\n----------------------------------------------------------\n\nHell, What Is It Like? by David Wilkerson:\nWOW... what a ground shaking sermon for the Flock; please everyone take head and wake up to this reality.  For I truly desire that none may fail.  It makes me weep to hear such heart-breaking eternal damnation.  I beg you to wake up and stay on the &quot;narrow path.&quot;\n\nThis is a very sobering message on the reality of hell. Barely any preachers these days would even dare to preach on this subject but how sad that falls from the new testament normal of hell as a normal doctrine taught and discussed. Jesus spoke of hell more then heaven, listen carefully and know that there is a eternal hell.\n\n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:c7ea4e78a240016f39f015bb2d01e9db98dae416","amp;dn":"POtHS+-+Fire+and+Brimstone+Vol+15+-+Journey+To+The+Underworld","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7ea4e78a240016f39f015bb2d01e9db98dae416","infoHashBuffer":{"type":"Buffer","data":[199,234,78,120,162,64,1,111,57,240,21,187,45,1,233,219,152,218,228,22]},"announce":[],"urlList":[]}}