{"title":"Get Out from Under Once and for All","uid":4747354,"size":1431231,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c83e3d98833c51a6625ec976159658f6355892e2&amp;dn=Get+Out+from+Under+Once+and+for+All&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"VasiaZozulia","files":1,"time":1235949382,"description":"The average American college student owes about $17,000 in loans after graduation. Quadruple that amount for the average grad school graduate. An estimated seven million Americans have accumulated nearly $81 billion in student loan debt over the past 30 years. Not all of these borrowers are fresh out of college; many are in their late 20s, 30s, and even 40s. Indeed, the amount of student loan debt facing Americans is pervasive, if not problematic.\n\nFortunately, a number of creative ways exist to pay off this financial burden that, for many, goes on for years and years. In Free Yourself from Student Loan Debt, business writer Brian O'Connell outlines the best ways to do just that-as quickly and painlessly as possible. He guides readers through often over-looked but perfectly legitimate loan management techniques, including how to:\n\n* &quot;&quot;Consolidate&quot;&quot; loans for easier (and lower) payments.\n\n* Defer loans with no penalty.\n\n* Take a &quot;&quot;break&quot;&quot; from student loans through a mechanism called forbearance.\n\n* Get out of default status by making as few as six minimum payments.\n\n* Fix problems that result when a loan isn't paid, with no lasting impact on credit or finances.\n\n* Convince financial institutions to &quot;&quot;forgive&quot;&quot; loans.\n\n* Fight the government and financial institutions that claim student loan debts weren't paid years after they were.\n\nWith wit and wisdom, O'Connell backs up his guidance with case histories, anecdotes, information boxes, sidebars, and colorful industry profiles-all packaged together in one lively, user-friendly book. As a bonus, he offers 50 surefire tips to eliminating student loan debt.","torrent":{"xt":"urn:btih:c83e3d98833c51a6625ec976159658f6355892e2","amp;dn":"Get+Out+from+Under+Once+and+for+All","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c83e3d98833c51a6625ec976159658f6355892e2","infoHashBuffer":{"type":"Buffer","data":[200,62,61,152,131,60,81,166,98,94,201,118,21,150,88,246,53,88,146,226]},"announce":[],"urlList":[]}}