{"title":"Steven Awalt - Steven Spielberg and Duel: The Making of a Film C","uid":10091866,"size":30201264,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c87f588a9cedd790a058b8e84facbada67743055&amp;dn=Steven+Awalt+-+Steven+Spielberg+and+Duel%3A+The+Making+of+a+Film+C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SectorVector","files":1,"time":1399214705,"description":"\nSteven Spielberg and Duel: The Making of a Film Career\n\n# Author: Steven Awalt\n# Pages: 354 pages\n# Publisher: Rowman &amp; Littlefield Publishers (March 14, 2014)\n# ISBN-10: 081089260X\n# ISBN-13: 978-0810892606\n# Format : ePub\n\n\nSince the early 1970s, Steven Spielberg has directed more than two dozen films, many of which have achieved classic status. In addition to critical and commercial successes that include E.T. the Extra-Terrestrial, Schindler's List, Saving Private Ryan, and Lincoln, Spielberg's name has become synonymous with such thrilling adventure films as Jaws, Raiders of the Lost Ark, Jurassic Park, and Minority Report.\n\nBefore he became a world-renowned filmmaker, however, Spielberg established himself on television, helming episodes of Rod Serling's Night Gallery; Marcus Welby, M.D.; and Columbo. But it was the small-screen version of a Richard Matheson short story that brought the young director's work to the attention of critics and viewers alike. \n\nIn Steven Spielberg and Duel: The Making of a Film Career, Steven Awalt provides an exhaustive study commemorating the film that decisively launched the career of a major film artist. Through in-depth research and interviews with the film's creative and technical crew, the author tracks the film from genesis through production to release. Awalt conducted lengthy one-on-one interviews with Spielberg, Matheson, assistant director James Fargo, editor Frank Morriss, composer Billy Goldenberg, former MCA/Universal president Sidney J. Sheinberg, and writer-producer Steven Bochco, among others.\n\nSpielberg provided access to many rare documents from his archives, including multiple drafts of Duel's teleplay, the shooting schedule, shooting logistics breakdowns, and production correspondence. The first book-length examination of this important production in the director's early career, Steven Spielberg and Duel also includes the original teleplay by Matheson, four additional scenes created for the international theatrical release of the film, photos, and storyboards of the film's final sequence. A fascinating look behind the scenes of an acclaimed work, this book will interest not only scholars and film historians but anyone interested in the work of Richard Matheson and Steven Spielberg.\n\n\nAbout the Author\n================\nSteven Awalt holds a master's degree in cinema studies from DePaul University. Writer, film historian, and noted authority on Steven Spielberg's career, Awalt appears in the retrospective documentary The Shark Is Still Working on the Blu-ray edition of Jaws. \n\nAwalt is currently working on a follow-up book about Steven Spielberg's 1974 feature film &quot;The Sugarland Express.&quot; The book will include new interviews with actors Goldie Hawn, William Atherton and Michael Sacks, screenwriters Hal Barwood and Matthew Robbins, director of photography Vilmos Zsigmond, and many more. \n\n &lt;a href=&quot;\nhttp://www.goodreads.com/book/show/18815520-steven-spielberg-and-duel&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goodreads.com/book/show/18815520-steven-spielberg-and-duel&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.rogerebert.com/balder-and-dash/book-excerpt-steven-spielberg-and-duel-the-making-of-a-film-career&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rogerebert.com/balder-and-dash/book-excerpt-steven-spielberg-and-duel-the-making-of-a-film-career&lt;/a&gt;\n &lt;a href=&quot;\nhttp://books.google.co.in/books?isbn=0810892618&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://books.google.co.in/books?isbn=0810892618&lt;/a&gt;\n\n\n-_-","torrent":{"xt":"urn:btih:c87f588a9cedd790a058b8e84facbada67743055","amp;dn":"Steven+Awalt+-+Steven+Spielberg+and+Duel%3A+The+Making+of+a+Film+C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c87f588a9cedd790a058b8e84facbada67743055","infoHashBuffer":{"type":"Buffer","data":[200,127,88,138,156,237,215,144,160,88,184,232,79,172,186,218,103,116,48,85]},"announce":[],"urlList":[]}}