{"title":"Supermen Of America","uid":7826524,"size":45466755,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c982ad820638939768df6212a30b2c0697b4abea&amp;dn=Supermen+Of+America&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SplhcbPrime","files":-1,"time":1352941197,"description":"The Supermen of America is the name of two fictional superhero teams published by DC Comics. The original group first appeared in a special written by Stuart Immonen published in 1999, and a later mini-series written by Fabian Nicieza, which was published in 2000. The second group debuted in Superman 714 in 2011.\n\nThis torrent contains all six-issues of the first group.\n\nThe young members of the superhero team, Supermen of America, are all young meta-humans, gathered by Outburst, after the shooting death of singer Junior K-D, from the boy band Crossfire. Outburst and his family had been saved from death at Doomsday's hands by Superman. The young naive meta is willing to accept Lex Luthor's funding for a team of superheroes to protect the city in Superman's absence.\n\nA disgruntled Lexcorp employee discovers that S.T.A.R. Labs had hidden a capsule inside a special holding chamber called Lockdown 6 in the waters near Metropolis. Luthor successfully deploys Pyrogen to retrieve the capsule from Lockdown 6, but he encounters the villainous group Deep Six and is rebuffed. Darkseid, Lord of Apokolips, also wanted the contents of Lockdown 6, and has sent the Deep Six to retrieve them. In the Vega system, the Warlords of Okaara sense the danger presented by the capsule, and take preventative measures.\n\nThe Okaarans overpower Earth's defensive forces and White Lotus hurries to negotiate a peace settlement before they cleanse the planet. To save Earth from worse attacks the chamber is opened and the Unimaginable was unleashed. The Unimaginable's energy form possesses Maximum and he temporarily gains immense power. Maximum's parents eventually convince him to relinquish the power, which he disperses safely.\n\nIn exchange for the Supermen's silence about his involvement with the Unimaginable fiasco, Lexcorp cuts its ties with the Supermen of America charities. Lex Luthor signs all property deeds over to the organization.\n\nSeveral members of the group are seen during the 2006 Infinite Crisis event, in the pages of The OMAC Project 6.\n\nThis torrent was created to honor a request.\n\nNOTE:  These are not my scans.  All praise and glory to the original scanners (and authors/artists/publishers,) please.\n\nEnjoy, and please seed.\n","torrent":{"xt":"urn:btih:c982ad820638939768df6212a30b2c0697b4abea","amp;dn":"Supermen+Of+America","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c982ad820638939768df6212a30b2c0697b4abea","infoHashBuffer":{"type":"Buffer","data":[201,130,173,130,6,56,147,151,104,223,98,18,163,11,44,6,151,180,171,234]},"announce":[],"urlList":[]}}