{"title":"Horace Silver - 1956 - Silver's Blue (2005) FLAC","uid":8394337,"size":212825900,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c9961c56906dab834d893be872f6d459798c28ec&amp;dn=Horace+Silver+-+1956+-+Silver%27s+Blue+%282005%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1366527278,"description":"Horace Silver - 1956 - Silver's Blue (2005)\n\nTwo sessions in the mid-'50s produced the material for this album, which despite or perhaps because of being one of the historical early recordings of the Horace Silver Quintet, was later treated to a confusing mess of reissues, some of which never really mentioned what was so historic about the material in the first place. Maybe there was no reason to, since by the new millennium the type of groovy, funky jazz Silver was famous for had become so in demand that any recording of the authentic item was considered coated with golden fairy dust. In the late '80s, when this particular imprint was released on the public, just the fact that it was a reissue of something old seemed to be enough. The liner notes begin with a pretentious description of the lengths to which the geniuses who remastered this went, in order to not only preserve the integrity of the original tapes but to bring them up to the standards of the era. Which everyone knows were no standards and, anyway, these tapes sounded fantastic in the first place.\n\nFirst off, the liner notes should have said, &quot;Listen to Hank Mobley.&quot; The tenor saxophonist is the first to solo on the title track, and what a beautiful improvisation it is, always centered around the blues but twisting through some melodic turns of phrases that reference folk songs and who knows what else. Besides the pianist, who is in his usual tasty form, it is Mobley who makes this album really breathe, as neither trumpeter will really knock one's socks off. Joe Gordon is a bit undersung, true, but he also has a pinched sound in the upper register and a habit of noodling his way from change to change as if he felt inspiration was just around the corner. For the second session he is replaced by Donald Byrd, who has his moments despite relying on stock phrases at times when the intensity of his solo is just building up. The arrangement of &quot;How Long Has This Been Going On?&quot; is refreshingly quiet and gentle, showing that Silver had more than one direction and bringing forth another type of tone from Mobley, all velvet and feathers. Songwriter Frank Loesser's &quot;I'll Know&quot; is also given a bright, catchy arrangement. The theme is stated in a series of slowly unfolding pronouncements building up to a great moment right before the solos start, when a strong medium-tempo groove comes in. On his solo, the pianist lays out his notes like a casino dealer providing cards all around to all the players, following blues licks with rapid chromatic bop devilments. The original &quot;Shoutin' Out&quot; is the kind of stuff Silver is really known for, and it is fantastic. The fine drummer Kenny Clarke, who always played well with Silver, is on hand throughout, and two excellent bassists alternate, Doug Watkins and Art Taylor. Neither man was capable of playing a wasted note. (AllMusic)\n\nTrack list:\n01 - Silver's Blue\n02 - To Beat Or Not To Beat\n03 - How Long Has This Been Going On\n04 - I'll Know\n05 - Shoutin' Out\n06 - Hank's Tune\n07 - The Night Has A Thousand Eyes\n\nPersonnel:\n\nHorace Silver - piano\nHank Mobley - tenor saxophone\nDoug Watkins - bass\nDonald Byrd - trumpet (tracks 1, 4, 6 &amp; 7)\nJoe Gordon - trumpet (tracks 2, 3 &amp; 5)\nKenny Clarke - drums (tracks 2, 3 &amp; 5)\nArt Taylor - drums (tracks 1, 4, 6 &amp; 7)\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:c9961c56906dab834d893be872f6d459798c28ec","amp;dn":"Horace+Silver+-+1956+-+Silver%27s+Blue+%282005%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9961c56906dab834d893be872f6d459798c28ec","infoHashBuffer":{"type":"Buffer","data":[201,150,28,86,144,109,171,131,77,137,59,232,114,246,212,89,121,140,40,236]},"announce":[],"urlList":[]}}