{"title":"Cantwell-Queer Blood-Secret AIDS Genocide Plot(1993)","uid":4535647,"size":851890,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9ecff3b0ec3fb969541da10d6cd0199da0b7e67&amp;dn=Cantwell-Queer+Blood-Secret+AIDS+Genocide+Plot%281993%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227726339,"description":"This is Alan Cantwell&amp;#039;s shocking book Queer Blood - The Secret AIDS Genocide Plot (1993) where this gay doctor exposes the horrific story of the genetically engineered AIDS virus that was created in a laboratory and now threatens the entire world. In this well-documented sequel to his AIDS &amp; The Doctors of Death, Cantwell debunks the African green monkey theory of AIDS and explains how AIDS started as a covered-up genocide experiment, using gays and blacks as guinea pigs. There has long been the story that there is a secret gay genocide with the culprit being a genetically engineered virus. Although there is little concrete scientific evidence that such a genocide is taking place, there are many questions that have not been answered. The little proven belief is that vaccines containing lethal biological agents were injected into African Blacks and white gays of Manhattan in order to produce a holocaust that would remove two undesirable groups from the earth. One thing that is true is that it is highly unlikely that a Black heterosexual epidemic could have transformed itself into a white gay disease in America. This is a book to be read with an open mind, remembering that there are few concrete facts that support this idea. Nevertheless this is a book and idea to be reckoned with. It is easy to read and takes little time to finish but when finished, you really do not know what to believe, especially if you are a gay male in the midst of this hidden holocaust. Also find out how all these AIDS drugs don&amp;#039;t work at all, bringing toxic substances into your body which eventually causes you to die even sooner. 155 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:c9ecff3b0ec3fb969541da10d6cd0199da0b7e67","amp;dn":"Cantwell-Queer+Blood-Secret+AIDS+Genocide+Plot%281993%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9ecff3b0ec3fb969541da10d6cd0199da0b7e67","infoHashBuffer":{"type":"Buffer","data":[201,236,255,59,14,195,251,150,149,65,218,16,214,205,1,153,218,11,126,103]},"announce":[],"urlList":[]}}