{"title":"Looks Like Rain - Radio Dramas","uid":9788510,"size":125904493,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:cb0920de22bd7a0b06ddfd118f0868749165fd1e&amp;dn=Looks+Like+Rain+-+Radio+Dramas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pigman58","files":3,"time":1395208480,"description":"3 x 45 mins. Three, interlinked dramas.\n\n1 - Looks Like Rain: The hard edged Joyce (Dora Bryan) and her brother, the weak Stan are the only mourners at the funeral of their unloved mother. Their brother Charlie (Roy Barraclough) has not been seen since the death of his homosexual lover Lawrence 15 years before, and Charlie is now living on the streets. Returning to their mother's house, they find photos and other documents that throw doubt on their parentage. Only one of the three siblings was legitimate, and it is to that person their mother has left her house. But which of them is it?\n\n2 - Looks Like Rain Again: Charlie has come to the house with more stories about their heritage. By the end of the day, one of the siblings will be dead.\n\n3 - Rain On the Just: This was written some time after the first two and for me was not an easy fit. It is the day after the funeral, one sibling is dead and another a murderer. The siblings' cousin arrives, looking for the missing person. More secrets are revealed, but what is the truth?\n\nInteresting to hear three actors normally thought of as light comic actors dealing with meatier matter. ","torrent":{"xt":"urn:btih:cb0920de22bd7a0b06ddfd118f0868749165fd1e","amp;dn":"Looks+Like+Rain+-+Radio+Dramas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb0920de22bd7a0b06ddfd118f0868749165fd1e","infoHashBuffer":{"type":"Buffer","data":[203,9,32,222,34,189,122,11,6,221,253,17,143,8,104,116,145,101,253,30]},"announce":[],"urlList":[]}}