{"title":"Copland: The Populist - SFS, Michael Tilson Thomas (2000)","uid":13427038,"size":339722747,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cb138389543014073fc599965ebebe4bbcb974b8&amp;dn=Copland%3A+The+Populist+-+SFS%2C+Michael+Tilson+Thomas+%282000%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Scheheraz","files":23,"time":1454600701,"description":"AARON COPLAND (1900-1990)\r\nThe Populist\r\n\r\nGramophone [9/2000]:\r\nmarvellously well engineered into the bargain\r\n\r\n&quot;They’ve already dazzled us with ‘Copland the Modernist’ (RCA, 3/97); now Michael Tilson Thomas and his stunning San Francisco band champion ‘Copland the Populist’ and those three great ballet scores of 1938-44, Billy the Kid, Rodeo and Appalachian Spring. For the latter, Tilson Thomas boldly opts for the rarely heard full orchestral version of the complete ballet score (Slatkin does likewise on his quite admirable 1985 recording with the St Louis Symphony, part of an all-Copland ‘twofer’ on EMI Double Forte). This includes an extra 10 or so minutes of fretful, dark-hued music omitted from the familiar suite (try from around 22’), after which that glorious final statement of Simple Gifts seems to emerge with even greater eclat and emotional release than usual. Elsewhere, these newcomers distil all the tender poetry and dewy freshness you could wish for, while bringing a marvellously supple spring and athletic purpose to any faster music.\r\nUnder Tilson Thomas, the suite from Billy the Kid opens with a real sense of ‘once upon a time’ wonder, the illimitable expanses of the prairie stretching out before our very eyes. The ensuing street scene soon generates an infectious rhythmic snap, and there’s a wonderfully affecting contribution from the SFSO’s principal trumpet during the card game at night (sample from 11'45'' onwards). Best of all is ‘Billy’s death’ (17'36''), as poignantly intoned as I’ve ever heard it. Absolutely no grumbles, either, about the four Rodeo dance episodes. Tilson Thomas sees to it that ‘Buckaroo Holiday’ packs all the requisite punch and high-kicking swagger, while the two middle numbers ravish the ear in their disarming beauty. Moreover, the concluding ‘Hoe-Down’ goes with terrific, toe-tapping gusto, though the orchestra’s delirious whoops of delight some two minutes in may perhaps strike some listeners as rather too much of a good thing (they didn’t bother me one little bit, I have to say).\r\nBoasting some handsomely opulent, exhilaratingly expansive sonics, this is one corker of a release.&quot; --Andrew Achenbach\r\n\r\n1. Billy The Kid [21:09]\r\n2. Appalachian Spring [35:51]\r\nRodeo\r\n3. I. Buckaroo Holiday [7:30]\r\n4. II. Corral Nocturne [3:55]\r\n5. III. Saturday Night Waltz [4:27]\r\n6. IV. Hoe Down [3:23]\r\n\r\nSan Francisco Symphony\r\nMichael Tilson Thomas\r\n\r\nRecorded May 19-23, 1999, at Davies Symphony Hall, San Francisco\r\nProduced by Andreas Neubronner\r\nRecording and editing engineer: Markus Heiland\r\nCreative Direction: Janet DeMatteis\r\n© 2000, BMG Music\r\nRCA 09026-63511-2","torrent":{"xt":"urn:btih:cb138389543014073fc599965ebebe4bbcb974b8","amp;dn":"Copland%3A+The+Populist+-+SFS%2C+Michael+Tilson+Thomas+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb138389543014073fc599965ebebe4bbcb974b8","infoHashBuffer":{"type":"Buffer","data":[203,19,131,137,84,48,20,7,63,197,153,150,94,190,190,75,188,185,116,184]},"announce":[],"urlList":[]}}