{"title":"EnigmaT Set Rips { Cuts } - May 21st, 2013","uid":8495712,"size":1013236636,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cb43f35cd59371ee3846ad2439fd51f85933837b&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+21st%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":115,"time":1369094552,"description":"2Sher - The World (Original Mix) (Cut From W&amp;W Set)-enTc.mp3\nA.R.D.I. &amp; Dennis Pedersen - Forgotten (Den Rize Electrified Mix) (Cut From Dymond Set)-enTc.mp3\nAERO 21 - You &amp; Me In the Sunset (Original Mix) (Cut From Sty Set)-enTc.mp3\nAlae Khaldi - Retrospective (Sou Kanai Remix) (Cut From Sty Set)-enTc.mp3\nAlex M.O.R.P.H. &amp; Protoculture - Waking Up The Stars (Skytech Remix) (Cut From Darius Set)-enTc.mp3\nAllen &amp; Envy - Alcohol Abuse (Cut From Allyn Set)-enTc.mp3\nAllen &amp; Envy - Something More (Cut From Allyn Set)-enTc.mp3\nAmitacek - Elite (Cut From Amitacek Set)-enTc.mp3\nAna Criado &amp; Omnia - No One Home (SNR Dub) (Cut From Myon Set)-enTc.mp3\nAndre Van Reese &amp; Kane Nelson - Revolution (Cut From Haslam Set)-enTc.mp3\nAndrew StetS - The Web (Cut From W&amp;W Set)-enTc.mp3\nAndy Wood - Redemption (Casey Rasch Remix) (Cut From OzzyXPM Set)-enTc.mp3\nAozora - Majestic (Talamanca Remix) (ABGT 028 Rip)-enTc.mp3\nAr-2 - SandStorm (Original Mix) (Cut From Sty Set)-enTc.mp3\nAraya &amp; Mark Dreamer - Tension (Gary Afterlife Remix) (Cut From C-Systems Set)-enTc.mp3\nArman Dinarvand - Deist (Original Mix) (Cut From Uplift Set)-enTc.mp3\nArston - Zodiac (Cut From Claessen Set)-enTc.mp3\nArston - Zodiac (Cut From Hardwell Set)-enTc.mp3\nArston - Zodiac (Original Mix) (Cut From W&amp;W Set)-enTc.mp3\nArtifi - Sparco (Cut From Eunostos Set)-enTc.mp3\nAscania - Contact (Function C Remix) (Cut From Above Clouds Set)-enTc.mp3\nAscania - Contact (Function C Remix) (Cut From Amitacek Set)-enTc.mp3\nAscania - Contact (Function C Remix) (Cut From Saux Set)-enTc.mp3\nAscania - Contact (Function C Remix) (Cut From Tero A Set)-enTc.mp3\nAskery - Hybrid (Cut From Claessen Set)-enTc.mp3\nAsteroid Belt - Sweet Melancholy (Original Mix) (Cut From Saux Set)-enTc.mp3\nBeatsole - Breakthrough (Michael Retouch Remix) (Cut From Gibson Set)-enTc.mp3\nClmd Vs. Kish Feat. Froder - The Stockholm Syndrom (Extended Version) (Cut From Shah Set)-enTc.mp3\nCLMD vs. Kish Feat. Froder - The Stockholm Syndrome (CLMD Extended Version) (Cut From Claessen Set)-enTc.mp3\nCullera - Sun And Sea (Original Mix) (Cut From Shah Set)-enTc.mp3\nDaniel Lesden - Mars One (Cut From Allyn Set)-enTc.mp3\nDanny Stubbs feat. Issa - Secrets (Club Mix) (Cut From Boom Jinx Set)-enTc.mp3\nDart Rayne &amp; Yura Moonlight and Sarah Lynn - Silhouette (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nDenzel Park - Warp 13 (Southside Remix) (Cut From Tydi Set)-enTc.mp3\nDirty Shade feat. Matisha - Pleasure (Dub Mix) (Cut From Divini Set)-enTc.mp3\nDivini &amp; Warning - OMG (Cut From Divini Set)-enTc.mp3\nDJ Madwave - Eternal Spirit (Space Raven's Uplifter Remix) (Cut From RAM Set)-enTc.mp3\nDon Diablo feat. Alex Clare &amp; Kelis - Give It All (Don Diablo &amp; CID Remix) (Cut From Hardwell Set)-enTc.mp3\nDrama - Childsplay (Cut From Haslam Set)-enTc.mp3\nDreamy - Brothers Dearly (Immersiv Remix) (Cut From Above Clouds Set)-enTc.mp3\nDreamy - Tyr (Emotional Mix) (Cut From Above Clouds Set)-enTc.mp3\nEhren Stowers - 3D (Lostly Remix) (Cut From Stowers Set)-enTc.mp3\nEmbliss &amp; Ad Brown - Oreon (Luke Porter Remix) (Cut From Boom Jinx Set)-enTc.mp3\nEmbliss &amp; Ad Brown - Oreon (Shingo Nakamura Remix) (Cut From Probity Set)-enTc.mp3\nEmerge featuring Nafsica - Never Lose Myself (Luke Terry Remix) (Cut From Gibson Set)-enTc.mp3\nEmpire Of The Sun - Alive (Zedd Remix) (Cut From Hardwell Set)-enTc.mp3\nEmpire of The Sun - Alive (Zedd Remix) (Cut From W&amp;W Set)-enTc.mp3\nFarhad Mahdavi - First Kiss (Touchstone Remix) (Cut From Tero A Set)-enTc.mp3\nFilth Splendour feat. Marisa - Gold (Moe Aly Remix) (Cut From Divini Set)-enTc.mp3\nFon.Leman - One Day (Cosmonaut Remix) (Cut From Boom Jinx Set)-enTc.mp3\nGiuseppe Ottaviani &amp; Audiocells feat. Shannon Hurley - I Am Your Shadow (Set Rip)-enTc.mp3\nGiuseppe Ottaviani &amp; Ferry Corsten - Magenta (Set Rip)-enTc.mp3\nGiuseppe Ottaviani - Cold Flame (Set Rip)-enTc.mp3\nGiuseppe Ottaviani - Feel The Music (Set Rip)-enTc.mp3\nGiuseppe Ottaviani - Waterpark (Set Rip)-enTc.mp3\nGiuseppe Ottaviani feat. Alana Aldea - Heal This Empty Heart (Set Rip)-enTc.mp3\nGiuseppe Ottaviani feat. Audrey Gallagher - Walk This World With Me (Set Rip)-enTc.mp3\nGiuseppe Ottaviani feat. Faith - Nothing Wrong  (Set Rip)-enTc.mp3\nGiuseppe Ottaviani feat. Linnea Schossow - Stars (Set Rip)-enTc.mp3\nGiuseppe Ottaviani feat. Lo-Fi Sugar - Rush (Set Rip)-enTc.mp3\nGiuseppe Ottaviani feat. Seri - Gave Me (Set Rip)-enTc.mp3\nGiuseppe Ottaviani feat. Stephen Pickup - Illusion (Set Rip)-enTc.mp3\nGiuseppe Ottaviani feat. Vitamin B - Waiting On Someday (Set Rip)-enTc.mp3\nGiuseppe Ottaviani with Aly &amp; Fila - Brilliant People (Set Rip)-enTc.mp3\nHardwell &amp; Dyro feat. Bright Lights - Never Say Goodbye (Cut From W&amp;W Set)-enTc.mp3\nHardwell &amp; Dyro feat. Heather Bright - Never Say Goodbye (Cut From Hardwell Set)-enTc.mp3\nHesham Watany vs. Lo'ay Watany - Supernatural (Original Mix) (Cut From Sty Set)-enTc.mp3\nIlya Malyuev pres. Baltic Sound - Montreal (Scotty Sunday Remix) (Cut From Probity Set)-enTc.mp3\nJesse Voorn - Heroes (Cut From Hardwell Set)-enTc.mp3\nJochen Miller &amp; SL8 - Flashpoint (Cut From W&amp;W Set)-enTc.mp3","torrent":{"xt":"urn:btih:cb43f35cd59371ee3846ad2439fd51f85933837b","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+21st%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb43f35cd59371ee3846ad2439fd51f85933837b","infoHashBuffer":{"type":"Buffer","data":[203,67,243,92,213,147,113,238,56,70,173,36,57,253,81,248,89,51,131,123]},"announce":[],"urlList":[]}}