{"title":"The Young Victoria ","uid":5902176,"size":4532533248,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cbfbb205c630df300719265f40ad14ee4b942b39&amp;dn=The+Young+Victoria+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiagofavi2612","files":1,"time":1287720148,"description":"O filme ÃƒÂ© uma crÃƒÂ´nica da ascensÃƒÂ£o da Rainha VitÃƒÂ³ria (Emily Blunt) ao trono, focando nos primeiros anos do seu turbulento reinado e o lendÃƒÂ¡rio romance e casamento com o PrÃƒÂ­ncipe Albert (Rupert Friend).\nA Jovem Rainha VitÃƒÂ³ria ÃƒÂ© um belo filme, que traz uma linda histÃƒÂ³ria de amor sob os bastidores polÃƒÂ­ticos da corte britÃƒÂ¢nica. AlÃƒÂ©m de atender a curiosidade sempre existente sobre a vida particular dos antigos monarcas, mostra com delicadeza as dificuldades dos afazeres do posto maior da monarquia. Destaque para a cuidadosa direÃƒÂ§ÃƒÂ£o de Jean-Marc VallÃƒÂ©e, para a bela cena do pedido de casamento e para a iluminaÃƒÂ§ÃƒÂ£o, propositalmente escura para retratar a pouca luminosidade existente no perÃƒÂ­odo retratado. Um filme que nÃƒÂ£o apenas informa, mas tambÃƒÂ©m emociona.\nO sonho de ser princesa, recorrente entre as meninas, era a realidade de Alexandrina VitÃƒÂ³ria Regina. Mas a vida da moÃƒÂ§a, ÃƒÂºltima de sua linhagem real, nÃƒÂ£o era exatamente um conto de fadas, jÃƒÂ¡ que ela cresceu sob as duras &quot;Regras Kensington&quot;, que visavam sua proteÃƒÂ§ÃƒÂ£o a todo instante, cuidando da sucessÃƒÂ£o do trono. Esses normas rÃƒÂ­gidas impediam que ela dormisse sozinha, descesse escadas desacompanhada ou mesmo deixasse seu palÃƒÂ¡cio com frequÃƒÂªncia.\nCom a morte prematura de seu tio, Guilherme IV, VitÃƒÂ³ria assumiu o trono da Inglaterra aos 18 anos. Tornada rainha, a garota viu-se no centro de conspiraÃƒÂ§ÃƒÂµes e jogos de poder - e tambÃƒÂ©m alvo de pretendentes ÃƒÂ  sua mÃƒÂ£o.\nA Jovem Rainha VitÃƒÂ³ria (Young Victoria, 2009) trata justamente desse perÃƒÂ­odo de transiÃƒÂ§ÃƒÂ£o, em que os olhares da regente, aqui vivida por Emily Blunt, ficaram divididos entre seu primo, Albert de Saxe-Coburg (Rupert Friend), e o polÃƒÂ­tico Lorde Melbourne (Paul Bettany). A trama mostra os erros e acertos de VitÃƒÂ³ria em seus primeiros meses no cargo, incluindo uma bizarra crise constitucional gerada pela escolha de camareiras, mas o faz como escancarada desculpa para o real interesse da produÃƒÂ§ÃƒÂ£o, o romance.\nO filme de Jean-Marc VallÃƒÂ©e (C.R.A.Z.Y.), com roteiro de Julian Fellowes (Feira das Vaidades), flerta com ideias que parecem arrojadas, como a de um amor igualitÃƒÂ¡rio (VitÃƒÂ³ria jÃƒÂ¡ era rainha e poderosa o suficiente, mas viu na troca de ideias com Albert o futuro de seu reinado). Mas ÃƒÂ© nos ideais do amor romÃƒÂ¢ntico que ele efetivamente se encontra. A imagem das escrivaninhas frente a frente, como duas metades de um todo, nÃƒÂ£o deixa dÃƒÂºvida disso.\nDÃƒÂ¡ pra entender o fato do filme ignorar temas importantes do reinado de VitÃƒÂ³ria, como a polÃƒÂ­tica expansionista britÃƒÂ¢nica e a RevoluÃƒÂ§ÃƒÂ£o Industrial, afinal, optou-se por um romance tÃƒÂ­pico - e nos registros histÃƒÂ³ricos existiram poucos como o da rainha e seu prÃƒÂ­ncipe consorte. Como ela o escolheu para marido, considera-se que o casamento tenha sido o primeiro por amor jÃƒÂ¡ realizado na realeza.\nJunte a isso os belos jardins palacianos, um &quot;quem-ÃƒÂ©-quem&quot; do cinema inglÃƒÂªs, os figurinos que renderam mais um Oscar a Sandy Powell e a direÃƒÂ§ÃƒÂ£o de arte e maquiagem (indicadas ao mesmo prÃƒÂªmio) e vocÃƒÂª tem um romance que preenche todos os melhores requisitos do gÃƒÂªnero. Pra quÃƒÂª preocupar-se com expansÃƒÂµes e revoluÃƒÂ§ÃƒÂµes quando vocÃƒÂª tem um amor ideal ÃƒÂ  sua disposiÃƒÂ§ÃƒÂ£o? .\n","torrent":{"xt":"urn:btih:cbfbb205c630df300719265f40ad14ee4b942b39","amp;dn":"The+Young+Victoria+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbfbb205c630df300719265f40ad14ee4b942b39","infoHashBuffer":{"type":"Buffer","data":[203,251,178,5,198,48,223,48,7,25,38,95,64,173,20,238,75,148,43,57]},"announce":[],"urlList":[]}}