{"title":"Attenborough in Paradise","uid":5563234,"size":5134367812,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ccaea4d1cd9ee0e6f628c076cc7cbe46f332b3e4&amp;dn=Attenborough+in+Paradise&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"zappa1969","files":7,"time":1273904968,"description":"Credit for this torrent goes to mvgroup An education in P2P\n\nAttenborough in Paradise is a BBC television documentary written and presented by David Attenborough. It was first transmitted in 1996 and is part of the Attenborough in Paradise and Other Personal Voyages collection of seven documentaries.\n\nIn this program Attenborough fulfills a childhood ambition, developed after reading a book as a nine year old, to see the Greater Bird-of-paradise in display; and records the spectacular birdlife of the New Guinea forest, in particular the various birds-of-paradise.\n\nAmazon\n\nA collection of seven David Attenborough specials, Attenborough in Paradise represents some of the famed naturalist's most personal quests and passionate enthusiasms. Programming includes Attenborough tracing a piece of amber in The Amber Time Machine, discovering the history behind a strange figurine in The Lost Gods of Easter Island, and realizing a childhood dream by visiting New Guinea to record the spectacular courtship displays of the birds of paradise. The set also includes Life on Air, a 2002 tribute to Attenborough, chronicling the world-renowned natural history expert's 50-year career at the BBC, presented by Michael Palin \n\n","torrent":{"xt":"urn:btih:ccaea4d1cd9ee0e6f628c076cc7cbe46f332b3e4","amp;dn":"Attenborough+in+Paradise","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccaea4d1cd9ee0e6f628c076cc7cbe46f332b3e4","infoHashBuffer":{"type":"Buffer","data":[204,174,164,209,205,158,224,230,246,40,192,118,204,124,190,70,243,50,179,228]},"announce":[],"urlList":[]}}