{"title":"Skyrim - ALL DLC - Dawnguard, Dragonborn, Hearthfire - Xbox 360","uid":9764188,"size":1534427660,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:cd7c3825fb17f6e42b1f19f724427a122d98ec4a&amp;dn=Skyrim+-+ALL+DLC+-+Dawnguard%2C+Dragonborn%2C+Hearthfire+-+Xbox+360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":8,"uploader":"freedomtotheworld","files":11,"time":1394858537,"description":"Skyrim - ALL DLC - Dawnguard, Dragonborn, Hearthfire - Xbox 360\n\nTitle: Dawnguard\nPlatform: Xbox 360\nGenre: Action role-playing \nMode: Single-player\nSize: 583 MB\nYear: June 26, 2012\nDeveloper: Bethesda Game Studios\nPublisher: Bethesda Softworks\n\n\nTitle: Dragonborn\nPlatform: Xbox 360\nGenre: Action role-playing \nMode: Single-player\nSize: 790 MB\nYear: December 4, 2012\nDeveloper: Bethesda Game Studios\nPublisher: Bethesda Softworks\n\n\nTitle: Hearthfire\nPlatform: Xbox 360\nGenre: Action role-playing \nMode: Single-player\nSize: 75,7 MB\nYear: September 4, 2012\nDeveloper: Bethesda Game Studios\nPublisher: Bethesda Softworks\n\n\n\nDragonborn:\n\nDragonborn follows the same gameplay style as Skyrim, with the player's character free to explore the island of Solstheim at will, pursuing quests at their leisure. New armors, weapons, locations and enemies have been introduced for the expansion. A new feature in Dragonborn is the ability to tame and ride Dragons. The player character can use the Dragon to target and attack enemies, but does not have complete control of the flight.[2] New Dragon Shouts, or Thu'um, have been introduced, as exclusives to the Dragonborn expansion.\n\n\n\nHearthfire:\n\nHearthfire allows the player character to purchase a plot of land and build their own home from raw materials such as lumber and clay, with the option of adding greenhouses, bee hives and alchemy/enchanting facilities. The option to hire stewards to look after the home, carriage drivers for quick transportation, and a personal bard are also available. Hearthfire also introduces the option to raise a family by adopting children.[1] In addition, previously bought pre-built homes can be altered to have a children's bedroom added into them.\n\n\n\nDawnguard:\n\nIntroduced in Dawnguard are two unique skill trees, one for vampirism noted as &quot;Vampire Lord&quot; and one for lycanthropy. Players are given the choice to either join forces with the Vampires, or fight them alongside an order of Vampire hunters known as the Dawnguard. Depending on the player's choice, they will be granted access to one of two home bases, Castle Volkihar or Fort Dawnguard, respectively. New armors, perks and weapons, including a crossbow for the Dawnguard, have been introduced. Crossbows will remain loaded when running through the world and provide a quicker shot than bows. They are, however, slower to reload. Crossbows fall under the Archery perk tree and all points assigned to Archery will also apply to crossbows. Crossbow bolts can also be crafted with enchantments to create bolts with additional magical damage.\n\nAdditionally, in the case of the Vampires, a transformation into a &quot;Vampire Lord&quot; is available, working in a similar way to the existing Werewolf transformation, with the exception that it may be used repeatedly, rather than once a day. The Vampire Lord has a new skill tree to level up, as well as a separate tree implemented for Werewolves, with both leveling up individually from the regular skill trees. The Vampire Lord skill tree contains eleven perks and the Werewolf skill tree contains eight perks. Ten new Xbox 360 Achievements can be earned after installing the Dawnguard add-on as well as eighteen new loading screens and several new world interactions.\n\nNew locations are featured in Dawnguard, including the player character journeying through a rift into a realm of Oblivion called Soul Cairn. A &quot;face sculptor&quot; character is introduced in The Ragged Flagon in Riften, allowing players to change the facial appearance of their character at will. &quot;Legendary&quot; Dragons are also present in Dawnguard, appearing randomly throughout the environment, and can be slain by the player character and absorbed like any other Dragon (awarding an achievement). Three new Dragon Shouts (Drain Vitality, Soul Tear, and Summon Durnehviir) have also been included, exclusive to Dawnguard.","torrent":{"xt":"urn:btih:cd7c3825fb17f6e42b1f19f724427a122d98ec4a","amp;dn":"Skyrim+-+ALL+DLC+-+Dawnguard%2C+Dragonborn%2C+Hearthfire+-+Xbox+360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd7c3825fb17f6e42b1f19f724427a122d98ec4a","infoHashBuffer":{"type":"Buffer","data":[205,124,56,37,251,23,246,228,43,31,25,247,36,66,122,18,45,152,236,74]},"announce":[],"urlList":[]}}