{"title":"Male Female Relationships Explained. Thoughtful Articles.","uid":4178522,"size":1687550,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cedd474b84fc8a35561e54cb4314ee4b8ffd73df&amp;dn=Male+Female+Relationships+Explained.+Thoughtful+Articles.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ARDIA3142","files":4,"time":1210272845,"description":"This is a series of Articles from F Roger Devlin which explain Modern male-female Relationships (or lack thereof).\n\nThis is sociology and penetrative analysis at its best. Should be read by every thinking person!\n\nTwo of these appeared in a journal called \\&quot;The Occidental Quarterly\\&quot;. The third, was rejected from publication. Too controversial apparently.\n\nProbably best to read them in order\n\n1) Sexual Utopia in Power\n2) Rotating Polyandry and its Enforcers (Book review and commentary)\n3) The feminine sexual counter-revolution and its Limitations (filename Shalit.doc) (also a book review and commentary)\n\nThese are among the most enlightening articles Ive ever seen. Most books dont compare. Most articles and books do not meet the ultimate test of reality.\n\nFor example, you get a motivational book, say a get rich book or self assertiveness book.\n\nWhat do they do? They fire you up! Get you all excited. But either in a few days youve forgotten about it, or the whip of reality hit you when you put its \\&amp;#039;advice\\&amp;#039; into practice. Of course they all have the \\&amp;#039;fall-back\\&amp;#039; of \\&quot;Oh, you just didnt try hard enough or didnt perservere\\&quot;. Sure a few people out of thousands of readers learn or gain something - but thats little consolation for the waste of time of untold others.\n\nHowever with these articles, I honestly took away from it a different viewpoint on life and the reality of the world around me. Its not advice, just knowledge and observation - and knowing the inner mechanics of parts of reality is very valuable.\n\nA few excerpts from the third article (shalit.doc). which is a Book review of Author Wendy Shalit\\&amp;#039;s two books \\&quot;A Return to Modesty\\&quot; and \\&quot;Girls Gone Mild\\&quot;\n\n\\&quot;A Return to Modesty was greeted with outrage from predictable quarters, such as pornographers and feminists. Baby-boomer reviewers accused her of &quot;trying to turn back the clock,  &quot; the New York Observer printed a front-page caricature of her dressed as an SS officer, and she received death threats (p. 5)....\n\n...The most interesting personal experience she relates involved an invitation, following on the success of her first book, to appear on a PBS program called &quot; If Women Ruled the World. &quot; While preparing to interview her, &quot; the producer began to explain what he wanted me to say: that a certain second wave feminist had saved womankind and that I, as a young woman, was grateful to her. &quot; When she expressed reservations about the womans ideas, &quot; the producer began to get impatient: &quot; What you are saying, &quot; he sputtered, &quot; is not in the script! &quot; &quot; (p. 19). In the end, she was not interviewed. \\&quot;\n\n\nAnd the negative...\n\n\\&quot;It is remarkable that a woman with such traditional ideas about marriage, modesty, and feminine decorum never condemns feminism per se. Instead, Shalit claims to have perceived a &quot; fourth wave &quot; of the movement characterized by the rejection of pornography and casual sex. This reviewer is not sanguine about the possibility of an eventual Nth feminist wave coming along to solve all the problems created by waves 1 through (N - 1). Shalit does better when she acknowledges that feminism has &quot; become a sort of Rohrschach test: the word itself has become almost meaningless &quot; and can refer to diametrically opposed ideas &quot; (p. 208). The young self-described feminists she quotes do sound extremely confused. They say things like &quot; I do not think the first feminists wanted us to be more like men &quot; (p. 218) and &quot; feminism has always been about valuing home life &quot; (p. 222). Some are simply using &quot; feminist &quot; to mean feminine (p. 121).\\&quot;\n\nand...\n\n\\&quot; During their nubile years, many women are at least as concerned with turning male desire off (i.e., telling the 99% to drop dead) as with turning it on (getting Mr. Alpha to commit): they get more offers of attention than they have time to process. Cunning feminists, many of them lesbians, have exploited this circumstance to the hilt, convincing naive young women they are being &quot; harassed. &quot; Quietly observing the furor over so-called harassment during the past two decades, I wondered how these women could fail to realize that the men of whom they were complaining constituted their pool of potential husbands and that they could not afford to alienate all of them. Clearly, I overestimated their intelligence. And Wendy Shalit does not distinguish herself in this respect either; she uses the term  &quot; harassment &quot; as freely and uncritically as any man-hating feminist could wish.\\&quot;\n\n\nLong Articles, but well worth the read. Enjoy!","torrent":{"xt":"urn:btih:cedd474b84fc8a35561e54cb4314ee4b8ffd73df","amp;dn":"Male+Female+Relationships+Explained.+Thoughtful+Articles.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cedd474b84fc8a35561e54cb4314ee4b8ffd73df","infoHashBuffer":{"type":"Buffer","data":[206,221,71,75,132,252,138,53,86,30,84,203,67,20,238,75,143,253,115,223]},"announce":[],"urlList":[]}}