{"title":"Jade Warrior - Last Autumn's Dream","uid":4721758,"size":46809025,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cef019093aa6afa58f2088a3537c58c1836ad30f&amp;dn=Jade+Warrior+-+Last+Autumn%5C%27s+Dream&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"st2580smile","files":-1,"time":1234551522,"description":"Jade Warrior never scored a hit single and it seems bizarre to think that anyone ever dreamed it could. Buried away on side two of its third album, however, &quot;The Demon Trucker&quot; not only has unexpected smash written all over it, but the words were large enough that the band's U.K. label Vertigo clearly felt the same way. One must sincerely regret there never came a day when a nation's pop kids were ordered to &quot;throw their hands up to the ceiling, get out on the floor and stamp your feet with feeling.&quot; Or maybe they were, but only when Slade told them to. Coming from a band better-known for weird flute solos and complicated time signatures, the demand was possibly less compulsive. It's still a great song, though, one of the finest rock &amp; rolling dance numbers of the age and, if the remainder of Last Autumn's Dream doesn't quite match those same pounding, resounding peaks, that's only because the band was busy elsewhere, piecing together some of the best-realized songs (as opposed to moods, scapes, and symphonies) of its career. By that token, then, Last Autumn's Dream takes a lot more getting used to than longtime fans might have expected; the funkily pretty &quot;May Queen,&quot; the proto-Eno-esque &quot;Borne on the Solar Wind,&quot; and the freaked guitar rage of &quot;The Snake&quot; all emerge out of nowhere to slice away at preconceptions, while even the &quot;typical&quot; numbers have atypical moments. For anybody just discovering Jade Warrior, Last Autumn's Dream is certainly the last of its truly essential albums; subsequent releases for the Island label have their moments, but they grow scarcer as time elapses. For anyone schooled in the delights of the first two LPs alone, however, there are things in here you might never forgive, like &quot;The Demon Trucker.&quot;\n\nTRACKS:\n\nA Winter's Tale\nSnake\nDark River\nJoanne\nObedience \nMorning Hymn \nMay Queen \nThe Demon Trucker \nLady of the Lake \nBorne on to the Solar Wind \n\nRipped from a near mint vinyl promotional copy.\nUn-played until this rip!","torrent":{"xt":"urn:btih:cef019093aa6afa58f2088a3537c58c1836ad30f","amp;dn":"Jade+Warrior+-+Last+Autumn%5C%27s+Dream","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cef019093aa6afa58f2088a3537c58c1836ad30f","infoHashBuffer":{"type":"Buffer","data":[206,240,25,9,58,166,175,165,143,32,136,163,83,124,88,193,131,106,211,15]},"announce":[],"urlList":[]}}