{"title":"Adrienne Mayor - Fossil Legends of the First Americans.","uid":7890785,"size":19283305,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf2c9d6b312975581c09acefc3a5555bfcb0d956&amp;dn=Adrienne+Mayor+-+Fossil+Legends+of+the+First+Americans.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SectorVector","files":1,"time":1354718017,"description":"\nAdrienne Mayor. 2005. Fossil Legends of the First Americans. Princeton University Press, Princeton. 346 pages, and 100 pages of reference materials including extensive footnotes, bibliography and an index.\n\nIndependent scholar Adrienne Mayor's 2005 book called Fossil Legends of the First Americans has a lurid cover and a lurid title, but a remarkably tasty, scientific interior. The book is a meticulously documented collection of myths, legends, stories, and (to use Mayor's term) pre-scientific investigations by Native Americans of the paleontological resources of the North American continent. In this book, Mayor combines extensive library research with interviews with historians and paleontologists to reveal the depth of indigenous knowledge of dinosaurs and extinct megafauna they encountered, long before they encountered Euroamerican settlers. \n\nMost of the book is organized by region. Chapters are dedicated to northeastern US and southeastern Canada, New Spain of Mexico and related areas in the southern US, the American southwest, the central prairies, and the high plains. An introduction sets the stage for these chapters, itself a tale about the archaeological and paleontological site called Big Bone Lick in Kentucky, investigated in the 18th century by members of the western Enlightenment such as George Gaylord Simpson and Thomas Jefferson; and long before that by Iroquois and Wyandot and their ancestors.\n\n...\n\nFossil Legends is interesting, both for its detailed descriptions of the legends and investigations of paleontological data by Native American people, but also for the visible struggles of a scientist trying to reconcile one of the bigger problems of our society.\n\nsource: http://archaeology.about.com/od/indigenouspeoples/fr/mayor.htm\n\n-_-","torrent":{"xt":"urn:btih:cf2c9d6b312975581c09acefc3a5555bfcb0d956","amp;dn":"Adrienne+Mayor+-+Fossil+Legends+of+the+First+Americans.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf2c9d6b312975581c09acefc3a5555bfcb0d956","infoHashBuffer":{"type":"Buffer","data":[207,44,157,107,49,41,117,88,28,9,172,239,195,165,85,91,252,176,217,86]},"announce":[],"urlList":[]}}