{"title":"Red Square Black(1994)_[320] - Square_ep","uid":5705052,"size":53781597,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:cf692cecd9d6a089b137a7e773796727086dd3b6&amp;dn=Red+Square+Black%281994%29_%5B320%5D+-+Square_ep&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":7,"time":1279661106,"description":"Red Square Black was a band formed by Mark Binder of Los Angeles. The band was an innovative force in the early 1990s playing the LA club scene. They melded metal, industrial sequencing and pop sensibilities. Unlike other bands who have followed this blueprint using a DAT w/ a click track, RSB employed a Macintosh cpu onstage, controlled by the drummer with a KAT pad, the Mac handled all sequencing, including a custom light show! All songs were written and composed by Binder and performed by Red Square Black. After several drummers and a band shake-up, a stready lineup was picked up by BMG label Zoo Entertainment, and rehearsals started for a tour. Binder teamed up with future Marilyn Manson / Rob Zombie guitar player John Lowery (John 5) to replace Paul Noble who originally handled guitar duties, while adding the professional chops of former Ozzy Osbourne drummer Randy Castillo and rounding out the band with the multi-talented Angelo. New songs formed and the EP &quot;Square&quot; was released by Zoo Entertainment on October 11, 1994. After a short tour, the band split up. - Wikipedia","torrent":{"xt":"urn:btih:cf692cecd9d6a089b137a7e773796727086dd3b6","amp;dn":"Red+Square+Black%281994%29_%5B320%5D+-+Square_ep","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf692cecd9d6a089b137a7e773796727086dd3b6","infoHashBuffer":{"type":"Buffer","data":[207,105,44,236,217,214,160,137,177,55,167,231,115,121,103,39,8,109,211,182]},"announce":[],"urlList":[]}}