{"title":"Forensic Recovery of Human Remains: Archaeological Approaches","uid":4633690,"size":4917943,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0a09f74c95ff779daf7edeb0831138c6315e0f3&amp;dn=Forensic+Recovery+of+Human+Remains%3A+Archaeological+Approaches&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1231480863,"description":"Forensic Recovery of Human Remains: Archaeological Approaches\n\n\n&quot;An essential reference for both forensic experts and non-experts alike, Forensic Recovery of Human Remains: Archaeological Approaches is a comprehensive guide that focuses on the practical aspects of excavating and recovering human remains, along with any associated evidence, from crime scenes. It highlights the protocols and techniques that are used to successfully survey, map, recover, document, collect, and transport such items from these locations.\n\nTopics include identifying the difference between forensic archaeology and anthropology; employing the correct equipment when conducting searches, recoveries, and excavations; leveraging geophysical technologies used in forensic searches; collecting botanical and entomological evidence; mapping and documenting scenes; and classifying human and nonhuman skeletal remains.\n\nThe authors present this information in a thorough yet straightforward manner for those who are experienced in the field of forensic recovery and for those who may not yet be as seasoned. In either situation, if you want to be confident that you have uncovered and carefully processed every bit of potential evidence at the scene, then Forensic Recovery of Human Remains: Archaeological Approaches is the one reference to have with you every time.&quot;\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:d0a09f74c95ff779daf7edeb0831138c6315e0f3","amp;dn":"Forensic+Recovery+of+Human+Remains%3A+Archaeological+Approaches","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0a09f74c95ff779daf7edeb0831138c6315e0f3","infoHashBuffer":{"type":"Buffer","data":[208,160,159,116,201,95,247,121,218,247,237,235,8,49,19,140,99,21,224,243]},"announce":[],"urlList":[]}}