{"title":"83 Minutes - (Michael Jackson) (2016).epub Gooner","uid":15068258,"size":922883,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0c3c7bc6469fb9b33974bb1291a4bb891cc7796&amp;dn=83+Minutes+-+%28Michael+Jackson%29+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1466792920,"description":"83 Minutes - The Doctor, the Damage and the Shocking Death of Michael Jackson (2016).epub Gooner\r\n\r\nPublisher: Thomas Dunne Books (21 Jun. 2016)\r\nLanguage: English\r\nISBN-10: 1250108926\r\nISBN-13: 978-1250108920\r\n\r\nA definitive look at Michael Jackson's final minutes, revealing for the first time the shocking details behind the tragic death of one of the world's biggest pop stars.\r\n\r\nOn June 25th, 2009, the world was rocked by the tragic news that Michael Jackson the biggest and most influential music icon since Elvis Presley had died. He was only 50 years old when paramedics pronounced him dead on arrival at a Los Angeles hospital. For weeks after his death, speculation and rumor abounded concerning the drugs in Jackson s system and the role Conrad Murray, the singer's personal physician, had played in the his death. In 2011, Murray was tried and convicted of involuntary manslaughter, for which he served two years in prison.\r\n\r\nNow, for the first time, readers have access to a comprehensive and truly horrifying account of the crucial moments leading up to Jackson's demise. Drawing on court documents and testimonials, &quot;83 Minutes&quot; presents a multi-perspective tracking of every individual involved and the part they played as the tragedy unfolded, examining forensically the mystery of the 83 minutes that elapsed from the moment Dr. Murray suggested he found Jackson not breathing to the moment the singers' lifeless body was wheeled into hospital.\r\n\r\nEvenhanded and unbiased, Matt Richards and Mark Langthorne's account is rich with detail, including the specific cocktail of drugs employed in an attempt to keep Jackson alive and the harrowing conditions in which the troubled genius's life ended. Included as well is the story of the legal struggle for control of Jackson's assets that followed his death where Richards and Langthorne report that the combined earnings of Jay Z, Taylor Swift, and Kanye West since Michael Jackson died come nowhere near the revenues Jackson has earned for his estate after his death.\r\n\r\nWritten with documentary flair, this powerful and compelling book is already emerging as the definitive account of one of the darkest hours in music history.&quot;","torrent":{"xt":"urn:btih:d0c3c7bc6469fb9b33974bb1291a4bb891cc7796","amp;dn":"83+Minutes+-+%28Michael+Jackson%29+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0c3c7bc6469fb9b33974bb1291a4bb891cc7796","infoHashBuffer":{"type":"Buffer","data":[208,195,199,188,100,105,251,155,51,151,75,177,41,26,75,184,145,204,119,150]},"announce":[],"urlList":[]}}