{"title":"Molecularly Imprinted Catalysts - Principles, Syntheses, and App","uid":14714458,"size":16177761,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4663edeb8439d0a9081826b893c03cf6731e7bf&amp;dn=Molecularly+Imprinted+Catalysts+-+Principles%2C+Syntheses%2C+and+App&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1464448585,"description":"Molecularly Imprinted Catalysts - Principles, Syntheses, and Applications - Songjun Li et al. (Elsevier, 2016).pdf\r\n\r\nISBN 978-0-12-801301-4\r\n\r\nMolecularly Imprinted Catalysts: Principle, Synthesis, and Applications is the first book of its kind to provide an in-depth overview of molecularly imprinted catalysts and selective catalysis, including technical details, principles of selective catalysis, preparation processes, the catalytically active polymers themselves, and important progress made in this field. It serves as an important reference for scientists, students, and researchers who are working in the areas of molecular imprinting, catalysis, molecular recognition, materials science, biotechnology, and nanotechnology.\r\nComprising a diverse group of experts from prestigious universities and industries across the world, the contributors to this book provide access to the latest knowledge and eye-catching achievements in the field, and an understanding of what progress has been made and to what extent it is being advanced in industry.\r\n\r\nThe first book in the field on molecularly imprinted catalysts (MIPs)\r\nProvides a systematic background to selective catalysis, especially the basic concepts and key principles of the different MIP-based catalysts\r\nFeatures state-of-the art presentation of preparation methods and applications of MIPs\r\nWritten by scientists from prestigious universities and industries across the world, and edited by veteran researchers in molecular imprinting and selective catalysis","torrent":{"xt":"urn:btih:d4663edeb8439d0a9081826b893c03cf6731e7bf","amp;dn":"Molecularly+Imprinted+Catalysts+-+Principles%2C+Syntheses%2C+and+App","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4663edeb8439d0a9081826b893c03cf6731e7bf","infoHashBuffer":{"type":"Buffer","data":[212,102,62,222,184,67,157,10,144,129,130,107,137,60,3,207,103,49,231,191]},"announce":[],"urlList":[]}}