{"title":"Exploring Happiness: From Aristotle to Brain Science","uid":9661787,"size":328822,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d47b525d11e4a17205367f46cb5b11b5866e107e&amp;dn=Exploring+Happiness%3A+From+Aristotle+to+Brain+Science&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1393295814,"description":"\nBy: Sissela Bok\n\nIn this smart and timely book, the distinguished moral philosopher Sissela Bok ponders the nature of happiness and its place in philosophical thinking and writing throughout the ages. With nuance and elegance, Bok explores notions of happiness - from Greek philosophers to Desmond Tutu, Charles Darwin, Iris Murdoch, and the Dalai Lama - as well as the latest theories advanced by psychologists, economists, geneticists, and neuroscientists. \n\nEschewing abstract theorizing, Bok weaves in a wealth of firsthand observations about happiness from ordinary people as well as renowned figures. This may well be the most complete picture of happiness yet. This book is also a clarion call to think clearly and sensitively about happiness. \n\nBringing together very different disciplines provides Bok with a unique opportunity to consider the role of happiness in wider questions of how we should lead our lives and treat one another - concerns that don't often figure in today's happiness equation. How should we pursue, weigh, value, or limit our own happiness, or that of others, now and in the future? Compelling and perceptive, Exploring Happiness shines a welcome new light on the heart of the human condition.\n\nGenre: Non-Fiction | Philosophy / Psychology","torrent":{"xt":"urn:btih:d47b525d11e4a17205367f46cb5b11b5866e107e","amp;dn":"Exploring+Happiness%3A+From+Aristotle+to+Brain+Science","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d47b525d11e4a17205367f46cb5b11b5866e107e","infoHashBuffer":{"type":"Buffer","data":[212,123,82,93,17,228,161,114,5,54,127,70,203,91,17,181,134,110,16,126]},"announce":[],"urlList":[]}}