{"title":"The Fall Of Metropolis (Complete) (No ads)","uid":7826528,"size":78877689,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d491e7047cbc48fb4fc73b363b3f2026fb952ffe&amp;dn=The+Fall+Of+Metropolis+%28Complete%29+%28No+ads%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SplhcbPrime","files":-1,"time":1352941257,"description":"The Battle for Metropolis was actually a four-part prologue to the main story, The Fall Of Metropolis, which brought to a close several key subplots, including the truth behind the clone plague and Lex's plot to destroy Lois Lane's credibility. All of this culminated in the double-sized Action Comics 700 which serves as a keystone to both storylines. The story is significant in that it builds up to the point where Lex Luthor's villainous handiwork becomes public knowledge, as well as the fact that he is actually a clone. The story also includes the deaths of Paul Westfield, Director of Project Cadmus, and Sydney Happersen, Lex's number one henchman. \n\nA mysterious plague has hit the Metropolis area and seems to be affecting only clones. Most of the clones from the Project Cadmus facility, including Superboy and the Newsboy Legion, fall deathly ill. Moreover, Lex Luthor has likewise been stricken by the plague, and the virus causes his body to breakdown and age prematurely. Luthor publicly accuses Project Cadmus of making an attempt upon his life and declares open war upon them.\n\nThe Fall of Metropolis was a five-part storyline that ran through alternating Superman titles in the summer of 1994. \n\nLois Lane presents a videotape and a map to Perry White and Franklin Stern, proving that Lex Luthor has been involved in a wide array of criminal activity including attempted mass murder. She also has evidence proving that the current Lex Luthor is actually the original Lex Luthor in a clone body and not the son of Lex Luthor as the public believes.\n\nAt Mount Curtiss, Superboy and Superman emerge from the ruins of Project Cadmus. A handful of Team Luthor soldiers survive as well, but Luthor condemns their failure to procure a cure to the clone plague and cuts them off. Superman and Superboy fight the Lex-Men, and Supergirl arrives and helps them finish them off. Superman grabs a helmet from one of the soldiers and takes it to Professor Hamilton who attempts to use the helmet's communication system to track down Lex Luthor.\n\nThis torrent was created to honor a request.\n\nNOTE:  These are not my scans.  All praise and glory to the original scanners (and authors/artists/publishers,) please.\n\nEnjoy, and please seed.\n","torrent":{"xt":"urn:btih:d491e7047cbc48fb4fc73b363b3f2026fb952ffe","amp;dn":"The+Fall+Of+Metropolis+%28Complete%29+%28No+ads%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d491e7047cbc48fb4fc73b363b3f2026fb952ffe","infoHashBuffer":{"type":"Buffer","data":[212,145,231,4,124,188,72,251,79,199,59,54,59,63,32,38,251,149,47,254]},"announce":[],"urlList":[]}}