{"title":"Enter the Gungeon Multi 10 repack Mr DJ","uid":14191710,"size":188234122,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d58bf61775839b9e2f93391c190a842f13113d94&amp;dn=Enter+the+Gungeon+Multi+10+repack+Mr+DJ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rock840","files":5,"time":1459893565,"description":"Title: Enter the Gungeon Multi 10\r\nGenre: Action, Adventure, Indie\r\nDeveloper: Dodge Roll\r\nPublisher: Devolver Digital\t\r\nRelease Date: 5 Apr, 2016\r\nCrack based on : ALI213\r\nOperating Windows: Windows 7 / 8 / 8.1 / 10\r\nLanguages present: English , French , Italian , German , Spanish , Japanese , Korean , Polish , Portuguese-Brazil , Russian\r\n\r\nAbout This Game\r\n\r\nEnter the Gungeon is a bullet hell dungeon crawler following a band of misfits seeking to shoot, loot, dodge roll and table-flip their way to personal absolution by reaching the legendary Gungeon’s ultimate treasure: the gun that can kill the past. Select a hero [or team up in co-op] and battle your way to the bottom of the Gungeon by surviving a challenging and evolving series of floors filled with the dangerously adorable Gundead and fearsome Gungeon bosses armed to the teeth. Gather precious loot, discover hidden secrets, and chat with opportunistic merchants and shopkeepers to purchase powerful items to gain an edge.\r\n\r\nThe Gungeon: Enter the Gungeon – a constantly evolving bullet hell fortress that elegantly blends meticulously hand-designed rooms within a procedurally-generated labyrinth bent on destroying all that enter its walls. But beware – the Gungeon responds to even the most modest victory against its sentries and traps by raising the stakes and the challenges found within!\r\n\r\nThe Cult of the Gundead: The Gungeon isn’t just traps and chasms – calm your nerves and steady your aim as you face down the gun-totting Cult of the Gundead. These disciples of the gun will stop at nothing to put down the heroes in their tracks and employ any tactics necessary to defend their temple.\r\n\r\nThe Gungeoneers: Choose between one of several unlikely heroes, each burdened by a deep regret and in search of a way to change their past, no matter the cost. Filled with equal parts courage and desperation, these adventurers won’t hesitate to dive across flaming walls, roll through a wall of bullets, or take cover behind whatever is around to make it to their goal alive!\r\n\r\nThe Guns: Discover and unlock scores of uniquely fantastic guns to annihilate all that oppose you in the Gungeon – each carrying their own unique tactics and ammunition. Unleash everything from the tried and true medley of missiles, lasers, and cannonballs to the bizarrely effective volley of rainbows, fish, foam darts, and bees! Yep, bees.\r\n\r\n**INSTALL INSTRUCTIONS:\r\n\r\nOpen 'Enter the Gungeon.exe' , wait for a bit for the self extractor to open, specify the directory where u want to extract the game folder, open the extracted folder and play.....\r\nOR\r\nExtarct it yourself using 'WinRAR'\r\n\r\nAlways open the game using run as administrator\r\n\r\nCheck my FB page for more :\r\nMr DJ repacks","torrent":{"xt":"urn:btih:d58bf61775839b9e2f93391c190a842f13113d94","amp;dn":"Enter+the+Gungeon+Multi+10+repack+Mr+DJ","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d58bf61775839b9e2f93391c190a842f13113d94","infoHashBuffer":{"type":"Buffer","data":[213,139,246,23,117,131,155,158,47,147,57,28,25,10,132,47,19,17,61,148]},"announce":[],"urlList":[]}}