{"title":"The Lord Of The Rings.War In The North.v 1.0.0.1","uid":10848606,"size":3010923022,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d68399e42441330819957b63052054430582c128&amp;dn=The+Lord+Of+The+Rings.War+In+The+North.v+1.0.0.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dougstamper","files":-1,"time":1408754764,"description":"The Lord of the Rings : War in the North - a cooperative combat role playing game immersing you and your friends in a brutal new chapter of War of the Ring. Company Snowblind Studios, drawing inspiration from the world of Middle-earth from the books and films, created a game that allows players to bloodying his ax in a variety of different enemies and go as the known, and to have never seen locations. As a result, the journey will be familiar and comfortable, but at the same time full of surprises.\nAdditional. Information :\n* Role play, full of action - The intense, relentless and pleasurable battle. Rich, layered, and effective leveling. Find and collect the best items Suck your hero using a variety of skills and items, and enjoy the intense battles in real time, shoulder to shoulder with friends. Make your way through the brutal realities of the war on all fronts. Immerse yourself in the atmosphere of the military and leave their mark in the history of Middle-earth.\n* Co-op as it is - Create your brotherhood of three heroes and challenge the growing army of the North. The fate of Middle-earth and your group as a whole needs to heroes with unique skills to work in a cohesive team. You must fight together, otherwise you die alone, and this high rate makes joint social game interesting and incredibly rich. When you first save a friend, a troll and grasped desperately pleading for help, you will understand what we had in mind.\n* The Untold Story - While much attention was paid to the localities, as long zipped ring, the attack on the Middle touched all corners of the map. War in the North turns our attention to an integral part of the story, which is based on the details of the book and its various applications. This is not someone out there battle. This is - your own fight your way through the dark, dangerous and unexplored world, protecting everything for which you are fighting. This is your war.\n\nSystem requirements :\nOperating system: XP, Vista, 7 Processor: Core 2 Duo - 2,4 or Athlon X2 5000  Core 2 Duo - 3,0 GHz or Phenom X4 9600 RAM: 2048 MB  4096 MB Free hard disk space: 7236 MB Graphics card: GeForce 8600 or Radeon HD 2600 File System: FAT, NTFS\n\n\nBy Doug Stamper.\n","torrent":{"xt":"urn:btih:d68399e42441330819957b63052054430582c128","amp;dn":"The+Lord+Of+The+Rings.War+In+The+North.v+1.0.0.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d68399e42441330819957b63052054430582c128","infoHashBuffer":{"type":"Buffer","data":[214,131,153,228,36,65,51,8,25,149,123,99,5,32,84,67,5,130,193,40]},"announce":[],"urlList":[]}}