{"title":"Whisper of Souls by Michelle Zink","uid":9618012,"size":190438,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d735778f09e0459574fec0174043144ae9d2dbe2&amp;dn=Whisper+of+Souls+by+Michelle+Zink&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"PirateBook","files":1,"time":1392445197,"description":"\nBefore Prophecy of the Sisters, before Alice and Lia became pawns in the curse that turned sister against sister, the burden of the prophecy belonged to their mother, Adelaide. This is her story.\n\nAdelaide Milthorpe is losing her grip on sanity. She is a Gate-a human portal to the Otherworlds, destined to bring forth Samael, the most powerful demon of all time, and his Lost Souls. Prowling the halls of Birchwood Manor, Adelaide is haunted by the whispers of the otherworldly Souls, who seek to use her for entry into the real world, where they would wreak havoc and rule beside their leader, Samael, in chaos. \n\nTheir pleas plague her, torture her, tempt her. Samael calls to her, his promise of peace in the Otherworlds increasingly difficult to resist. And the stakes are high, for if Adelaide gives in to his urgings, her two daughters will inherit the same curse, forcing them to make the same impossible choice as they, too, are cast in the roles of Guardian and Gate.\n\nIn this novella that delves further into the Prophecy, Adelaide's struggle to reconcile her two worlds as she descends into madness will captivate fans of the Prophecy of the Sisters series and new readers alike.\n\nGenre: Fantasy","torrent":{"xt":"urn:btih:d735778f09e0459574fec0174043144ae9d2dbe2","amp;dn":"Whisper+of+Souls+by+Michelle+Zink","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d735778f09e0459574fec0174043144ae9d2dbe2","infoHashBuffer":{"type":"Buffer","data":[215,53,119,143,9,224,69,149,116,254,192,23,64,67,20,74,233,210,219,226]},"announce":[],"urlList":[]}}