{"title":"Killing Joke - 3 Recent CDs","uid":4539487,"size":1556286681,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d84a3ed2e95a8fde09065a6d9d7eb553c597c229&amp;dn=Killing+Joke+-+3+Recent+CDs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sradams777","files":54,"time":1227886695,"description":"&quot;As a teenager when I started this group, we sat around and we said: 'What do we want to achieve out of all this?'&quot; Jaz Coleman. &quot;The answer to the question was that we wanted to inspire other people,&quot; he says. &quot;We had this idea that Killing Joke is a mirror, and what you see in us, you can do too; that the stage is the audience and the audience is the stage.&quot; If the growing army of acts who have taken inspiration from Killing Joke is anything to go by, then Coleman has achieved his goal. The British band's influence on groups such as Nirvana, Metallica, Nine Inch Nails and Ministry has been well documented. A generation of death metal bands - such as Fear Factory who have just recorded a new version of Millennium - have paid homage to Killing Joke. But so too has Kate Bush, who has long been a fan of the group and whose most famous single, Hounds of Love, featured Killing Joke's original bass player, Youth. 2005 saw Killing Joke pick up the &quot;Lifetime Achievement&quot; award at the Kerrang! Awards, firmly cementing their place in rock history. They were presented this award by Dave Grohl who himself is a huge fan of the band and even played drums on their last album. Coleman describes Hosannas From The Basement Of Hell, as being &quot;brutal&quot; and &quot;more tribal&quot; than the last album. &quot;The unthinkable and the unimaginable... I think there's an eco-meltdown on the cards. That's certainly in there. Killing Joke continues to span the generations, with old and new fans alike.\n\nTorrent Includes:\n\nKilling Joke (2003) NMR\nHosannas From The Basements Of Hell (2007) NMR\nXXV Gathering! (Let Us Prey) Live CD (2005) NMR","torrent":{"xt":"urn:btih:d84a3ed2e95a8fde09065a6d9d7eb553c597c229","amp;dn":"Killing+Joke+-+3+Recent+CDs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d84a3ed2e95a8fde09065a6d9d7eb553c597c229","infoHashBuffer":{"type":"Buffer","data":[216,74,62,210,233,90,143,222,9,6,90,109,157,126,181,83,197,151,194,41]},"announce":[],"urlList":[]}}