{"title":"The Radical Assault on Truth in American Law | Daniel Farber","uid":10624858,"size":10527671,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8ee264fd6ba55b96143e8200b4b433241d72c38&amp;dn=The+Radical+Assault+on+Truth+in+American+Law+%7C+Daniel+Farber&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bondoed","files":-1,"time":1406210010,"description":"Beyond All Reason - The Radical Assault on Truth in American Law (1997) by Daniel A. Farber &amp; Suzanna Sherry.pdf\n\nWould you want to be operated on by a surgeon trained at a medical school that did not evaluate its students? Would you want to fly in a plane designed by people convinced that the laws of physics are socially constructed? Would you want to be tried by a legal system indifferent to the distinction between fact and fiction? These questions may seem absurd, but these are theories being seriously advanced by radical multiculturalists that force us to ask them. These scholars assert that such concepts as truth and merit are inextricably racist and sexist, that reason and objectivity are merely sophisticated masks for ideological bias, and that reality itself is nothing more than a socially constructed mechanism for preserving the power of the ruling elite.\n\nIn Beyond All Reason, liberal legal scholars Daniel A. Farber and Suzanna Sherry mount the first systematic critique of radical multiculturalism as a form of legal scholarship. Beginning with an incisive overview of the origins and basic tenets of radical multiculturalism, the authors critically examine the work of Derrick Bell, Catherine MacKinnon, Patricia Williams, and Richard Delgado, and explore the alarming implications of their theories. Farber and Sherry push these theories to their logical conclusions and show that radical multiculturalism is destructive of the very goals it wishes to affirm. If, for example, the concept of advancement based on merit is fraudulent, as the multiculturalists claim, the disproportionate success of Jews and Asians in our culture becomes difficult to explain without opening the door to age-old anti-Semitic and racist stereotypes. If historical and scientific truths are entirely relative social constructs, then Holocaust denial becomes merely a matter of perspective, and Creationism has as much &quot;validity&quot; as evolution. The authors go on to show that rather than promoting more dialogue, the radical multiculturalist preferences for legal storytelling and identity politics over reasoned argument produces an insular set of positions that resist open debate. Indeed, radical multiculturalists cannot critically examine each others' ideas without incurring vehement accusations of racism and sexism, much less engage in fruitful discussion with a mainstream that does not share their assumptions. Here again, Farber and Sherry show that the end result of such thinking is not freedom but a kind of totalitarianism where dissent cannot be tolerated and only the naked will to power remains to settle differences.\n\nSharply written and brilliantly argued, this book is itself a model of the kind of clarity, civility, and dispassionate critical thinking which the authors seek to preserve from the attacks of the radical multiculturalists. With far-reaching implications for such issues as government control of hate speech and pornography, affirmative action, legal reform, and the fate of all minorities, Beyond All Reason is a provocative contribution to one of the most important controversies of our time.\n\n208 pages\nPublisher: Oxford University Press; 1 edition (October 30, 1997)\nLanguage: English\nISBN-10: 0195107179\nISBN-13: 978-0195107173","torrent":{"xt":"urn:btih:d8ee264fd6ba55b96143e8200b4b433241d72c38","amp;dn":"The+Radical+Assault+on+Truth+in+American+Law+%7C+Daniel+Farber","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8ee264fd6ba55b96143e8200b4b433241d72c38","infoHashBuffer":{"type":"Buffer","data":[216,238,38,79,214,186,85,185,97,67,232,32,11,75,67,50,65,215,44,56]},"announce":[],"urlList":[]}}