{"title":"How Racism Takes Place [blackatk]","uid":8788315,"size":1934754,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d92a46d8cb36a377e59c4b087dc445aa6bc8a23a&amp;dn=How+Racism+Takes+Place+%5Bblackatk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1375836875,"description":"White identity in the United States is place bound, asserts George Lipsitz in How Racism Takes Place. An influential scholar in American and racial studies, Lipsitz contends that racism persists because a network of practices skew opportunities and life chances along racial lines. That is, these practices assign people of different races to different spaces and therefore allow grossly unequal access to education, employment, transportation, and shelter. Revealing how seemingly race-neutral urban sites contain hidden racial assumptions and imperatives, Lipsitz examines the ways in which urban space and social experience are racialized and emphasizes that aggrieved communities do not passively acquiesce to racism. He recognizes the people and communities that have re-imagined segregated spaces in expressive culture as places for congregation. How Racism Takes Place not only exposes the degree to which this white spatial imagining structures our society but also celebrates the black artists and activists who struggle to create a just and decent society.\n\n\n\nPaperback: 320 pages\nPublisher: Temple University Press (March 11, 2011)\nLanguage: English\nISBN-10: 1439902569\nISBN-13: 978-1439902561\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Racism-Takes-Place-George-Lipsitz/dp/1439902569/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Racism-Takes-Place-George-Lipsitz/dp/1439902569/&lt;/a&gt;\n\n\n\n\n\nTags: blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, experimentation, tuskeegee, unconscious, subconscious, ","torrent":{"xt":"urn:btih:d92a46d8cb36a377e59c4b087dc445aa6bc8a23a","amp;dn":"How+Racism+Takes+Place+%5Bblackatk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d92a46d8cb36a377e59c4b087dc445aa6bc8a23a","infoHashBuffer":{"type":"Buffer","data":[217,42,70,216,203,54,163,119,229,156,75,8,125,196,69,170,107,200,162,58]},"announce":[],"urlList":[]}}