{"title":"Archaeology- An Introduction,5th Edition{BBS}","uid":6785632,"size":15676006,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d92abf3f624a38bbf73ac582017ff9d7f53d6702&amp;dn=Archaeology-+An+Introduction%2C5th+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1320077600,"description":"Archaeology: An Introduction looks behind the popular aspects of archaeology such as the discovery and excavation of sites, the study of human remains and animal bones, radiocarbon dating, museums and 'heritage' displays, and reveals the methods used by archaeologists. It also explains how the subject emerged from an amateur pursuit in the eighteenth century into a serious discipline, and explores changing fashions in interpretation in recent decades.\n\nThis fifth edition has been updated by a new co-author, Tom Moore, and continues to include key references and guidance to help new readers find their way through the ever expanding range of archaeological publications. It conveys the excitement of new archaeological discoveries that appear on television or in newspapers while helping readers to evaluate them by explaining the methods and theories that lie behind them. Above all, while serving as a lucid textbook, it remains a very accessible account that will interest a wide readership. In addition to drawing upon examples and case studies from many regions of the world and periods of the past, it incorporates the authors' own fieldwork, research and teaching and features a new four-colour text design and colour illustrations plus an additional 50 topic boxes.\n\nThe comprehensive glossary and bibliography are complemented by a support website hosted by Routledge to assist further study and wider learning. It includes chapter overviews, a testbank of questions, powerpoint discussion questions, web-links to support material for every chapter plus an online glossary and image bank. \n\n New to the fifth edition:\n\n    * inclusion of the latest survey techniques\n    * updated material on the development in dating, DNA analysis, isotopes and population movement\n    * coverage of new themes such as identity and personhood\n    * how different societies are defined from an anthropological point of view and the implications of this for archaeological interpretation\n    * the impact of climate change and sustainability on heritage management\n    * more on the history of archaeology\n\nVisit the companion website at www.routledge.com/textbooks/greene for additional resources, including:\n\n    * chapter overviews\n    * a testbank of questions\n    * PowerPoint discussion questions\n    * links to support material for every chapter\n\n\n\n# Paperback: 416 pages\n# Publisher: Routledge; 5 edition (July 10, 2010)\n# Language: English\n# ISBN-10: 041549639X\n# ISBN-13: 978-0415496391","torrent":{"xt":"urn:btih:d92abf3f624a38bbf73ac582017ff9d7f53d6702","amp;dn":"Archaeology-+An+Introduction%2C5th+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d92abf3f624a38bbf73ac582017ff9d7f53d6702","infoHashBuffer":{"type":"Buffer","data":[217,42,191,63,98,74,56,187,247,58,197,130,1,127,249,215,245,61,103,2]},"announce":[],"urlList":[]}}