{"title":"SED-PDS-Grunen &amp; DKP-Criminal organizations?(2007)","uid":4747870,"size":3010123,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d94c8fdefb9c3ac235cd1e86d2f8a0c6d2bbfb1e&amp;dn=SED-PDS-Grunen+%26+DKP-Criminal+organizations%3F%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"red_gonzo","files":1,"time":1235989018,"description":"For english-only speaking:\nThis book is in german language. English title would be: SED (Socialistic unity party of Germany) / PDS (Party of democratic socialism) - The Green and DKP (German communist party) - Criminal organisations? (2007). Stasi agents, terrorists, documents fakery, criminal behaviour, assistance to murder... In this unique book you'll see the real face behind leftist political parties in Germany. Hiding behind cover of humanism are people with criminal backgrounds. Case after case you'll see how politics helps to build terrorist network (aka RAF) that terrorize the population, steals billions of DM and takes them to foreign countries, murdering political opponents and much more. Almost 100 politicians are analysed and exposed. 100 pages.\n\nFur Deutschsprachige:\nStasi-Agenten, Terroristen, UrkundenfÃƒÂ¤lschung, Aufruf zur Straftat, Beihilfe zum Mord ... In diesem Buch werden die StraftÃƒÂ¤ter aus PDS (Partei des Demokratischen Sozialismus) / SED (Sozialistische Einheitspartei Deutschlands), GrÃƒÂ¼ne und DKP (Deutsche Kommunistische Partei) aufgefÃƒÂ¼hrt. Unter dem Deckmantel des Humanismus offenbahrt sich der reale Hintergrund dieser Organisationen, die pausenlos gegen VAWS ins Gefecht ziehen. Die PDS erfreut sich immer mehr Beliebtheit bei den WÃƒÂ¤hlern, was die Landtagswahlen in Brandenburg und Sachsen dokumentiert haben. Sie ist eine Macht im Staat geworden. Aber was steckt wirklich hinter der PDS? Als sich die SED in PDS umbenannt hatte, wusste noch niemand, welche EnthÃƒÂ¼llungen ihr ÃƒÂ¼ber den Ã‚Â»real existierenden SozialismusÃ‚Â« noch bevor standen und wahrscheinlich auch in naher Zukunft bevorstehen werden. Mit diesem Buch legt VAWS eine kleine UnterstÃƒÂ¼tzung in der auseinanderstezung gegen die PDS und andere Genossen vor. Hinrichtungen in Leipzig: Vielen Menschen ist die Tatsache unbekannt, dass noch bis in die 80er Jahre im SED-Staat Menschen hingerichtet wurden. Also in einer Zeit, in der die PDS-FÃƒÂ¼hrer Gysi, Bisky und Luft das SED-Parteibuch schon in der Tasche hatten. Die Hingerichteten waren nicht nur Schwerverbrecher, sondern auch RepublikflÃƒÂ¼chtige oder sogenannte NS-Verbrecher. Milliarden-Verschiebung: Es ist schon ÃƒÂ¤uÃƒÅ¸erst merkwÃƒÂ¼rdig, wenn eine angeblich antikapitalistische Partei wie die PDS, bzw. SED/PDS nach feinster kapitalistischer Unart jene Milliarden Mark ins Ausland schafft oder anderweitig der eigenen BevÃƒÂ¶lkerung vorenthÃƒÂ¤lt, welche zuvor vom SED-Staat den Menschen abgenommen wurden. Stasi in der PDS und den Parlamenten: Dass es in der PDS zahlreiche Ã‚Â»IMÃ‚Â« der Stasi gibt, ist spÃƒÂ¤testens seit den letzten Landtagswahlen nicht unbekannt. Auch wenn der Eindruck entsteht, die PDS mache Kritiker juristisch mundtod, so finden sich in diesem Buch zahlreiche PDS-FunktionÃƒÂ¤re und Abgeordnete wieder, welche in der DDR fÃƒÂ¼r die Stasi gearbeitet haben. Die DKP als Terrornetz der Stasi? Nein, dies ist kein Kriminalroman, sondern bittere RealitÃƒÂ¤t: Die Stasi des SED-Staates hat DKP-Mitglieder fÃƒÂ¼r TerroranschlÃƒÂ¤ge ausgebildet. FlugaffÃƒÂ¤ren oder RAFler als Kandidaten bie den GrÃƒÂ¼nen, Anstiftung zum Todschlag, Korruption und Amtsmissbrauch, BrieffÃƒÂ¤lschung, illegaler Waffenbesitz und Sabotage, Aufruf zu Straftaten, Mord, Aufforderung zu gefÃƒÂ¤hrlicher KÃƒÂ¶rperverletzung, Hausfriedensbruch, Widerstand gegen die Staatsgewalt, sexueller Missbrauch, fragwÃƒÂ¼rdige Wahlkampffinanzierung, NÃƒÂ¶tigung und SachbeschÃƒÂ¤digung usw. Die Liste der Vergehen ist lang! Viele haben etwas gemeinsam: Ihre Karriere begann in kommunistischen Parteien. Andere wandern von den GrÃƒÂ¼nen zur PDS, oder es gibt gemeinsame Kandidaturen von PDS und DKP. Cca. 100 FÃƒÂ¤lle! 100 Seiten.\n","torrent":{"xt":"urn:btih:d94c8fdefb9c3ac235cd1e86d2f8a0c6d2bbfb1e","amp;dn":"SED-PDS-Grunen+%26+DKP-Criminal+organizations%3F%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d94c8fdefb9c3ac235cd1e86d2f8a0c6d2bbfb1e","infoHashBuffer":{"type":"Buffer","data":[217,76,143,222,251,156,58,194,53,205,30,134,210,248,160,198,210,187,251,30]},"announce":[],"urlList":[]}}