{"title":"Suzanne Vega - Tom's Diner [DNA remix promo].VOB","uid":12545376,"size":261140480,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:db673a170cbf90d4cd4fe70c4e2bccc4b6924589&amp;dn=Suzanne+Vega+-+Tom%27s+Diner+%5BDNA+remix+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":1,"time":1444463970,"description":"Suzanne Vega - Tom's Diner [DNA remix promo].VOB\r\n\r\n\r\nHQ music video from a promo DVD. &quot;Tom's Diner&quot; is a song written in 1981 by American recording artist Suzanne Vega. It was first released as a track on the January 1984 issue of Fast Folk Musical Magazine. When first featured on one of her own studio albums, it appeared as the first track of her Solitude Standing album in 1987. It was later used as the basis for a remix by the British group DNA in 1990. The 1991 release Tom's Album includes the DNA version as well as cover versions by such artists as After One, Chicago-based band Canasta, and Bingo Hand Job (R.E.M. and Billy Bragg). It was also used as the background soundtrack for the opening scene of the 1993 film Untamed Heart.\r\n\r\nThe &quot;Tom's Diner&quot; of the song is Tom's Restaurant in New York City.\r\n\r\nThe song is written as a simple first person vignette of someone stopping at a diner for a cup of coffee. The song notes the newspaper as well as two women, one who enters the diner and one who stands outside in the rain. The ringing of bells at a nearby cathedral causes the singer to reminisce on an unnamed companion and a picnic previously. When the coffee is finished, it is time to leave the diner to catch a train.\r\n\r\nVega wrote the song based on a comment by her friend Brian Rose, a photographer, who mentioned that in his work, he sometimes felt as if &quot;he saw his whole life through a pane of glass, and [...] like he was the witness to a lot of things, but was never really involved in them.&quot; She attempted to think and write in this fashion (including a male perspective) while sitting at Tom's Restaurant, a diner on the corner of Broadway and 112th Street in New York City, which would later become famous as a location for some exterior scenes in the popular television sitcom Seinfeld. (The building belongs to Columbia University and houses some of its programs, as well as NASA's Goddard Institute for Space Studies.) The &quot;bells of the cathedral&quot; that she remarks hearing in the song are those of the Cathedral of Saint John the Divine, located one block to the east.\r\n\r\nThe DNA remix:\r\nIn 1990, two British record producers remixed &quot;Tom's Diner&quot;, grafting her vocals onto a dance beat from Soul II Soul and turning her simple ad-libbed outro - &quot;Da da da duh, doo da-doo doo&quot; - into the song's driving hook. Without permission from Vega, her record label, or publisher, the duo released the remix on a limited basis for distribution to clubs as &quot;Oh Suzanne&quot; by &quot;DNA featuring Suzanne Vega&quot;. Vega's record company of the time, A&amp;M, decided to buy and release the remix rather than take DNA to court for copyright infringement. A&amp;M struck the deal after consulting with Vega, who liked the interpretation, and DNA, who conducted the transaction through intermediaries without revealing their true identities. The remix became a much larger hit than Vega had with the song originally, peaking at #2 on the UK singles chart and #5 on the US Billboard Hot 100, and it became one of a handful of tracks to chart in the top 10 of both the Modern Rock Tracks (#7) and Billboard R&amp;B Tracks (#10) charts. A music video was also made of this version.\r\n\r\n\r\nSuzanne Nadine Vega (born July 11, 1959) is an American songwriter and singer known for her eclectic folk-inspired music.\r\n\r\nVega has released eight studio albums to date, the latest of which is Tales from the Realm of the Queen of Pentacles, released in 2014.\r\n\r\nVega's song &quot;Tom's Diner&quot; was used as the reference track in an early trial of the MP3 compression system, thus earning her the distinction of being named &quot;The Mother of the MP3&quot;. Because it is an a cappella vocal with relatively little reverberation, it was used as the model for Karlheinz Brandenburg's sound compression algorithm. Brandenburg heard &quot;Tom's Diner&quot; on a radio playing the song and was excited and at first convinced it would be &quot;nearly impossible to compress this warm a cappella voice.&quot;\r\n\r\n&quot;Tom's Diner&quot; takes place in Tom's Restaurant at 112th Street and Broadway in New York City. Exterior shots of the same restaurant appear in the television sitcom Seinfeld as Monk's, which is the eatery where Jerry, George, Elaine, and Kramer hang out. The DNA remix of the track was so popular that it inspired many cover versions, the best of which were eventually collected by Vega on an album titled Tom's Album. The remixed version of &quot;Tom's Diner&quot; was later sampled by hip hop artist Nikki D in her single &quot;Daddy's Little Girl&quot;. Rapper Tupac Shakur sampled the track in &quot;Dopefiend's Diner&quot;.\r\n*(video does not have any logos)*\r\n\r\n\r\n    \nhttp://en.wikipedia.org/wiki/Tom%27s_Diner \r\n      \nhttp://postimg.org/image/o2g7plh77/ \r\n   \r\n\r\n\r\nFile properties info using Media Player Classic:     \r\n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 6000kbps\r\n   Audio: LPCM 48000Hz stereo 2304kbps [DVD, 24 bits]\r\n   Audio: Dolby Digital AC3 48000Hz 6ch 448kbps\r\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps (commentary)\r\n   Duration: 00:03:50\r\n\r\n\r\n\r\n\r\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \r\nor for better visual and audio quality playback of all your videos. \r\nIt's 100% free to download and use. Latest stable build is v1.7.9\r\n\r\n*Media Player Classic Home Cinema*         \nhttp://mpc-hc.org/ \r\n\r\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:db673a170cbf90d4cd4fe70c4e2bccc4b6924589","amp;dn":"Suzanne+Vega+-+Tom%27s+Diner+%5BDNA+remix+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db673a170cbf90d4cd4fe70c4e2bccc4b6924589","infoHashBuffer":{"type":"Buffer","data":[219,103,58,23,12,191,144,212,205,79,231,12,78,43,204,196,182,146,69,137]},"announce":[],"urlList":[]}}