{"title":"Led Zeppelin 1975.02.12 - MSG, NYC - Flying Circus","uid":4142944,"size":1182322924,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:db83711dac950eafc916152b3347c1e637636942&amp;dn=Led+Zeppelin+1975.02.12+-+MSG%2C+NYC+-+Flying+Circus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TimD54","files":22,"time":1208584348,"description":"Ain\\&amp;#039;t it time for a badass classic show?  A tremendous recording of Led Zeppelin playing their balls off?  Something everyone should have by now, and luckily for our latest new guy the first TimD Show of his young FBO career, ladies and gentlemen, boys and girls, old grizzled veterans and children of all ages, welcome to Led Zeppelin\\&amp;#039;s Flying Circus.\n\nOh, I didn\\&amp;#039;t forget.  Well, yeah, I did - I actually smiled when I saw this show on the schedule (yes, I have one) for this week.  And since that was about ten minutes ago, well, that means that I\\&amp;#039;m totally off the cuff here, but in a good way \\&amp;#039;cause now I\\&amp;#039;m thinking about (and listening to) the show.\n\nThe setlist is a new one, including tracks from Physical Graffiti and hasn\\&amp;#039;t settled into the order you\\&amp;#039;re used to hearing - the show closes with WLL, BD and HB.  It\\&amp;#039;s a whole different dimension for the band, and they seem to know they\\&amp;#039;re stretching out.  \n\nRobert is 1975 Robert, taking the low road in Rock and Roll, hoarse at times - his voice is shot from 1969-70 to this day, so who can blame him for that?  Jimmy is fierce all the way through, his sound gigantic in the arena, locked in with John Paul Jones, who you can hear remarkably well especially for a soundboard - another show that makes you wonder exactly who leaks these soundboards.  Jimmy\\&amp;#039;s solo on Sick Again is clean, soundboard clean, very little sticky fingers and the band is really going after the riff.\n\nIt\\&amp;#039;s always neat how crowds are rowdy between songs in this era, but when Jimmy starts playing, say OTHAFA, they sit down and listen - maybe some of that beatnik hippie feeling carried over.  I just can\\&amp;#039;t get over how Jimmy sounds at MSG.  The band sounds twenty feet tall, a towering monument to sound and Acupulco Gold.\n\nRobert mentions early on that he\\&amp;#039;s in the mood to do a lot of talking, and he does, even though he says \\&quot;that\\&amp;#039;s not what it\\&amp;#039;s all about,\\&quot; and then continues to talk, announcing the upcoming release of PG just before the band blasts through IMTOD and TSRTS, an epic attack on the senses that\\&amp;#039;s soothed by The Rain Song, then dried out by the yellow desert sun of Kashmir.  And that\\&amp;#039;s just the first half of the show.  \n\nA note about The Rain Song - I used to skip it on my old copy of the Remasters when I was a teenager.  Now that I\\&amp;#039;m older and wiser the lyric makes perfect sense and Robert\\&amp;#039;s performance on this night is just gorgeous, one of my very favorite moments of any Zeppelin show ever.  Get this one for no other reason than one of the best Rain Songs ever, IMHO.  \n\nI haven\\&amp;#039;t mentioned Bonham yet.  Kashmir speaks for itself.  Stone-age, space-age, 1975 was the Age of Bonzo.  John Bonham was and is a force of nature, unstoppable, steam-hammer power.  Thus is the difference between Black Sabbath and Led Zeppelin - Sabbath always tried to drive home the riff, but Zeppelin drove it home at the point where the powerhouse Bonham met the Swiss-precision of Jonesy and Page, with John Henry\\&amp;#039;s right boot leading the path.  \n\nI need to get some rest - I\\&amp;#039;m going to see Robert Plant tomorrow night.\nTimD","torrent":{"xt":"urn:btih:db83711dac950eafc916152b3347c1e637636942","amp;dn":"Led+Zeppelin+1975.02.12+-+MSG%2C+NYC+-+Flying+Circus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db83711dac950eafc916152b3347c1e637636942","infoHashBuffer":{"type":"Buffer","data":[219,131,113,29,172,149,14,175,201,22,21,43,51,71,193,230,55,99,105,66]},"announce":[],"urlList":[]}}