{"title":"Randi Rhodes Show with Nicole Sandler - October 23 2013","uid":9091426,"size":48081794,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:dc7ac850e0ecbb9e060e0457671815c609a0aafa&amp;dn=Randi+Rhodes+Show+with+Nicole+Sandler+-+October+23+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"480v","files":3,"time":1382605995,"description":"October 23, 2013\nThe Randi Rhodes Show \n\nRandi's on vacation this week, but Nicole Sandler's sitting in with the latest news and some great guests too...\n\nDespite the bumpy rollout of Obamacare, polls show Americans are increasingly supporting the program. However, If you listen to the lies from right wing media you might think Obamacare is the worst government program ever.\n\nSally Kohn, a freelance liberal contributor to Fox News, had a completely different experience with Healthcare.gov than many of her colleagues. She'll join Nicole today to talk about how Obamacare really works and why the next few weeks are really what matters for both the website and the overall program. Nicole will also debunk some of the latest lies to come out of the Fox propaganda machine as they work furiously to come up with the next 'death panels'.\n\nAnd while the media's been distracted with government shutdowns and website glitches, you haven't heard much about jobs and probably even less about the Trans-Pacific Partnership. Lori Wallach, Director of Public Citizen's 'Global Trade Watch' advocacy group will talk with Nicole about how the TPP trade deal could make corporations as powerful as nations and leave workers as powerless as slaves.","torrent":{"xt":"urn:btih:dc7ac850e0ecbb9e060e0457671815c609a0aafa","amp;dn":"Randi+Rhodes+Show+with+Nicole+Sandler+-+October+23+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc7ac850e0ecbb9e060e0457671815c609a0aafa","infoHashBuffer":{"type":"Buffer","data":[220,122,200,80,224,236,187,158,6,14,4,87,103,24,21,198,9,160,170,250]},"announce":[],"urlList":[]}}