{"title":"VA - Americana 2 - Rock Your Soul - Blue Eyed Soul (2013) MP3@32","uid":10392161,"size":161256089,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dcd5594a6f8ef2855b04173ad3adca4fda3175e3&amp;dn=VA+-+Americana+2+-+Rock+Your+Soul+-+Blue+Eyed+Soul+%282013%29+MP3%4032&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AaronVincent","files":17,"time":1403205810,"description":"&quot;The second volume of BBE's Americana: Rock Your Soul series suffers a little from the &quot;been there, done that&quot; syndrome, but ends up delivering nearly the same amount of wonderfully cheesy, undiscovered gems as the first volume. Like that collection, this set lovingly gathers up a dusty batch of songs from the late '70s and early '80s that sound like the results of a smooth mix of soft rock, smooth soul, light AOR, and the kind of disco one might hear on the lido deck of the Love Boat. Made up of names only a thrift store regular might, but probably doesn't, know, the set uncovers some real gems from acts like E.J. Stamp (&quot;I Know All About It&quot;), TR's Hot Ice (the almost punky &quot;Hot Ice&quot;), and the amazingly named Freudian Funk Band (with the even more amazingly named jammer &quot;I'm Ambivalent About You Baby [Yes, Yes, Yes... No, No, No]&quot;). The overall hit-to-miss ratio falls firmly on the hit side, and even the clunkers -- like Steve Eaton's ultra-corny &quot;Without You&quot; and Archie James Cavanaugh's sub-Moonlighting theme ballad &quot;Make Me Believe&quot; -- have enough novelty appeal to make them worth a listen. One spin of the collection may reveal some new tracks to play at your next DJ night, two spins means you are a serious student of cheese. Three spins and who knows what horrors might transpire. Extra points for including another track from Gong Show regular Jaye P. Morgan, the ridiculously sultry &quot;Here Is Where Your Love Belongs,&quot; which closes the compilation out on a high note.&quot;/Allmusic","torrent":{"xt":"urn:btih:dcd5594a6f8ef2855b04173ad3adca4fda3175e3","amp;dn":"VA+-+Americana+2+-+Rock+Your+Soul+-+Blue+Eyed+Soul+%282013%29+MP3%4032","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcd5594a6f8ef2855b04173ad3adca4fda3175e3","infoHashBuffer":{"type":"Buffer","data":[220,213,89,74,111,142,242,133,91,4,23,58,211,173,202,79,218,49,117,227]},"announce":[],"urlList":[]}}