{"title":"Star Trek (DC Comics)","uid":4899163,"size":2492384233,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ddba1f820af0cddf472b6726cc3f9bdc441cfaab&amp;dn=Star+Trek+%28DC+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ParrowJack","files":273,"time":1242512830,"description":"The first DC series picked up immediately after Star Trek II: The Wrath of Khan, beginning in 1984 but after eight issues started to place stories after Star Trek III: The Search for Spock. In these later issues, Kirk, after a multi-issue showdown with the Mirror Universe, is given command of the Excelsior, while Spock, mentally restored after mind-melding with his mirror self, is given the command of the USS Surak. However, with Star Trek IV: The Voyage Home taking place right after III left off, the series quickly wiped the slate clean by having Kirk lose command of the Excelsior and Spock return to the state he was at the end of III. After the release of The Voyage Home, the series continued with Kirk commanding the Enterprise-A. These later issues also re-introduced the characters of Arex and M'Ress from Star Trek: The Animated Series. In 1988, the series ended when Paramount required all tie-in licenses to be renegotiated.\n\nAfter a year's hiatus, DC's second Star Trek series began with an adaptation of Star Trek V and took place in the large gap between Star Trek V and Star Trek VI, but did not continue on from the previous series, so storylines from that series were either ignored or rewritten. Although more limited in scope than the first series, due to restrictions from Paramount, the series lasted 80 issues and fleshed out some of the changes between V and VI, such as Sulu's promotion to captain of the Excelsior. As part of Paramount's increased restrictions on storytelling, planned appearances from Arex and M'Ress were shelved, with some formative artwork showing M'Ress re-drawn. The series was mainly written by Peter David and Howard Weinstein, who are also Star Trek novelists.\n\nDC also published two Star Trek: The Next Generation comic series. The first, a six-issue limited series taking place during the first season, was published in 1988. An ongoing monthly series was launched from October 1989, covering from season two to just before Generations. The series was mainly written by Star Trek: The Next Generation novelist Michael Jan Friedman. The series ran until 1996.\n\nAt the same time DC was publishing its comics, Malibu Comics published a Deep Space Nine series during the first three seasons, and DC and Malibu joined forces to publish a TNG/DS9 limited series. DC also published one of the first crossovers between the TOS and TNG eras in another limited series.\n\n\nReleased on http://ComicPirates.info\t","torrent":{"xt":"urn:btih:ddba1f820af0cddf472b6726cc3f9bdc441cfaab","amp;dn":"Star+Trek+%28DC+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddba1f820af0cddf472b6726cc3f9bdc441cfaab","infoHashBuffer":{"type":"Buffer","data":[221,186,31,130,10,240,205,223,71,43,103,38,204,63,155,220,68,28,250,171]},"announce":[],"urlList":[]}}