{"title":"Bashar - The Apprentice, The Adept &amp; The Alchemist","uid":8653918,"size":2078973837,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:de3c6815e3bd6f612b286ab5669c7dc531d53f79&amp;dn=Bashar+-+The+Apprentice%2C+The+Adept+%26amp%3B+The+Alchemist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Rus099","files":2,"time":1373170818,"description":"&quot;The Apprentice&quot;\nJune 14, 2013 - Los Angeles, CA\n\n\n\nThe Apprentice, The Adept &amp; The Alchemist: A Story of Transformation. Bashar shares a story about our process of change and ascension. Q&amp;A includes: I get confused about different teachings, which is the ultimate truth? Why does life eat life? Why is it healthier to eat animals than to not eat animals for me? How can I use sound and other healing modalities to improve the education system? Bashar speaks on &quot;tel-empahy.&quot; What are your thoughts on when humanity will implement free energy methods? When will we be off our present monetary system? I was recently pregnant and had an abortion, did I make the right decision? Why do I keep experiencing a long string of injuries? Will you speak on the ancient history of the deck of playing cards? When I meditate, I get peaceful and still, I get to a point where I exhale and it's more comfortable to not inhale again, is this harmful? What is the 6&quot; alien body that was recently found? When someone is under hypnosis are they in a dream state? Was my family involved in the hybridization process? When I summon you, and I'm not sure what really happens. I feel a presence, is it you? What do you recommend for how to be more successful in gambling? Given the high rate of humanities current ascension, will my ideas for how to accelerate be no longer needed? In regards to the end of money, how can we transition into the idea of using human ability instead of currency? I came from a very stressful state, and it allowed me to develop in a lot of positive ways, but also into some illnesses. How do I know if I'm done with this stressful cycle? Are all women are supposed to want to have babies? Why did I get sick at Macchu Pichu? ","torrent":{"xt":"urn:btih:de3c6815e3bd6f612b286ab5669c7dc531d53f79","amp;dn":"Bashar+-+The+Apprentice%2C+The+Adept+%26amp%3B+The+Alchemist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de3c6815e3bd6f612b286ab5669c7dc531d53f79","infoHashBuffer":{"type":"Buffer","data":[222,60,104,21,227,189,111,97,43,40,106,181,102,156,125,197,49,213,63,121]},"announce":[],"urlList":[]}}