{"title":"The Order of the Dragonknights","uid":7823454,"size":277306964,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:de6db67e54d7b783b4433a1f2975bc46534262c2&amp;dn=The+Order+of+the+Dragonknights&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1352879466,"description":"T01-05 and 07-08 of 'The Order of the Dragonknights'\n\nSilvester, 2009\n\nText - Ange\n\nArt - Alberto Varanda, Fabrice Meddour, Thierry Demarez, Christian Paty, Phillipe Briones, Sylvain Guinebaud \n\nColors - Crazytoons, Stephane Paitreau \n\n\nNobody knows why the dragons emerge. By their presence they distort reality, the people, the animals. As the dragon ages, it grows with him the evil veil. The Veill. Only virgins can approach the beast to kill it. Therefore, the Order of the Dragon Knights was created.\n\nI translated the above blurb from the Dutch found on the Silvester website. In truth, I haven't read these yet because I've been trying to find book six. All the other books are 'out there' all over the place, but six seems to be missing. I decided to go ahead and upload them a) because they look cool - to me, anyway, b) I'm hoping somebody else can upload book six to complete the run.\n\nThere is also a book nine, but I don't think it's been translated yet.\n\nI can tell you that it appears to be pretty straightforward middle-ages sword and sorcery with a good deal of fighting. Could be a bit of crusades kind of vibe to it, as well. And there's also some ocean going ships in at least one volume. Oh yeah, and women (or a woman) that, for some reason, don't wear their shirts when they battle sometimes. \n\n","torrent":{"xt":"urn:btih:de6db67e54d7b783b4433a1f2975bc46534262c2","amp;dn":"The+Order+of+the+Dragonknights","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de6db67e54d7b783b4433a1f2975bc46534262c2","infoHashBuffer":{"type":"Buffer","data":[222,109,182,126,84,215,183,131,180,67,58,31,41,117,188,70,83,66,98,194]},"announce":[],"urlList":[]}}