{"title":"P90X Complete","uid":4956508,"size":315457996,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:decf8774ea94db8af14f03c7119d59abdc0d89d4&amp;dn=P90X+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"badshortdaddy","files":14,"time":1245133059,"description":"This torrent has all documents that ship with the P90X product. Including the books (Nutrition Plan and Fitness Guide - both in PDF format) and the poster (also in PDF). These books have everything you need: schedule, food guide, recipes, worksheets, etc.\n\nIn the PDFs of the books I created great bookmarks to find what you are looking for extremely easily too. The PDF page numbers have also been renamed to match the actual book page numbers too...so these are very user-friendly versions.\n\nI also included some amazing excel files that I have found which help you to take this program to the next level.\n\n\n\nTHIS DOES NOT HAVE ANY OF THE VIDEOS...not shouting, just want that to be clear up front.\n\nI will upload ISO versions if enough people request them from me, but the videos are pretty easy to find on TPB.\n\n\n\nI created this because I own the program (yes I bought it) and was looking for a PDF version of the books. I have searched all over (many torrent sites) and cannot find them anywhere. The response by Beachbody (the maker of P90X) to a customer requesting the very same thing was that they will not create a digital version for fear of piracy. That angered me! So I ripped my books apart and scanned every single page. So a note to any business owner, do not sacrifice customer service because of fear of piracy because you may piss off a customer who will make that fear come true...haha, hope you all enjoy!\n","torrent":{"xt":"urn:btih:decf8774ea94db8af14f03c7119d59abdc0d89d4","amp;dn":"P90X+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"decf8774ea94db8af14f03c7119d59abdc0d89d4","infoHashBuffer":{"type":"Buffer","data":[222,207,135,116,234,148,219,138,241,79,3,199,17,157,89,171,220,13,137,212]},"announce":[],"urlList":[]}}