{"title":"Probabilistic Safety Assessment in the Chemical and Nuclear Indu","uid":12549216,"size":48995782,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfc18b5ef9fada29de8f8f74ad80df0edb9566e7&amp;dn=Probabilistic+Safety+Assessment+in+the+Chemical+and+Nuclear+Indu&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1444517009,"description":"Probabilistic Safety Assessment in the Chemical and Nuclear Industries - Ralph R. Fullwood (Elsevier-BH, 2000).pdf\r\n\r\nISBN 0750672080\r\n\r\nProbabilistic Safety Analysis (PSA) determines the probability and consequences of accidents, hence, the risk. This subject concerns policy makers, regulators, designers, educators and engineers working to achieve maximum safety with operational efficiency. Risk is analyzed using methods for achieving reliability in the space program. The first major application was to the nuclear power industry, followed by applications to the chemical industry. It has also been applied to space, aviation, defense, ground, and water transportation. This book is unique in its treatment of chemical and nuclear risk.\r\n\r\nProblems are included at the end of many chapters, and answers are in the back of the book. Computer files are provided (via the internet), containing reliability data, a calculator that determines failure rate and uncertainty based on field experience, pipe break calculator, event tree calculator, FTAP and associated programs for fault tree analysis, and a units conversion code. It contains 540 references and many referrals to internet locations for information","torrent":{"xt":"urn:btih:dfc18b5ef9fada29de8f8f74ad80df0edb9566e7","amp;dn":"Probabilistic+Safety+Assessment+in+the+Chemical+and+Nuclear+Indu","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfc18b5ef9fada29de8f8f74ad80df0edb9566e7","infoHashBuffer":{"type":"Buffer","data":[223,193,139,94,249,250,218,41,222,143,143,116,173,128,223,14,219,149,102,231]},"announce":[],"urlList":[]}}