{"title":"The Eccentrics and other American visionary painters.pdf","uid":13074783,"size":34963908,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e029d2b4301e572e8c7afbeb39e067ef86a61a2e&amp;dn=The+Eccentrics+and+other+American+visionary+painters.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1450828316,"description":"The Eccentrics and Other American Visionary Painters\r\nE. P. Dutton | 1978 | ISBN: 0525475001 | English | 238 pages | PDF | 34 MB\r\n\r\nHere, for the first time, is a study of an important body of American paintings from around 1800 and on into the twentieth century in which the scene depicted appears to have been caught in the middle of a dream rather than being based on palpable reality. In these visionary paintings the conjured-up world seems to be more deeply felt, is more authentic, more integrated, and more deeply moving than it is in merely fantastic paintings. Authentic visionary painting was like a small stream meandering slowly beside the two great torrents of nineteenth-century American painting: the one realist, the other insipidly ideal. Each of the painters studied in this book, whether in a few canvases or many, produced an art that was arrestingly individual for its time, and this art is well worth our interest and deeper appreciation today. The main artists discussed in this fascinating book are Erastus Salisbury Field, William Page, William Rimmer, Thomas Wilmer Dewing, George Fuller, Robert Loftin Newman, John Quidor, Edward Hicks, Elihu Vedder, John La Farge, George Inness, Ralph Albert Blakelock, Benjamin West, Washington Allston, Thomas Cole, and Albert Pinkham Ryder","torrent":{"xt":"urn:btih:e029d2b4301e572e8c7afbeb39e067ef86a61a2e","amp;dn":"The+Eccentrics+and+other+American+visionary+painters.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e029d2b4301e572e8c7afbeb39e067ef86a61a2e","infoHashBuffer":{"type":"Buffer","data":[224,41,210,180,48,30,87,46,140,122,251,235,57,224,103,239,134,166,26,46]},"announce":[],"urlList":[]}}