{"title":"Making Money (2015).epub Gooner","uid":12577632,"size":2870046,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1b0a89a1bddc89ebd83d39cf52d8bd01bfbc9e9&amp;dn=Making+Money+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1444917800,"description":"Publisher: Oxford University Press; 1 edition (September 14, 2015)\r\nLanguage: English\r\nISBN-10: 0198709587\r\nISBN-13: 978-0198709589\r\n\r\nMoney travels the modern world in disguise. It looks like a convention of human exchange - a commodity like gold or a medium like language. But its history reveals that money is a very different matter. It is an institution engineered by political communities to mark and mobilize resources. As societies change the way they create money, they change the market itself - along with the rules that structure it, the politics and ideas that shape it, and the benefits that flow from it.\r\nOne particularly dramatic transformation in money's design brought capitalism to England. For centuries, the English government monopolized money's creation. The Crown sold people coin for a fee in exchange for silver and gold. 'Commodity money' was a fragile and difficult medium; the first half of the book considers the kinds of exchange and credit it invited, as well as the politics it engendered. Capitalism arrived when the English reinvented money at the end of the 17th century. When it established the Bank of England, the government shared its monopoly over money creation for the first time with private investors, institutionalizing their self-interest as the pump that would produce the money supply. The second half of the book considers the monetary revolution that brought unprecedented possibilities and problems. The invention of circulating public debt, the breakdown of commodity money, the rise of commercial bank currency, and the coalescence of ideological commitments that came to be identified with the Gold Standard - all contributed to the abundant and unstable medium that is modern money. All flowed as well from a collision between the individual incentives and public claims at the heart of the system. The drama had constitutional dimension: money, as its history reveals, is a mode of governance in a material world. That character undermines claims in economics about money's neutrality. The monetary design innovated in England would later spread, producing the global architecture of modern money","torrent":{"xt":"urn:btih:e1b0a89a1bddc89ebd83d39cf52d8bd01bfbc9e9","amp;dn":"Making+Money+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1b0a89a1bddc89ebd83d39cf52d8bd01bfbc9e9","infoHashBuffer":{"type":"Buffer","data":[225,176,168,154,27,221,200,158,189,131,211,156,245,45,139,208,27,251,201,233]},"announce":[],"urlList":[]}}