{"title":"Original Castle-Wolfenstein 1984 [NCHermit].iso","uid":9171037,"size":311296,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e1f4442e8c54f59322dc6c66dc67a828c6e69621&amp;dn=Original+Castle-Wolfenstein+1984+%5BNCHermit%5D.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NCHermit","files":-1,"time":1384069475,"description":"Ok this one is slightly different then the others I have uploaded and is a little more complicated to run. It does work though.\n\nMuse Software gave birth to Castle Wolfenstein (also known as Wolfenstein 2D, Wolf2D) in 1984, with the help of Muse Software as publisher. Cool action game, the player evolve in a shooter, stealth theme with a top-down perspective.\n\nUndoubtedly one of the best action games ever made, Muse Software's Castle Wolfenstein is a revolutionary action game that spawned a whole new genre. If the name sounds familiar to you, your hunch is correct: this is THE game that inspired id Software's blockbuster Wolfenstein 3D. Apparently they liked the game so much that id negotiated a deal to reuse the name 'Wolfenstein' for their game. And if the 'fragmasters' at id acknowledge the game as their inspiration, then it must be something special, right? Indeed, Castle Wolfenstein is such a veritable masterpiece that calling it &quot;special&quot; is a huge understatement. As its spiritual ancestor, the game's premise will be familiar to all Wolfenstein 3D: you are an allied soldier who's been taken prisoner by the Nazis. You must escape from their castle, avoiding or killing Nazi guards along the way. The action is viewed from an overhead perspective, with 2D graphics for the objects and characters (hence its nickname Wolfenstein 2D by Wolf 3D fans). While not Earth-shattering, the graphics are more than adequate, and never gets in the way of the action. There are even different graphics to depict a dead guard, a dead guard with bullet-proof vest on, and a guard shot dead at his desk... talk about rigor mortis. Of course, graphics alone doesn't necessary make a great game, and Castle Wolfenstein has plenty of action and adrenaline rush. You start out with a gun and one 10-bullet clip, given by a fellow prisoner. More bullets can be found by searching guards and breaking into supply boxes. There is a lot of great ideas in the game, many of which are rarely used even in today's crop of 3D-accelerated games. You can, for example, hold a Nazi guard at gunpoint to search him for supplies (unfortunately, though, you can't hold the guard as hostage to facilitate your escape-- only for a short while). You can also toss grenades at guards and watch the gory effect (or as gory as 2D, 4-color CGA palette can get). The grenades can burst through (concrete) walls, and it's a lot of fun to time it so that the grenade will hit the unsuspecting SS guard on the *other side* of the wall. Evil fun :) One thing that makes Castle Wolfenstein very replayable is the fact that the castle is randomly generated each time you play. If you are killed or captured, you can either attempt the same castle again, or play a new random one, which could very well be more impossible than the last. SS guards also tend to surprise you, thus adding to the adrenaline rush of escaping. There is really nothing I can think of that's bad about the game. Castle Wolfenstein is a true pioneer in the now-crowded field of action games, and is a revolutionary game that remains, almost 20 years after its release, eminently playable (with slowdown program, of course).\n\n\nOk here goes a step by step instruction on how to get this game to load and play, I am using windows Vista myself, but I believe that these instructions will work with XP, Vista, Windows 7 and Windows 8 as the program I use to run this is compatible with all listed OS. Having prior knowledge and or experience working in DOS will be extremely helpful here, but it is not needed. Patience is required LOL\n\nGo to www.dosbox.com/download and download the latest version there ( its is 100% free no signup required) DOSbox also works with Ubuntu.\n\nIf you have used DOSbox and are familiar with it you can skip this next section.\n\n1. Install DOSbox on your computer\n\n2. Create a folder on your HDD for this game and all games you may find like it, I use C:/dosgames\n\n3. Download this game to the special folder you created\n\n4. Open DOSbox\n\n5. Mount your C: Drive and the folder you created example: mount C C:dosgames (then press enter)\n( If you do not know how to do this go to http://www.dosbox.com/wiki/Main_Page and read)\n\n6. After you have your folder mounted change to the game folder: cd [whatever the folder name is] DOSbox is limited to 8 characters in a file name, so it may be easier for you to rename your game files .exe or .bat commands to make them shorter.\n\n7. Run the .exe or.bat file and enjoy.\n\nIf you are not familiar with DOS commands or DOSbox then I STRONGLY recommend that you read their wiki http://www.dosbox.com/wiki/Main_Page as it can and will explain it a lot simpler than I ever can.\n\nKeep in mind this is the ORIGINAL Castle Wolfenstein released in 1984, this is not the 3D shooter that most of you are familiar with, this is the one that started it all.\n\nAny of you older gamers ( Like me ) may remember playing this on a Tandy, Commodore, Apple, Apple II, Apple IIc or IBM with a 386 Processor.\n\nIf you have questions or comments please leave them I will answer to the best of my ability, but keep in mind the wiki can help you set it up to run the game.\n\nNCHermit\n","torrent":{"xt":"urn:btih:e1f4442e8c54f59322dc6c66dc67a828c6e69621","amp;dn":"Original+Castle-Wolfenstein+1984+%5BNCHermit%5D.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1f4442e8c54f59322dc6c66dc67a828c6e69621","infoHashBuffer":{"type":"Buffer","data":[225,244,68,46,140,84,245,147,34,220,108,102,220,103,168,40,198,230,150,33]},"announce":[],"urlList":[]}}