{"title":"Brand Breakout - How Emerging Market Brands Will Go Global - Nir","uid":9280862,"size":3243482,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e200c6eeedf30f75c56a671fa0f8a038cc1a1ded&amp;dn=Brand+Breakout+-+How+Emerging+Market+Brands+Will+Go+Global+-+Nir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1385938381,"description":"World class marketing experts, Nirmalya Kumar and Jan-Benedict Steenkamp set out a cutting-edge plan for emerging market brands to achieve success in international markets. Brand Breakout outlines eight strategies - including the Asian tortoise route, from B2B to B2C, brand acquisition and leveraging cultural resources - that will take brands from domestic dominance to worldwide triumphominance cultural resources rand will go global.kground .\n\nFor each strategic route, Kumar and Steenkamp examine the most effective implementation as well as identifying the problems that companies will face and how these can be overcome. Full of case studies from around the world including HTC, Tata Motors, Samsung, Lenovo, Pearl River Piano, Havaianas and Corona, the authors demonstrate that their strategies and underlying strategic brand-building principles are here to stay.\n\nBrand Breakout is not only a practical and enlightening guide for emerging market brands but crucial reading for Western companies who should not underestimate the challenge coming from these up-and-coming international businesses. By understanding their strategies and success factors, Western companies can plot their counter-strategies for this new business environment.\n\nIn this engaging and illuminating book, Brand Breakout equips readers with the knowledge and techniques so that their brand can finally go global.","torrent":{"xt":"urn:btih:e200c6eeedf30f75c56a671fa0f8a038cc1a1ded","amp;dn":"Brand+Breakout+-+How+Emerging+Market+Brands+Will+Go+Global+-+Nir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e200c6eeedf30f75c56a671fa0f8a038cc1a1ded","infoHashBuffer":{"type":"Buffer","data":[226,0,198,238,237,243,15,117,197,106,103,31,160,248,160,56,204,26,29,237]},"announce":[],"urlList":[]}}