{"title":"Joey DeFrancesco - One for Rudy","uid":9687387,"size":141385307,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e2320e52e1630a2dd1c34919fc7f691c734fc337&amp;dn=Joey+DeFrancesco+-+One+for+Rudy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1393799145,"description":"Joey DeFrancesco - One for Rudy\n\nJoey DeFrancesco, one of the greatest living Hammond B-3 artists, decided the time was now to honor Rudy Van Gelder with a tribute, both in name as well as song title selection. Van Gelder was the engineer for the great Blue Note sessions of the 1950s and 1960s.\n\nLabel: High Note\nReleased: 2013\n\n\nTracklist:\n01. I Don't Wanna Be Kissed (03:13)\n02. Budo (04:41)\n03. Goodbye (05:21)\n04. Canadian Sunset (07:26)\n05. Up Jumped Spring (08:14)\n06. Way Out West (05:53)\n07. After You've Gone (04:41)\n08. Monk's Dream (05:58)\n09. Stardust (07:45)\n10. One for Rudy (05:36)\n\nTotal time 59:14 min\n\nPersonnel:\nJoey DeFrancesco, Hammond B-3 organ\nSteve Cotter, guitar\nRamon Banda, drums\n\n\nFormat: MP3 320 kbit/s. All songs are tagged by the book.\n\n--------\n\nThe 'Rudy' singled out for favor on this new album by organist Joey DeFrancesco's admirable trio is the legendary recording engineer Rudy van Gelder who engineered, mixed and mastered the album at his studio in Englewood Cliffs, NJ. DeFrancesco, whose mastery of the Hammond B-3 is universally recognized and unquestioned, wrote the groovy homage to van Gelder that wraps up the album, elsewhere stepping aside to make room for such able tunesmiths as Miles Davis, Eddie Heywood, Gordon Jenkins, Freddie Hubbard, Sonny Rollins, Thelonious Monk and Hoagy Carmichael. Resting surely and snugly in the small-group format that suits him best, DeFrancesco serves as comrade and confidant to his colleagues, guitarist Steve Cotter and drummer Ramon Banda.\n\nDeFrancesco can always be counted on to unearth an offbeat song selection or two, and this he does at the outset with Hal Spina's 'I Don't Wanna Be Kissed', a mid-tempo charmer on which the organ is made to sound at times like a piano. Miles' 'Budo' bounces along at a lively clip, setting the stage for a pair of memorable ballads, Jenkins' 'Goodbye' and Heywood's 'Canadian Sunset'. Hubbard's 'Up Jumped Spring', one of the more impressive jazz themes ever written (reframed melodically by DeFrancesco and Co.), precedes Rollins' playful 'Way Out West' and the scurrying standard 'After You've Gone'. The tempo slows moderately for 'Monk's Dream' and substantially for 'Stardust' before the trio dig in hard to deliver 'One for Rudy' (on which the listener can briefly hear van Gelder's directive to commence recording).\n\nDeFrancesco brandishes his gargantuan chops throughout, while Cotter and Banda lend sympathetic support and Cotter solos effectively when called upon. Even though DeFrancesco's name is on the marquee, this is clearly a group effort in which everyone plays an essential role. Needless to say, the recording itself is first-class, playing time respectable at just under an hour. For fans of organ trios in general and Joey DeFrancesco in particular, a charming and readily endorsed session. \nBy Jack Bowers\n\n--------\n\nIf you encounter errors during the file sharing, please, place this material as close to the root of the hard disk as possible and restart the file sharing (e.g. as close as possible to C: in Windows). This is in order to make the path (drive, directory and filename) as short as possible. Operating systems have limits regarding how long a path including the filename can be, and if this limit is exceeded there will be errors.\n\n--------\n\nL Hammond, The Pirate Bay, where you'll find more jazz organ.\n\n","torrent":{"xt":"urn:btih:e2320e52e1630a2dd1c34919fc7f691c734fc337","amp;dn":"Joey+DeFrancesco+-+One+for+Rudy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2320e52e1630a2dd1c34919fc7f691c734fc337","infoHashBuffer":{"type":"Buffer","data":[226,50,14,82,225,99,10,45,209,195,73,25,252,127,105,28,115,79,195,55]},"announce":[],"urlList":[]}}