{"title":"Flatland  (Ladd Ehlinger, 2007)","uid":10305628,"size":734295556,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:e2d072ee2b22788fa68960f483247e9851024180&amp;dn=Flatland++%28Ladd+Ehlinger%2C+2007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"H2oDragon","files":2,"time":1402129567,"description":"This is the full length movie made by Ladd Ehlinger in 2007, based on Edwin A. Abbott's book: Flatland: A Romance of Many Dimensions (1884).\n\nEdwin Abbott Abbott was a schoolmaster and an authority on the 'social classes' of Victorian societies. His book is a satire, as well as the definitive work to begin to understand dimensions)\n\nThere have been several attempts to make a movie based on this awesome book, and finally, this one has succeeded in being complete and faithful to the book.\n\nIt is animated, naturally.\n\nI guess they couldn't find any two-dimensional squares, triangles or hexagons, or three dimensional spheres, to be the actors. \n\nThe book is quite enjoyable too. It is OK for high school level students, especially math students.\n\nThis film had the masterful screenwriting of Prof. Tom Whalen, to make it possible. \n\nYou can read the full text of the book, including original illustrations, here: http://www.ibiblio.org/eldritch/eaa/FL.HTM \n\nYou can also get it at many public libraries (do they still have those?)\n\nIt will give you an easy way to comprehend just what dimensions are, in a strict mathematical sense, without any metaphysical or other interpretations.\n\nJust remember to always be nice to your lines -- or she can cut you to pieces!\n\nEnjoy!\n\nAnd please be sure to seed it for awhile.  \n\n   --H2oDragon\n\nPS: If you really like it and want to contribute something, look up Ladd Ehlinger's Flatland movie webpage, and send him a few bucks...or buy the CD!\n\nKeep torrents alive! ","torrent":{"xt":"urn:btih:e2d072ee2b22788fa68960f483247e9851024180","amp;dn":"Flatland++%28Ladd+Ehlinger%2C+2007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2d072ee2b22788fa68960f483247e9851024180","infoHashBuffer":{"type":"Buffer","data":[226,208,114,238,43,34,120,143,166,137,96,244,131,36,126,152,81,2,65,128]},"announce":[],"urlList":[]}}