{"title":"The Divine Comedy - Promenade [1994]","uid":9470297,"size":284006740,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e3eba06e92d7ed3b81a4bc571f00db7e99f85d59&amp;dn=The+Divine+Comedy+-+Promenade+%5B1994%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1389551113,"description":"Review by Ned Raggett  [-]\nWhile in appearance, it seems like a sequel to Liberation -- a similar cover shot down to the typeface that is on the front, in this case showing Hannon in front of the IM Pei-designed entrance to the Louvre, while the back shows a similarly Rococo piece of decoration -- Promenade is in fact even more extremely and defiantly non-rock than its predecessor. With a larger number of string performers to accompany him, not to mention someone on oboe, sax, and cor anglais (English horn), Hannon retains only drummer/co-producer Darren Allison from the previous record to make what remains his most self-conscious art release to date. The opening &quot;Bath&quot; sets the course, with seacoast sounds and a brief spoken word bit that turns into a minimalist Michael Nyman homage before slamming into the song proper, where the guitars and bass take a back seat to the choir, strings, and woodwinds, all the while driven along by Allison's solid percussion. From there all kinds of twists and turns emerge in an alternate universe where classical instrumentation offers as much pop as a guitar strum. The extreme archness of &quot;Going Downhill Fast&quot; is also a pub singalong, while &quot;Don't Look Down&quot; builds to a dramatic, striking ending. Hannon's wickedly sharp wit informs almost everything; &quot;The Booklovers&quot; is the clear winner on that count, as Hannon tremulously recites a number of authors' names (with an appropriate accompanying sample or aside, often quite hilarious) over a stately arrangement. &quot;A Seafood Song&quot; and &quot;A Drinking Song&quot; celebrate exactly what they say they do, the latter offering up the great line &quot;All my lovers will be pink and elephantine!&quot; At the same time, the tender side of Hannon, which has sometimes been ignored, surfaces more than once, with &quot;The Summerhouse,&quot; a nostalgic, wonderfully gentle piece on a lost season of love. This turns out to be one of Hannon's best songs ever. (4/5)","torrent":{"xt":"urn:btih:e3eba06e92d7ed3b81a4bc571f00db7e99f85d59","amp;dn":"The+Divine+Comedy+-+Promenade+%5B1994%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3eba06e92d7ed3b81a4bc571f00db7e99f85d59","infoHashBuffer":{"type":"Buffer","data":[227,235,160,110,146,215,237,59,129,164,188,87,31,0,219,126,153,248,93,89]},"announce":[],"urlList":[]}}