{"title":"Laura Lee Radio Archives - Holistic Health","uid":6628448,"size":838205431,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e56bc63f1bf738895cb65bd954c3ac7fbbf318dd&amp;dn=Laura+Lee+Radio+Archives+-+Holistic+Health&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ColdWorldx","files":66,"time":1314248806,"description":"These are the rare archives which many people have been unable to locate over the years, re-sourced and compiled for release.\n\n- Ancient Mysteries\n- Holistic Health\n- New Science\n- Self Empowerment\n- The Unexplained\n- Wisdom Traditions\n\nHolistic Health:\n\n2000-01-21 - Laura Lee Show - Royal Rife's Beam Ray Device - Part 1 - James Bare\n2000-02-09 - Laura Lee Show - What is Consciousness - Stuart Hameroff\n2000-03-08 - Laura Lee Show - Acupuncture for the Emotions - Peter Lambrou\n2000-03-10 - Laura Lee Show - Mapping the Body's Energy Systems - Part 1 - Donna Eden\n2000-03-13 - Laura Lee Show - She Cured Herself of Cancer - Eden Baily\n2000-03-20 - Laura Lee Show - The Eden Bailey Story Continued - Eden Baily\n2000-04-11 - Laura Lee Show - Mapping the Body's Energy Systems - Part 2 - Donna Eden\n2000-04-14 - Laura Lee Show - Union of Medicine &amp; Intuition - Judith Orloff\n2000-04-15 - Laura Lee Show - Food Industry Secrets - Paul Stitt\n2000-04-21 - Laura Lee Show - We Get to Play God - Jim Kling\n2000-05-23 - Laura Lee Show - Healing Plants Inspire New Medicines - Mark Plotkin\n2000-05-30 - Laura Lee Show - Rise of Alternative Health - Kenny Ausubel\n2000-07-20 - Laura Lee Show - Excitotoxins Damage Brain Cells - Dr. Russell Blaylock\n2000-08-16 - Laura Lee Show - When Bacteria Mutate to Toxins - Dr. Michael Lamarche &amp; Dr. George Meinig\n2000-11-27 - Laura Lee Show - Healing without Medicine - Bri Maya Tiwari\n2000-12-05 - Laura Lee Show - Low-Cost Natural Treatments - Will Wong\n2001-02-07 - Laura Lee Show - Zone Diet Food as Medicine - Barry Sears\n2001-02-08 - Laura Lee Show - Inner Workings of the Brain - John Ratey\n2001-02-12 - Laura Lee Show - Meditation The Brain's Medicine - Dharma Singh Khalsa\n2001-03-08 - Laura Lee Show - Water Cures - Dr. Fereydoon Batmanghelidj\n2001-03-15 - Laura Lee Show - Longevity Strategies - Dr. Barry Sears\n2001-04-25 - Laura Lee Show - Energy Therapy for the Mind - Maggie Phillips\n2001-05-09 - Laura Lee Show - Reclaiming Women's Balance and Health - Sherrill Sellman\n2001-05-18 - Laura Lee Show - Water and The Cell - Dr. Batmanghelidj\n2001-06-29 - Laura Lee Show - Why Fatty Acids are Essential - Udo Erasmus\n2001-07-02 - Laura Lee Show - Good Dietary Fats Promote Body Fat Loss - Udo Erasmus\n2001-08-06 - Laura Lee Show - Bioregulation of Hormones - Rob Faigin\n2001-08-17 - Laura Lee Show - Xeno-Estrogens Throw Us Out of Balance - Will Wong\n2001-08-29 - Laura Lee Show - Changing the Paradigm of Health - Dr. Joseph Mercola\n2001-09-21 - Laura Lee Show - Tapping the Power of Self-Healing - Lolette Kuby\n2001-10-08 - Laura Lee Show - Kiatsu Healing Technique - George Nakata\n2001-10-10 - Laura Lee Show - Fatigue &amp; Low Body Temperature - Dr. Rick Marschall\n2001-11-22 - Laura Lee Show - Calcium from Silica - Earl Staelin\n2001-12-03 - Laura Lee Show - Correcting Low Body Temperature - Dr. Rick Marschall\n2001-15-02 - Laura Lee Show - Pineal Gland and the Mystical Experience - Rick Strassman\n2002-01-07 - Laura Lee Show - Good Dietary Fats Promote Body Fat Loss - Udo Erasmus\n2002-01-24 - Laura Lee Show - Electromagnetism, Consciousness &amp; Health - Dr. Valerie Hunt\n2002-01-25 - Laura Lee Show - Shapeshifting into Health - Eve Bruce\n2002-02-11 - Laura Lee Show - Proving the Effect of Spirit on Health - Jeff Levin\n2002-02-14 - Laura Lee Show - Indigenous Healers Teach Western Doctor - David Cumes\n2002-03-25 - Laura Lee Show - Diagnosing Digestive Disorders - Rick Marschall\n2002-05-13 - Laura Lee Show - Lifestyle More Important than Genes - Diana Schwarzbein\n2002-05-27 - Laura Lee Show - Taming the Mad Cow Prion - Alan Ismond\n2002-06-03 - Laura Lee Show - Intuition &amp; the Energy Body - Michal Levin\n2002-07-12 - Laura Lee Show - Price &amp; Pottenger on Western vs Natural Diet - Pat Connolly\n2002-09-12 - Laura Lee Show - Dangerous Hormone Drugs - Sherrill Sellman\n2002-09-16 - Laura Lee Show - Chelation Therapy Reverses Aging - Arline Brecher\n2002-10-21 - Laura Lee Show - Power Play on Our Cells - Dr. Henry Lai\n2002-11-25 - Laura Lee Show - There is Only One Disease - Raymond Francis\n2002-12-16 - Laura Lee Show - Sound for Healing - Jonathan Goldman\n2002-12-23 - Laura Lee Show - Environmental Toxicity - Russell Blaylock\n2003-01-06 - Laura Lee Show - Mad Cow Disease Chemical Origin - Mark Purdey\n2003-02-06 - Laura Lee Show - The Power of Sound Healing - Jonathan Goldman\n2003-02-21 - Laura Lee Show - Tools for Self-Healing - Laurel Mellin\n2003-02-24 - Laura Lee Show - Old Chinese Herb is New Cancer Cure - Dr. Henry Lai\n2003-03-04 - Laura Lee Show - Do It Yourself Energy Medicine - Donna Eden\n2003-03-13 - Laura Lee Show - Be Informed on Aspartame - Mary Stoddard\n2003-04-03 - Laura Lee Show - Rejuvenating the Soil - Alan Ismond &amp; Peter Tompkins\n2003-08-01 - Laura Lee Show - Science behind Holistic Healing - Daniel Benor\n2003-10-24 - Laura Lee Show - Resonant Frequency Therapy - James Bare\n2004-05-22 - Laura Lee Show - Integrative Botanical Medicine - Jonathan Treasure\n2004-05-23 - Laura Lee Show - Intuition Medicine - Chuck Laurenson\n2004-10-22 - Laura Lee Show - Egyptian Medicine - Omar Amin\n2005-01-01 - Laura Lee Show - Nutritional Technologies - Dr. Rulin Xiu\n2005-08-16 - Laura Lee Show - Adrenal Fatigue - James Wilson\n2005-11-01 - Laura Lee Show - Exercise Revolution Fitness Walking Poles - Tom Rutlin\n\n66 Files / 799 MB","torrent":{"xt":"urn:btih:e56bc63f1bf738895cb65bd954c3ac7fbbf318dd","amp;dn":"Laura+Lee+Radio+Archives+-+Holistic+Health","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e56bc63f1bf738895cb65bd954c3ac7fbbf318dd","infoHashBuffer":{"type":"Buffer","data":[229,107,198,63,27,247,56,137,92,182,91,217,84,195,172,127,187,243,24,221]},"announce":[],"urlList":[]}}