{"title":"Democracy Now - 18 nov 2011","uid":6827610,"size":459078428,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e56ec88c8e6e5332d1208687596d48c2714c4fb0&amp;dn=Democracy+Now+-+18+nov+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1321636525,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 18, 2011\n\n-  OWS Marks 2 Months With Protests, March on Brooklyn Bridge\n-  Scores Arrested in Occupy Protests Nationwide\n-  Census: Nearly 1 in 3 U.S. Children Live in Poverty\n-  DHS to Review Deportations of Undocumented Immigrants\n-  Clinton to Visit Burma; Aung San Suu Kyi to Run for Parliament\n-  Tens of Thousands Rally in Egypt Against Military Rulers\n-  Kenya Seeks U.S. Military Help for Somalia Operation\n-  Brazil Probes Chevron Over Major Oil Spill Near Rio de Janeiro\n-  Obama Rejected EPA Smog Standards After Intense Lobbying\n-  Court OKs Challenge to Lifting of California Gay Marriage Ban\n-  Justice Dept. Probes Miami Police Over Lethal Shootings\n-  National Press Club Suspends Journalist After Questioning of Saudi Prince\n\n\nSpecial reports\n\n- Occupy Wall Street Draws Massive Turnout in NYC and Across the Nation to Mark 2-Month Milestone\n\nThe Occupy Wall Street movement entered its third month Thursday with protests against the economic system in dozens of cities across the country. Reports estimated some 300 people were arrested nationwide, with the majority of the arrests taking place in New York City when protesters attempted to shut down the New York Stock Exchange. &quot;We effectively shut down Wall Street this morning. We did it with our stories, with our bodies, with our hearts,&quot; says one of the organizers of the action. Democracy Now! reporter Ryan Devereaux filed this report.\n\n\n- Hip-Hop Legend Russell Simmons, Member of the 1%, on Why He Supports the 99% and OWS\n\nTwo months ago, legendary hip-hop entrepreneur Russell Simmons was one of the first high-profile public supporters to come to the Occupy Wall Street encampment at Zuccotti Park in Lower Manhattan. Thursday morning, he was there again to speak to Democracy Now! host Amy Goodman. &quot;We don't want Wall Street to control our future, and that's why we're on Wall Street. And what we'd like is for the people to control their future,&quot; Simmons said, describing the constitutional amendment he is supporting that would ban private donations for U.S. politicians running for federal office. &quot;We want to believe that the politicians are making decisions on the part of the people who elected them. And that's what's the flaw, fundamental flaw, in our democracy.&quot;\n\n\n- New York City Students Join OWS Day of Action With Union Square Rally, March\n\nAmong the many Occupy protests throughout New York City yesterday was a rally that attracted more than a thousand students to Union Square, a public park with a long-history of political demonstrations. During a march out of the park, hundreds of people thronged into the street and attempted to occupy a New School building . We speak with a New York University student participating in the march and a New School professor who has incorporated the Occupy movement into his curriculum &quot;as a prism through which to view a lot of broader social issues this semester.&quot; We also talk to The Nation correspondent John Nichols who says, &quot;I don't think that a year ago anybody would have predicted that on a cold rainy day in November 2011 you would have thousands and thousands of young people out on the streets in New York City and in cities across the country. Something has changed.&quot;\n\n\n- SEIU President, Union Leaders Arrested in OWS Brooklyn Bridge Protest Demanding Job Creation\n\nThursday's protest marking the Occupy movement's second month anniversary coincided with an event planned months earlier by unions and others. Marches were held on bridges across the country to draw attention to how federal funding to fix ailing infrastructure in the country could put unemployed people back to work. Protesters blocked bridges in Los Angeles, Chicago, Philadelphia, Detroit, St. Louis, Houston, Milwaukee, Minneapolis, Hartford and Portland. Democracy Now! producer Renee Feltz reports that in New York City, labor leaders were arrested trying to block the entrance to the Brooklyn Bridge, including SEIU President Mary Kay Henry. &quot;We think there is an economic emergency in this country that can be fixed and millions of people can go back to work in good jobs,&quot; Henry says.\n\n\n- NYC Council Member Ydanis Rodriguez Detained in Zuccotti Raid, Urges Mass Involvement in OWS\n\nOne of the factors that fueled Thursday's huge march on the Brooklyn Bridge in New York City was the dramatic surprise police raid on Zuccotti Park earlier in the week. Among those arrested in the raid was New York City Council Member Ydonis Rodriguez. He was charged with disorderly conduct and resisting arrest, and then held in a police van alone for two hours. Rodriguez's arrest came just a week after he helped organized an 11-mile march from the his district in the Manhattan neighbhorshood of Washington Heights, a largely immigrant community, to Occupy Wall Street. He describes his ordeal in police custody and why the experience has only emboldened him to continue his involvement with the Occupy movement. &quot;We wanted to bring more black and Latino participants to the movement because we believe that this movement is not only for the college students, this movement is not only for the unemployed, it is for the working class, it is for the middle class,&quot; Rodriguez says. &quot;A block before I was arrested, there was a large number of demonstrators and I saw a potential conflict that could happen. So what I did, I moved to the east side of Broadway, where there wasn't any demonstrations going on, any rally. It was when I walked to the next block - I believe it was two blocks before the park - that's where I was stopped. I said, &quot;I am Councilman Rodriguez and I would like to keep going, walk to the park. I was pushed back, I was thrown on the floor, a police officer came from the middle of the street, he jumped on top of me.&quot;\n\n\n- Projectionists Light Up New York City Buildings, And Protesters' Spirits, With Occupy-Themed Display\n\nAs tens of thousands marched in a seemingly endless sea of people last night in downtown New York City, large words in light appeared projected onto several downtown buildings. We spoke with two of projectionists who made it happen as they stood in the streets. &quot;Sometimes you just got to claim the space that's available,&quot; says Andrew K. &quot;We can communicate with our people right on the canvas we've been given, which happens to be City Hall.&quot;\n\n\n- The Revolution Will Be Live Streamed: Global Revolution TV, the Occupy Movement's Video Hub\n\nFor the past two months, a website called Global Revolution TV has become the main video hub for the Occupy Wall Street movement. Featuring live video feeds from New York and dozens of other cities hosting Occupy protests, the site has transformed how protests are covered and observed. When OWS protesters hold a General Assembly in Zuccotti Park, the gathering is usually live streamed across the world. When police raided the park early on Tuesday, it was caught on live stream as well. We speak to one of the site's co-founders, Vlad Teichberg. He is a former derivatives trader who gave up a life in the financial world to work on video activism. &quot;This project started initially with the beginning of the New York occupation. Other, similar versions of this project had been done in the past for other actions and revolts,&quot; Teichberg says. &quot;People think of Occupy Wall Street as an American revolution. It has its roots though, in the Arab Spring, obviously, which inspired a lot of things. And it has very direct roots in the Spanish revolution.&quot;\n\n\n- Occupy Oakland Protester Pancho Ramos Stierle Faces Deportation After Arrest While Meditating\n\nThe arrest of a high-profile undocumented protester has brought immigration issues to the forefront of the movement. In California on Monday, Francisco &quot;Pancho&quot; Ramos Stierle was seized while meditating at the Oscar Grant Plaza during an early morning raid on the Occupy Oakland encampment. Rather than being released on bail, &quot;Pancho&quot; was turned over to U.S. Immigration and Customs Enforcement custody under the &quot;Secure Communities&quot; program which shares arrest information from local jails with federal immigration agents. Thousands of his supporters launched a campaign for his release, which included a Change.org petition that attracted 6,600 signatures in just 24 hours. Thursday morning, Pancho was finally released from ICE custody. &quot;Pancho&quot; joins us from Berkeley, California. &quot;Every time the people ask me, 'where you from?' I say, 'Well I'm from planet earth.' And 'Where's your citizenship?' 'Well, I'm a citizen of the world.' So that created a little bit more time, but... they have the fingerprints,&quot; he says. &quot;So at the end of the day, this is what's happening instead of using these resources for building more clinics, for fixing those bridges, for getting more schools, for having meaningful livelihood. We're using those resources, some people in the 1 percent are using those resources to harass peaceful people, to harass nonviolent people, to harass people that are looking for creating communities in harmony.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e56ec88c8e6e5332d1208687596d48c2714c4fb0","amp;dn":"Democracy+Now+-+18+nov+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e56ec88c8e6e5332d1208687596d48c2714c4fb0","infoHashBuffer":{"type":"Buffer","data":[229,110,200,140,142,110,83,50,209,32,134,135,89,109,72,194,113,76,79,176]},"announce":[],"urlList":[]}}