{"title":"Sophie Milman - In The Moonlight (2011) [FLAC]","uid":7320674,"size":349308725,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e580f1c81feeb881f248f615dd76048adb5eba81&amp;dn=Sophie+Milman+-+In+The+Moonlight+%282011%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":15,"time":1338609489,"description":"Few young vocalists have entered the jazz scene in this new century with the kind of acclaim received by the supremely talented Sophie Milman. Still in her 20s, she has now delivered her fourth album and first masterpiece, In The Moonlight.\n\nProduced by Grammy-winner Matt Pierson (Jane Monheit, Michael Franks, Joshua Redman, Kirk Whalum), this warm, witty, and altogether wonderful collection marks the first time Sophie has recorded in New York with an all-star supporting cast of jazz veterans and hot new stars: names like Randy Brecker, Chris Potter, Gerald Clayton, Julian Lage, Lewis Nash, and Kevin Hays.\n\nIt s also the first Sophie Milman collection that features arrangements for strings and larger ensembles. Once again, the list of collaborators is first class: Alan Broadbent, Rob Mounsey, and Gil Goldstein---as well as the aforementioned Gerald Clayton and Kevin Hays--- have all contributed charts.\n\nAll of this talent unites to realize an ambitious repertoire that ranges widely from standards ( Speak Low, Watch What Happens ) to show tunes ( Till There Was You ), and from Ellington/Strayhorn ( Prelude To A Kiss and Day Dream ) to Feist ( So Sorry )---with Gershwin, Gainsbourg, and Jobim added in for more than good measure.\n\nYou may have guessed that it takes a remarkable artist to pull this extraordinary music together. With a rich, sensuous voice that puts a thoroughly modern spin on the legacy of immortals like June Christy and Carmen MacRae, Sophie Milman makes her mark not just as a singer of songs, but as a complete musician whose taste and sophistication sets her alongside today s very greatest singers.","torrent":{"xt":"urn:btih:e580f1c81feeb881f248f615dd76048adb5eba81","amp;dn":"Sophie+Milman+-+In+The+Moonlight+%282011%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e580f1c81feeb881f248f615dd76048adb5eba81","infoHashBuffer":{"type":"Buffer","data":[229,128,241,200,31,238,184,129,242,72,246,21,221,118,4,138,219,94,186,129]},"announce":[],"urlList":[]}}