{"title":"Shaolin 2011 With Greek Sub","uid":6451808,"size":1473955840,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e6bccb460f3a7eab6ad72c6beb1cb07b9ccb11a7&amp;dn=Shaolin+2011+With+Greek+Sub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blaxos","files":1,"time":1307452660,"description":"An arrogant army leader is forced to take refuge with the Shaolin masters he once sought to conquer in order to defeat the ruthless warlords who are threatening to plunge the entire of country of China into chaos in this martial arts epic from director Benny Chan. As rival warlords battle for supremacy in the young republic of China, ruthless General Hou Jie (Andy Lau) and his loyal brother Huo Lung use unrelenting force to subjugate the peaceful township of Dengfeng. With thousands of wounded and dead to tend to, the Shaolin temple gracefully offers offer sanctuary to the injured masses. Meanwhile, each night when darkness falls, loyal disciples Jing Kong, Jing Neng, and Jing Hai don masks, and venture out to fight for the weak and impoverished. Upon discovering this transgression, Hao Jie challenges the temple abbot to a duel. But the general's arrogance only grows when the abbot secretly throws the fight, and allows him to win. Later when Hou Lung kills Hou Jie's entire family, the repentant leader recognizes the error of his ways, and convinces Wu Dao to teach him the secrets of Shaolin. The situation turns volatile when Hou Jie's vengeful wife Huo Lung vows to make Hou Lung pay for killing their daughter at the same time the three masked avengers decide to strike back against the merciless military leader. Later, when Huo Lung launches an all out attack on the Shaolin temple, the real fight begins.\n\n\nUnrated, 2 hr. 10 min.\n\nDrama, Action &amp; Adventure\n\nDirected By:Benny Chan\n\n\nIn Theaters: Jan 1, 2011 Wide\n\nEmperor Motion Pictures\n","torrent":{"xt":"urn:btih:e6bccb460f3a7eab6ad72c6beb1cb07b9ccb11a7","amp;dn":"Shaolin+2011+With+Greek+Sub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6bccb460f3a7eab6ad72c6beb1cb07b9ccb11a7","infoHashBuffer":{"type":"Buffer","data":[230,188,203,70,15,58,126,171,106,215,44,107,235,28,176,123,156,203,17,167]},"announce":[],"urlList":[]}}