{"title":"Betty Caroli - First Ladies: From Martha Washington to Michelle ","uid":10159457,"size":3980012,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e7710213b2d2be6a500e2262514b54c0c67c38a4&amp;dn=Betty+Caroli+-+First+Ladies%3A+From+Martha+Washington+to+Michelle+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SectorVector","files":1,"time":1400229310,"description":"\nFirst Ladies: From Martha Washington to Michelle Obama\n\nby Betty Caroli.\n\n\n# ISBN-13: 9780195392852 \n# Publisher: Oxford University Press, USA\n# Publication date: 7/15/2010\n# Edition description: Revised\n# Edition number: 4\n# Pages: 496\n# Format: PDF\n\n\nBetty Boyd Caroli's engrossing and informative First Ladies is both a captivating read and an essential resource for anyone interested in the role of America's First Ladies. This expanded and updated fourth edition includes Laura Bush's tenure, Hillary Clinton's 2008 presidential bid, and an in-depth look at Michelle Obama, one of the most charismatic and appealing First Ladies in recent history.\n\n \nCovering all forty-one women from Martha Washington to Michelle Obama and including the daughters, daughters-in-law, and sisters of presidents who sometimes served as First Ladies, Caroli explores each woman's background, marriage, and accomplishments and failures in office.\n\nThis remarkably diverse lot included Abigail Adams, whose &quot;remember the ladies&quot; became a twentieth-century feminist refrain; Jane Pierce, who prayed her husband would lose the election; Helen Taft, who insisted on living in the White House, although her husband would have preferred a judgeship; Eleanor Roosevelt, who epitomized the politically involved First Lady; and Pat Nixon, who perfected what some have called &quot;the robot image.&quot; They ranged in age from early 20s to late 60s; some received superb educations for their time, while others had little or no schooling.\n\n\nIncluding the courageous and adventurous, the emotionally unstable, the ambitious, and the reserved, these women often did not fit the traditional expectations of a presidential helpmate. \n\nHere then is an engaging portrait of how each First Lady changed the role and how the role changed in response to American culture. These women left remarkably complete records, and their stories offer us a window through which to view not only this particular sorority of women, but also American women in general. \n\n\nContents\n========\n\n1.  Setting Precedents: The First President's Wives (1789 - 1829)\n2.  Young Substitutes for First Ladies (1829 - 1869)\n3.  Three Exceptions: Sarah Childress Polk, Mary Todd Lincoln, and Julia Dent Grant\n4.  The Limited Promise of the &quot;New Woman&quot; (1877 - 1901)\n5.  The Office of the First Lady: A Twentieth Century Development\n6.  The Paradoxical 1920s\n7.  Breaking Precedents and Reaffirming Old Ones (1933 - 1961)\n8.  The Turbulent Sixties\n9.  New Dimensions to the Job of First Lady (1974 - 1993)\n10. A New Generation in the White House (1993 - 2008)\n11. Turning Points\n\n    Notes\n    Appendices\n    Index\n &lt;a href=&quot;\nhttp://www.goodreads.com/book/show/1823818.America_s_First_Ladies&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goodreads.com/book/show/1823818.America_s_First_Ladies&lt;/a&gt;\n\n-_-","torrent":{"xt":"urn:btih:e7710213b2d2be6a500e2262514b54c0c67c38a4","amp;dn":"Betty+Caroli+-+First+Ladies%3A+From+Martha+Washington+to+Michelle+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7710213b2d2be6a500e2262514b54c0c67c38a4","infoHashBuffer":{"type":"Buffer","data":[231,113,2,19,178,210,190,106,80,14,34,98,81,75,84,192,198,124,56,164]},"announce":[],"urlList":[]}}