{"title":"Democracy Now - 29 dec 2011","uid":6920033,"size":457232442,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e79446050276f4c9d10863d2184c56c2c4af89e6&amp;dn=Democracy+Now+-+29+dec+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1325178456,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 29, 2011\n\n- Monitors Face Criticism Amid Continued Syria Killings\n- U.S. Warns Iran on Threat to Close Passageway\n- U.S. to Sell Fighter Jets to Saudi Arabia\n- 35 Killed in Turkish Strike on Kurdish Area\n- U.S. Drone Program Spans Continents, Agencies\n- Afghan Soldier Kills 2 NATO Troops; U.S. Withdraws from Afghan Media Center\n- Paul, Santorum Surge in Iowa Polls\n- 10 Arrested in &quot;Occupy the Caucus&quot; Protests\n- Satellite Photos Track Expansion of Tar Sands Oil Exaction in Canada\n- Muslim Leaders Boycott Bloomberg Event Over Spying\n\n\nSpecial reports\n\n- Syrian Activist Speaks Out From Hiding As Arab League Mission Fails to Slow Deadly Crackdown\n\nSyrian troops continue to fire on protesters despite a visit by Arab League monitors to assess the Assad regime's compliance with a plan to resolve the country's political crisis. More than 5,000 people have been killed in the nine-month-long uprising. We're joined from Damascus by Bassel, a Syrian activist and filmmaker just back from the city of Homs, where three dozen people were reportedly killed the day before monitors arrived. Speaking from hiding, Bassel says the violence in Homs is threatening a civil war pitting local civilians and Army deserters against the security forces. We're also joined by Karam Nachar, a U.S.-based Syrian cyber-activist who details how he is working with Syrian protesters via social media platforms to organize and get out images of the protests and the Assad regime's crackdown.\n\n\n- North Korea's New Leader Kim Jong-un Inherits Father's Nuclear Legacy &amp; Country's Uncertain Future\n\nTens of thousands of North Koreans filled the capital Pyongyang today to attend a state funeral for their leader, Kim Jong-il, who died of heart attack on December 17 at the age of 69. Presiding over the ceremony was his son, Kim Jong-un, who is transitioning into power, and all of the top advisers spanning three generations. Our guest is Bruce Cumings, professor of history at the University of Chicago and author of several books on Korea. Speaking of North Korea's transformation into a nuclear state, Cumings says: &quot;That is essentially Kim Jong-il's only legacy, if you can call that a positive legacy... Otherwise, his 17 years are going to be seen as a period of failure.&quot; Of the ascension of Kim Jong-un, Cumings notes: &quot;In a monarchy, you don't assume that the king is running everything. The king is a symbol of the regime, and that's even more true of Kim Jong-un, than his grandfather or father. You have an enormous collection of power in the military and the party that stands behind him, and in that sense, they're running things, not Kim Jong-un.&quot;\n\n\n- Tucson Orders Closure of Mexican-American School Program as Ethnic Studies Faces Nationwide Threat\n\nAn Arizona administrator has ruled that the public school district in Tucson must end its acclaimed Mexican-American studies program for grades K-12, saying it violates a new state law that bans the teaching of any class designed for a particular ethnic group or that &quot;promote[s] resentment toward a race or class of people.&quot; But the program's supporters say the classes push the district's largely Latino student body to excel academically while teaching them long-neglected perspectives. We speak to Tucson Mexican-American history teacher Lorenzo Lopez and his daughter, Korina, a high school sophomore. Both are plaintiffs in a federal lawsuit to stop the ban from taking effect. We're also joined by Dr. Rodolfo Acuna, author of &quot;Occupied America: A History of Chicanos,&quot; considered the definitive introduction to Chicano history in the United States. Dr. Acuna warns copycat laws are likely to follow in other states as part of a growing campaign against ethnic studies programs, in particular Chicano studies, throughout the country.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e79446050276f4c9d10863d2184c56c2c4af89e6","amp;dn":"Democracy+Now+-+29+dec+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e79446050276f4c9d10863d2184c56c2c4af89e6","infoHashBuffer":{"type":"Buffer","data":[231,148,70,5,2,118,244,201,209,8,99,210,24,76,86,194,196,175,137,230]},"announce":[],"urlList":[]}}