{"title":"Fault Lines~Outsourced: Clinical Trials Overseas  07  11  2011  ","uid":6636638,"size":319332846,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e81cd481a1be92d8c92a8441fcf6b74cdeaebf19&amp;dn=Fault+Lines%7EOutsourced%3A+Clinical+Trials+Overseas++07++11++2011++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"john1942","files":1,"time":1314585861,"description":"Fault Lines~Outsourced: Clinical Trials Overseas  07  11  2011  Aljazeera \n\n\n305mb/25mns/avi\n\nAs US pharmaceutical companies move their operations abroad, India has become a testing ground for trial medicines.\n\n\nInstead of testing trial medicines on Americans, more and more of these tests are being carried out on poor people in faraway places. Russia, China, Brazil, Poland, Uganda and Romania are all hot spots for what is called clinical research or clinical trials.\n\nNow employing CROs - or clinical research organisations - the industry is big business, worth as much as $30bn today.\n\nOne country has experienced a boom like no other in this industry - India. Spoken English, an established medical infrastructure, welcoming attitudes toward foreign industry and, most importantly, legions of poor, illiterate test subjects that are willing to try out new drugs have transformed the Indian landscape into a massive testing ground for pharmaceuticals.\n\nFault Lines' Zeina Awad travels to India to see what the clinical research practices look like on the ground. What role are the US regulatory bodies playing in overseeing the trials? Are participants aware that they are taking part in a clinical trial? Is the testing being held up against international ethical standards?\n\nThe US FDA and the FBI are investigating for violations of corrupt practices laws. Will this overcome the influence of Big Pharma in American politics?\n\n\nFLV:\n\nshunster","torrent":{"xt":"urn:btih:e81cd481a1be92d8c92a8441fcf6b74cdeaebf19","amp;dn":"Fault+Lines%7EOutsourced%3A+Clinical+Trials+Overseas++07++11++2011++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e81cd481a1be92d8c92a8441fcf6b74cdeaebf19","infoHashBuffer":{"type":"Buffer","data":[232,28,212,129,161,190,146,216,201,42,132,65,252,246,183,76,222,174,191,25]},"announce":[],"urlList":[]}}