{"title":"SftpDrive.v1.7.9.Incl.Keygen","uid":4241756,"size":1628423,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e838766e0a7a2318f417068942e643753561b85a&amp;dn=SftpDrive.v1.7.9.Incl.Keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CPeanutG","files":4,"time":1213578495,"description":"[url=http://www.sftpdrive.com/][/url]\n\nDon&amp;#039;t drag and drop. Don&amp;#039;t transfer back and forth. [b]Just use your network files directly from your applications.[/b] SftpDrive network-enables all your Windows applications by enabling you to map your SSH server as a network drive. Save and edit files directly on your server. Perfect for any web developer or programmer that runs Windows, but relies on Linux.\n\nVPNs are useful. You can access your network and files from anywhere on the Internet safely and securely. But what if you don&amp;#039;t have a VPN? It can take months and thousands of dollars to install and administer a complicated VPN. [b]SftpDrive lets your applications access your files from anywhere on the Internet safely and securely, like a VPN, without the VPN.[/b]\n\n[b]SSH is the industry standard for remote access[/b] to Linux, Mac OS X, and UNIX computers because it&amp;#039;s safe, secure, and just works from anywhere on the Internet. SSH servers like OpenSSH and VShell have a powerful system called SFTP built-in. [b]Unrelated to the archaic FTP protocol, SFTP is a modern, secure system that gives you the power to treat your network files as if they were right on your desktop.[/b] Stream movies and music. Run programs. Load and save any file from any application. [b]Best of all, your SSH server is ready to go.[/b]\n\n[b]If you can SSH to a server, you can map it as an SFTP drive.[/b] Every SSH server is already setup for SFTP and so SftpDrive. Just launch SftpDrive and connect to any SSH server. All you need to know is your login and password.","torrent":{"xt":"urn:btih:e838766e0a7a2318f417068942e643753561b85a","amp;dn":"SftpDrive.v1.7.9.Incl.Keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e838766e0a7a2318f417068942e643753561b85a","infoHashBuffer":{"type":"Buffer","data":[232,56,118,110,10,122,35,24,244,23,6,137,66,230,67,117,53,97,184,90]},"announce":[],"urlList":[]}}