{"title":"Handbook of Fire and Explosion Protection Engineering Principles","uid":12543325,"size":5759621,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e89c91cbbbccde6b1ccd5b2974a2eb8d5ada01f1&amp;dn=Handbook+of+Fire+and+Explosion+Protection+Engineering+Principles&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1444430967,"description":"Handbook of Fire and Explosion Protection Engineering Principles for Oil, Gas, Chemical, and Related Facilities 2nd ed - Dennis P. Nolan (Elsevier, 2011).pdf\r\n\r\nISBN 978-1-4377-7857-1\r\n\r\nHandbook of Fire and Explosion Protection Engineering Principles: for Oil, Gas, Chemical and Related Facilities is a general engineering handbook that provides an overview for understanding problems of fire and explosion at oil, gas, and chemical facilities. This handbook offers information about current safety management practices and technical engineering improvements. It also provides practical knowledge about the effects of hydrocarbon fires and explosions and their prevention, mitigation principals, and methodologies. \r\nThis handbook offers an overview of oil and gas facilities, and it presents insights into the philosophy of protection principles. Properties of hydrocarbons, as well as the characteristics of its releases, fires and explosions, are also provided in this handbook. The book includes chapters about fire- and explosion-resistant systems, fire- and gas-detection systems, alarm systems, and methods of fire suppression. \r\nThe handbook ends with a discussion about human factors and ergonomic considerations, including human attitude, field devices, noise control, panic, and security. \r\nPeople involved with fire and explosion prevention, such as engineers and designers, will find this book invaluable.\r\nA unique practical guide to preventing fires and explosions at oil and gas facilities, based on the author’s extensive experience in the industry\r\nAn essential reference tool for engineers, designers and others facing fire protection issues\r\nBased on the latest NFPA standards and interpretations","torrent":{"xt":"urn:btih:e89c91cbbbccde6b1ccd5b2974a2eb8d5ada01f1","amp;dn":"Handbook+of+Fire+and+Explosion+Protection+Engineering+Principles","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e89c91cbbbccde6b1ccd5b2974a2eb8d5ada01f1","infoHashBuffer":{"type":"Buffer","data":[232,156,145,203,187,204,222,107,28,205,91,41,116,162,235,141,90,218,1,241]},"announce":[],"urlList":[]}}