{"title":"NBCs Red Nose Day Hosted by Craig Ferguson 2016","uid":14787423,"size":566369939,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:eac001d36736f6fd938816a5a59b1a05e1f5ce07&amp;dn=NBCs+Red+Nose+Day+Hosted+by+Craig+Ferguson+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"melbcro","files":1,"time":1465030411,"description":"Host Craig Ferguson and a star-studded cast of Hollywood favorites come together to have fun, raise money and change kids’ lives in this live Red Nose Day broadcast.\r\n\r\nNBCs.Red.Nose.Day.2016.HDTV.x264-W4F\r\nMKV | AAC VBR | 540MB\r\n\r\n\r\n\r\nIn the continued spirit of raising money to help lift children out of poverty, NBC is once again set to celebrate &quot;Red Nose Day&quot; with a two-hour television event. The second annual Red Nose Day special will air Thursday, May 26, 9:00 - 11:00 p.m. ET. Top comedy and musical performances from A-list celebrities and artists around the world will once again raise money to help lift children out of poverty. With a focus on driving change through powerful entertainment, M&amp;M'S® is returning as a presenting media sponsor, while Walgreens plans to serve as the exclusive retailer of the emblematic noses in the U.S.\r\n\r\nMoney raised during Red Nose Day will be used to fund programs that address the immediate needs of children and young people living in poverty in the U.S. and throughout the world. Money will be split between domestic and international poverty issues. Last year's inaugural Red Nose Day special raised over $23 million and was split among 12 domestic and international charities. The charities for the 2016 Red Nose Day special will be announced at a later date. Red Nose Day has been an enormously popular event in the U.K. for 30 years and is an inspiring cultural phenomenon that unites people from all walks of life in the interest of saving and changing lives across the globe.\r\n\r\nWith superstar presenters and comedians, original sketch comedy, hilarious film parodies, one-off sitcom reunions and amazing musical performances, this program has been one of the BBC's highest-rated Friday night shows for many years. Best of all, it's raised more than $1 billion in donations so far for organizations addressing poverty, and shows no signs of slowing down. Created by writer-director Richard Curtis in 1985 (&quot;Love Actually,&quot; &quot;Four Weddings and a Funeral,&quot; &quot;About Time&quot;), the idea of Red Nose Day was built upon the foundation that mass media and celebrities can help raise money and awareness of poverty to save and change millions of lives","torrent":{"xt":"urn:btih:eac001d36736f6fd938816a5a59b1a05e1f5ce07","amp;dn":"NBCs+Red+Nose+Day+Hosted+by+Craig+Ferguson+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eac001d36736f6fd938816a5a59b1a05e1f5ce07","infoHashBuffer":{"type":"Buffer","data":[234,192,1,211,103,54,246,253,147,136,22,165,165,155,26,5,225,245,206,7]},"announce":[],"urlList":[]}}