{"title":"Masons in the pulpit.mkv","uid":13276256,"size":3687894708,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ead208af6c44328e6894ac1334232301737560b9&amp;dn=Masons+in+the+pulpit.mkv&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"each1reach41","files":1,"time":1453442284,"description":"New DVD by David Bay and Mac Dominick - If your church allows Masons to fill the pulpit, or be Deacons, or Sunday School teachers, you have a very serious spiritual problem with Almighty God. The Holy Spirit has written 'Ichabod (The Glory Has Departed)' above your front door!\r\n\r\nWhile Freemasonry has successfully deceived a great many people, convincing them that Freemasonry is compatible with Christianity, God knows the Truth and is not tolerant of Masons In The Pulpit.\r\n\r\nWe begin at a very reasonable beginning premise: If a pastor refuses to resign from the Masonic Lodge he does so because he feels greater loyalty to the Lodge than to Jesus Christ.\r\n\r\nStarting from this premise, we examine a number of key Masonic teachings and then ask the Pastor how he can reconcile these teachings with Biblical Christianity. We ask, 'Mr. Pastor, when you are teaching key Biblical doctrine, are you really thinking of the radically different teaching of Freemasonry?\r\n\r\nPrime Example: Freemasonry teaches that its religion is far superior to any other religion on Earth, including Christianity. Mr. Pastor, are you thinking how superior Masonry is to Christianity when you are teaching Biblical doctrine. Second Example: Freemasonry teaches that it is necessary for Lodge leaders to deliberately lie to their people until they are 'mature enough' to comprehend and accept the truth; Mr. Pastor, when you are teaching key Biblical doctrine, are you secretly thinking that it is necessary for you to teach these 'lies' about Jesus and the God of the Bible until your people are spiritually mature to comprehend the true Masonic doctrine?\r\n\r\nWe prove that a Holy God cannot tolerate Masons in the pulpit of a church for which His Son, Jesus, bled on that cruel cross of Calvary.\r\n\r\nAlmost two hours of teaching\r\n\r\nAuthors are Mac Dominick and David Bay","torrent":{"xt":"urn:btih:ead208af6c44328e6894ac1334232301737560b9","amp;dn":"Masons+in+the+pulpit.mkv","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ead208af6c44328e6894ac1334232301737560b9","infoHashBuffer":{"type":"Buffer","data":[234,210,8,175,108,68,50,142,104,148,172,19,52,35,35,1,115,117,96,185]},"announce":[],"urlList":[]}}