{"title":"John Paul Jones (1959)Xvid 1cd - Robert Stack, Marisa Pavan [DDR","uid":11629915,"size":734547968,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eb32f2bcce3cf412372cf95a2516850c9815b589&amp;dn=John+Paul+Jones+%281959%29Xvid+1cd+-+Robert+Stack%2C+Marisa+Pavan+%5BDDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"SaM","files":-1,"time":1417667863,"description":"John Paul Jones (1959) Xvid 1cd - Robert Stack, Marisa Pavan [DDR]\n\nJohn Paul Jones is a Technicolor 1959 biographical epic film about John Paul Jones.\nThe film was made by Samuel Bronston Productions and released by Warner Bros. \nIt was directed by John Farrow and produced by Samuel Bronston from a screenplay by John Farrow, Ben Hecht, Jesse Lasky Jr. from the story Nor'wester by Clements Ripley. \nThe music score was by Max Steiner, the cinematography by Michel Kelber.\n\nThe film starred Robert Stack in the title role, Marisa Pavan, Charles Coburn, Macdonald Carey, Jean-Pierre Aumont, David Farrar, Peter Cushing, Basil Sydney, Thomas Gomez and the director's daughter Mia Farrow in her film debut. Bette Davis made a cameo appearance as Empress Catherine the Great.\n\n    CAST:-\n    Robert Stack as John Paul Jones\n    Marisa Pavan as Aimee de Tellison\n    Charles Coburn as Benjamin Franklin\n    Erin O'Brien as Dorothea Danders\n    Macdonald Carey as Patrick Henry\n    Bette Davis as Empress Catherine the Great\n    Jean-Pierre Aumont as King Louis XVI\n    David Farrar as John Wilkes\n    Peter Cushing as Captain Pearson\n    Susana Canales as Marie Antoinette\n    Bruce Cabot as Gunner Lowrie\n    John Crawford as George Washington\n    Thomas Gomez as Esek Hopkins\n\nDirected by John Farrow\nProduced by Samuel Bronston\nWritten by John Farrow, Jesse Lasky Jr., Ben Hecht\nMusic by Max Steiner\nRunning time 126 mins\n\nMOVIE PLOT:- John Paul Jones (1959)\nThe film begins with a United States Navy officer, telling sailors the story of John Paul Jones.\n\nBy age 17, John Paul (Robert Stack), a native of Scotland, is an experienced ship's navigator. In 1773, nine years later, he is master of a ship in the West Indies, but after an incident that results in the governor of Tobago advising him to leave, John Paul adds the surname Jones and goes to visit a brother who lives in Fredericksburg, Virginia.\nThe brother has recently died. Jones hires his attorney, Patrick Henry (Macdonald Carey), to assist in business matters. He also takes a romantic interest in Henry's sweetheart, Dorothea Danders (Erin O'Brien).\nAfter serving as second-in-command of a man-of-war in the Bahamas, his adopted countrymen sign the American Declaration of Independence. Jones gets his first command, sets sail toward Newfoundland and seizes eighteen enemy ships, sending their supplies to American general George Washington (John Crawford).\nWashington sends the young officer to France, where he is appreciated for heroic feats at sea. Benjamin Franklin (Charles Coburn) then urges Jones to take a frigate and invade the British Isles. A new vessel is built for him at the suggestion of Marie Antoinette (Susana Canales), and the only condition of his majesty King Louis XVI (Jean-Pierre Aumont) is that Jones' ship fly under an American flag.\nJones' successes ultimately lead him to Russia in 1790 at the behest of the empress, Catherine the Great (Bette Davis). He returns to Paris ill.\nA dying Jones, begins to dictate to Aimee (Marisa Pavan), the type man and training to be given a future United States Navy officer. The final scenes showing the present day (1959) Midshipmen of the United States Naval Academy at Annapolis, Maryland. Admiral John Paul Jones gains acclaim as one of the most brave and daring naval figures of his time and in the United States Navy of all time.\n\nIn his review of the film for the New York Times, Bosley Crowther observed: &quot;Stack performs the knotty little Scotsman as though he were a slightly dull but talkative member of a conservative gentleman's club.&quot;\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 578 kbps\nVideo Resolution: 640x272\nVideo Aspect Ratio: 2.353:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 126 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:eb32f2bcce3cf412372cf95a2516850c9815b589","amp;dn":"John+Paul+Jones+%281959%29Xvid+1cd+-+Robert+Stack%2C+Marisa+Pavan+%5BDDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb32f2bcce3cf412372cf95a2516850c9815b589","infoHashBuffer":{"type":"Buffer","data":[235,50,242,188,206,60,244,18,55,44,249,90,37,22,133,12,152,21,181,137]},"announce":[],"urlList":[]}}