{"title":"New Warriors v4","uid":7319392,"size":214912267,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ebfcf56427ee3b47dbf70626575d45c6551def96&amp;dn=New+Warriors+v4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SmokeBogey","files":-1,"time":1338580026,"description":"The New Warriors was originally compiled by writer/editor Tom DeFalco, consisting of the young superheroes Nova, Speedball, Namorita, Marvel Boy, and Firestar, all of whom were once featured in solo series or were supporting characters in more established series. To this mix DeFalco added Night Thrasher, an original character to serve as the team's founder and leader.   The first volume was cancelled after 75 issues.  The second volume relaunch lasted only 11 issues.  The third volume was a six issue miniseries that led to the Marvel Civil War.\n\nThe fourth volume of the New Warriors is one of the new team books debuting out of Civil War.  The new team has one returning member from the original group, (Night Thrasher), while everyone else is new to the team.\n\nThe series is written by Kevin Grevioux, writer of the film Underworld, with Paco Medina as the artist. The series made its debut in June 2007. Editor Axel Alonso has further mentioned that the team will be made up of &quot;superheroes you already know, sporting new superhero identities&quot;.\n\n Nearly everyone in this new incarnation of the team is a depowered mutant and includes Sofia Mantega, (the de-powered mutant formerly known as Wind Dancer), Night Thrasher who is the original's illegitimate half-brother, Donyell Taylor, and characters Wondra (Jubilation Lee, formerly known as the X-Man Jubilee), Tempest (Angel Salvadore, a former student of the Xavier Institute), , Blackwing (Barnell &quot;Barry&quot; Bohusk, formerly known as Beak),Decibel (Jonothan &quot;Jono&quot; Starsmore, formerly known as Chamber), siblings Longstrike (Christine Cord, formerly known as Tattoo) and Phaser (Christian Cord, formerly known as Radian), Skybolt (Vincent &quot;Vin&quot; Stewart, formerly known as Redneck), and Ripcord (Miranda Leevald, formerly known as Stacy X).\n\n The group uses stolen and reverse-engineered technology (with the help of supporting teammates Grace and Kaz), such as a shrinking formula based on Bill Foster's derivative of Pym Particles, Spider-Man's webbing, Stilt-Man's telescopic legs and arms, and Wakandan technology in their war on crime. Their current hideout is a former Murderworld location. ","torrent":{"xt":"urn:btih:ebfcf56427ee3b47dbf70626575d45c6551def96","amp;dn":"New+Warriors+v4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebfcf56427ee3b47dbf70626575d45c6551def96","infoHashBuffer":{"type":"Buffer","data":[235,252,245,100,39,238,59,71,219,247,6,38,87,93,69,198,85,29,239,150]},"announce":[],"urlList":[]}}