{"title":"A History of Ethiopia by Marcus, Harold.pdf","uid":7598425,"size":3909006,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecc0eadc2335eceacb420ac4079af7a6bface932&amp;dn=A+History+of+Ethiopia+by+Marcus%2C+Harold.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1346754714,"description":"I began writing this book in January 1986, and I fully anticipated its completion within six months.  Although I knew much of the story, I discovered that I needed to learn more. Many new books and articles had to be perused, and not a few old works had to be reread. Moreover, ongoing civil conflict raised the question of what Ethiopia was. Several of the &quot;liberation movements&quot; argued against\nEthiopia as a nation, defining it as an obsolete empire-state, a prison house of peoples. Though I was  predisposed toward the Ethiopia I had studied since the late 1950s, I appreciated that within its frontiers were a variety of peoples.\nThe Tigray and the Amhara of highlands Eritrea, Tigray, Welo, Gonder, Shewa, and Gojam are the  inheritors and avatars of Orthodox Christianity and its political traditions. \n\nThey use plows to cultivate grains, and they also herd cattle, sheep, and goats. Their primary affiliation is to the Orthodox church,\nand they are loosely organized into parishes. Priests and itinerant holy men keep the banner of Christianity high and drill their auditors to believe in their moral and religious superiority. The clerics have kept alive the myth of a Christian empire whose origins go back to Axum and even to King  Solomon's Israel.","torrent":{"xt":"urn:btih:ecc0eadc2335eceacb420ac4079af7a6bface932","amp;dn":"A+History+of+Ethiopia+by+Marcus%2C+Harold.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecc0eadc2335eceacb420ac4079af7a6bface932","infoHashBuffer":{"type":"Buffer","data":[236,192,234,220,35,53,236,234,203,66,10,196,7,154,247,166,191,172,233,50]},"announce":[],"urlList":[]}}