{"title":"Handbook of Chiral Chemicals 2nd ed - David Ager","uid":15357020,"size":21150714,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eccaa7c7b6e982be096fec4535a18bb14bd53064&amp;dn=Handbook+of+Chiral+Chemicals+2nd+ed+-+David+Ager&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1468982021,"description":"Handbook of Chiral Chemicals 2nd ed - David Ager (CRC, 2006).pdf\r\n\r\nISBN 978-1-57444-664-7\r\n\r\nAs pharmaceutical companies look to develop single enantiomers as drug candidates, chemists are increasingly faced with the problems associated with this subclass of organic synthesis. &quot;The Handbook of Chiral Chemicals, Second Edition&quot; highlights the problems associated with the production of chiral compounds on a commercial scale. The handbook first elaborates upon starting materials obtained from a 'chiral pool', which can be derived from natural products. Then it explains methods and reactions that can introduce or influence stereogenic centers, particularly asymmetric hydrogenations, oxidations, pericyclic reactions, and enzymatic methods.While hydrogenations have been the most widely employed approach for the large-scale synthesis of several commercial compounds, the search for the ideal catalyst has consistently led researchers to enzymes present in biological systems. Several chapters concentrate on understanding how to manipulate enzymes for catalyzing new reactions for taking new substrates. Other significant topics include chiral auxiliaries, chromatographic techniques, enantiomers-specific reactions, and resolution. This second edition updates all its chapters, illustrating the speed of development in this field, and features new chapters that highlight successful approaches in an industrial setting. &quot;The Handbook of Chiral Chemicals, Second Edition&quot; is a guide to advances in the field that result in more efficient and cost-effective synthesis of chiral chemicals","torrent":{"xt":"urn:btih:eccaa7c7b6e982be096fec4535a18bb14bd53064","amp;dn":"Handbook+of+Chiral+Chemicals+2nd+ed+-+David+Ager","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eccaa7c7b6e982be096fec4535a18bb14bd53064","infoHashBuffer":{"type":"Buffer","data":[236,202,167,199,182,233,130,190,9,111,236,69,53,161,139,177,75,213,48,100]},"announce":[],"urlList":[]}}