{"title":"Inuit Art - An Introduction (Art Ebook).pdf","uid":10207321,"size":36860401,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee0def3ce1388f4ab4515389c47fd8f3ff5f542e&amp;dn=Inuit+Art+-+An+Introduction+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1400864247,"description":"1998 / pdf / English / 35MB / 216p / \n\nThe Inuit of the Canadian Arctic have created a contemporary art form that is recognized and appreciated around the world for its power and exquisite beauty, an art that embodies the harsh arctic environment and a unique way of life, as well as traditional myths and beliefs. Engaging and authoritative, Inuit Art: An Introduction explores Inuit art from historical, cultural and aesthetic perspectives. The engrossing story begins with an outline of the roots of Inuit art in prehistoric times and through the historical period that began with the arrival of Europeans in the sixteenth century. The emergence of Inuit art as we know it came about in the late 1940s, partly through the encouragement of writer and artist James Houston, who also introduced printmaking to Inuit artists. Inspired by his support, Inuit artists quickly brought their art to life, attracting a wide audience almost overnight, and they have continued to develop and refine their work over the past fifty years. To enrich our understanding of the art, Ingo Hessel also provides descriptions of techniques and materials.","torrent":{"xt":"urn:btih:ee0def3ce1388f4ab4515389c47fd8f3ff5f542e","amp;dn":"Inuit+Art+-+An+Introduction+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee0def3ce1388f4ab4515389c47fd8f3ff5f542e","infoHashBuffer":{"type":"Buffer","data":[238,13,239,60,225,56,143,74,180,81,83,137,196,127,216,243,255,95,84,46]},"announce":[],"urlList":[]}}