{"title":"Worms Blast Game Disc Image","uid":4695136,"size":93091840,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:eedf5d9d69decadda532d598c185464c46d0eef1&amp;dn=Worms+Blast+Game+Disc+Image&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nickfreckle","files":1,"time":1233527517,"description":"Preheat your PC to a comfortable temperature before inserting the Worms Blast disc and lightly fluff your seat before settling down for the main course.\n \nOnce comfortable, take the big chunk of puzzle-styled gameplay and slice into 60 fun-sized missions. Sprinkle with a fiendishly challenging puzzle mode, and mix in a tasty tournament mode, not forgetting to include the unlockable hidden features. Spread this mixture over a multiplayer head-to-head game guaranteeing fun for yourself and your friends, and allow to simmer....\n \nWhen enjoyment is boiling, add in a generous helping of entertaining characters, boat-based silliness, fog, sea monsters, and falling anvils. Add bazookas, dynamite and unprecedented destruction to taste.\n \nThis recipe should serve a truly hefty helping of fun!\n \nGeneral\nWorms Blast takes place on water which is lucky really as your character only has a boat to get around in. Above you, coloured blocks move closer to you every so often. Fortunately you can shoot the blocks to destroy them, however your weapon is colour coded and you must hit blocks of the same colour as your weapon to destroy them. Hitting a block of different colour from that of your weapon will recolour it (and the surrounding blocks) to the weapon's colour. If you destroy a block, blocks of the same colour touching the destroyed block will also be destroyed.\n \n1 &amp; 2 player action\nThe single player game tests your skill and nerve in a series of solo puzzle-solving levels while the 2 player game pits you against another human or computer controlled player. In 2 player games, the play area is separated by a divider. This divider opens every so often to allow you to attack the other player with your weapons, which is nice!\n \nCharacter Control\nControlling your character is simple. LEFT and RIGHT move the boat, UP and DOWN alter the trajectory of the character's weapon and FIRE fires the current weapon. The SWAP WEAPON button toggles between your standard weapon (i.e. Bazooka) and any special weapons you have picked up from crates.\n \nGameplay\nThe gameplay in Worms Blast is dependant on the game type and mode you select. There are 3 different game types - Puzzle, Tournament and Vs (versus). The game modes within these different games dictate the rules of play i.e. what you have to do to win. For details of these, see the [ ABOUT ] section.","torrent":{"xt":"urn:btih:eedf5d9d69decadda532d598c185464c46d0eef1","amp;dn":"Worms+Blast+Game+Disc+Image","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eedf5d9d69decadda532d598c185464c46d0eef1","infoHashBuffer":{"type":"Buffer","data":[238,223,93,157,105,222,202,221,165,50,213,152,193,133,70,76,70,208,238,241]},"announce":[],"urlList":[]}}