{"title":"Jaime Hernandez - Ghost of Hoppers (Love and Rockets)","uid":7720028,"size":86869352,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ef67f9d5680f731e3c9af512fa1db26c680243ad&amp;dn=Jaime+Hernandez+-+Ghost+of+Hoppers+%28Love+and+Rockets%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1350041208,"description":"'Ghost of Hoppers'\n\nFantagraphics Books, 2006, 120 pages\n\nWritten and Illustrated by Jaime Hernandez\n\n\nGhost of Hoppers collects for the first time the new adventures of Maggie Chascarrillo, as serialized in the Love &amp; Rockets comic book, and represents Jaime Hernandez's much-anticipated follow-up to his critically acclaimed 2004 magnum opus Locas, which Entertainment Weekly gave an 'A' for its &quot;innovative technique and complex, character-driven stories about Mexican-American life.&quot;\n\nGhost of Hoppers begins with the newly divorced Maggie now working as the resident building-manager of the notorious Capri Apartments deep in the heart of the San Fernando Valley, where imaginary dogs roam its walkways at night, all the air conditioners are broken, and the empty swimming pool is covered with flies. As if the eccentric, oddball tenants weren't weird enough, Maggie's houseguest and old friend Izzy Ortiz shakes things up with her usual nervous breakdowns, nocturnal screaming, and obsessive fly-swatting (sometimes with a knife!). When Izzy makes a guest appearance on a local cable access talk show to promote her book, Maggie meets the voluptuous Vivian the &quot;Frogmouth,&quot; a curvaceous, hapless bombshell with a foghorn voice who is despised by Hopey (Maggie's long time on-again-off-again girlfriend, now a bartender sporting an eye patch after one of Vivian's previous bottle-breaking altercations). Maggie finds herself swept up in Vivian's life of random catfights, her mob-connected, knife-wielding stalker ex-boyfriend, and his violently jealous fiancee. Maggie and Vivian eventually strike up a reluctant and awkward romance, and when they set out for Hoppers to retrieve a stolen art object from Izzy, they get a lot more than they bargained for!\n","torrent":{"xt":"urn:btih:ef67f9d5680f731e3c9af512fa1db26c680243ad","amp;dn":"Jaime+Hernandez+-+Ghost+of+Hoppers+%28Love+and+Rockets%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef67f9d5680f731e3c9af512fa1db26c680243ad","infoHashBuffer":{"type":"Buffer","data":[239,103,249,213,104,15,115,30,60,154,245,18,250,29,178,108,104,2,67,173]},"announce":[],"urlList":[]}}