{"title":"She Stoops To Conquer by Oliver Goldsmith from Heritage Theatre ","uid":10232158,"size":1888071631,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ef892a0d082f0dcc641697d53c0b547b06e42020&amp;dn=She+Stoops+To+Conquer+by+Oliver+Goldsmith+from+Heritage+Theatre+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loninappleton","files":3,"time":1401144395,"description":"She Stoops to Conquer by Oliver Goldmith (2009)\nHeritage Theater productions\n\nPresented in Two Parts at intermission\n\nTotal runtime:  139 minutes\n\nCast\n\n \tNigel Cooke, Christopher Staines, Ian Redford, Stephen Beresford, Owen Sharpe, Matthew Sim, Jason Watkins, Jane Wood, Monica Dolan, Fritha Goodey, Bella Merlin.\n\nSummary \t\n\n  &quot;Oliver Goldsmith's classic comedy of manners tells of the clever schemes and comic ruses that unfold one night at a country house. An ambitious step-mother, impassioned sweethearts, a pragmatic father and a pair of star-crossed suitors are sent spinning through a hilarous comedy of errors by one of the great characters of the stage, Tony Lumpkin.&quot; -- Container.\n\nRecording date\n\n  &quot;This production was first performed on September 12, 2002 at the Oxford Playhouse, and opened at the National Theatre on December 17, 2002. It was recorded at the Theatre Royal, Bath on April 8 &amp; 9, 2003.&quot; -- Container\n\nCredits \t\n\nDesigner, Julian McGowan ; \nmusic, Paddy Cunneen ; \nchoreographer, Wendy Allnutt ; \ncameras, Tim Capp, Andy Macdonald, Keith Bradshaw, Stephen Reid.\n\n  My notes\n\n  This production, unlike most of my torrents from the Shakespeare's Globe releases, shows a small interior setting  as it might have appeared in one of the enclosed theaters of a slightly later period.  The viewer can judge if he or she likes the style. Here, as in the Globe productions there is a bit of interplay with the audience.  The play includes a Prologue newly written and performed which is fun for it's own sake.\n\n\n Played in an initmate theater the &quot;She Stoops To Conquer&quot; gives a suggestion of what is possible in the new Wanamaker Jacobean Playhouse on the reconstructed Globe Theatre site  (first season: 2014.)  This new playhouse is entirely lit by candlelight.\n\n  Back to the play;  the camera credits are very important.  It is an interpretation of the live setting and so requires special note.\n\n\n  Notes written May 26, 2014\n\n  \n","torrent":{"xt":"urn:btih:ef892a0d082f0dcc641697d53c0b547b06e42020","amp;dn":"She+Stoops+To+Conquer+by+Oliver+Goldsmith+from+Heritage+Theatre+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef892a0d082f0dcc641697d53c0b547b06e42020","infoHashBuffer":{"type":"Buffer","data":[239,137,42,13,8,47,13,204,100,22,151,213,60,11,84,123,6,228,32,32]},"announce":[],"urlList":[]}}