{"title":"Chess Blues (2 CD)  Chess Blues Rock Songbook (2CD)","uid":7913057,"size":139442219,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f08efd39b272aa46c5c8054e69c3303ec8e27d99&amp;dn=Chess+Blues+%282+CD%29++Chess+Blues+Rock+Songbook+%282CD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jazznbluz","files":63,"time":1355273239,"description":"Chess Blues is a superlative four-CD box set featuring important tracks by all the main stars of the label (Muddy Waters, Howlin' Wolf, Little Walter, Sonny Boy Williamson), as well as much previously unreleased material. A well-done retrospective of Chicago blues in its heyday, as recorded by America's greatest blues label, Chess. \n\n\nWhile Chess Records' legacy as a dominating and shaping force on rock &amp; roll is well chronicled, you don't really get the full range of it until you're ultimately confronted with the music itself. This two-disc, 36-track compilation drives that point home with an almost numbing intensity. Whether they're blues tunes that have been covered so many times they now are staples of everyone's set list (Muddy Water's &quot;I'm Your Hoochie Coochie Man,&quot; &quot;I Just Want to Make Love to You&quot;; Bo Diddley's &quot;I'm a Man&quot;; or Howlin' Wolf's &quot;Back Door Man&quot;), classics waiting to be covered (&quot;More and More,&quot; &quot;Bring It On Home,&quot; &quot;Ice Cream Man&quot;), or early rock classics themselves (&quot;Rock and Roll Music,&quot; &quot;Johnny B. Goode,&quot; &quot;Susie-Q,&quot; &quot;See You Later Alligator&quot;), Chess seems to have laid the first set of musical footprints in the snow. No mere publishing sampler, this is an essential piece of rock &amp; roll history and a great primer for ground-floor roots music enthusiasts. \n","torrent":{"xt":"urn:btih:f08efd39b272aa46c5c8054e69c3303ec8e27d99","amp;dn":"Chess+Blues+%282+CD%29++Chess+Blues+Rock+Songbook+%282CD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f08efd39b272aa46c5c8054e69c3303ec8e27d99","infoHashBuffer":{"type":"Buffer","data":[240,142,253,57,178,114,170,70,197,200,5,78,105,195,48,62,200,226,125,153]},"announce":[],"urlList":[]}}