{"title":"Efrat Ben-Zeev - Shadows of War. A Social History of Silence in ","uid":9997917,"size":2322450,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f0b0550cafbba478cdebad8e0570cff6a3d41cee&amp;dn=Efrat+Ben-Zeev+-+Shadows+of+War.+A+Social+History+of+Silence+in+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1397943763,"description":"Description\nProduct details\nBook Title: Shadows of War: A Social History of Silence in the Twentieth Century\t\nBook Author: Efrat Ben-Ze'ev (Editor), Ruth Ginio (Editor), Jay Winter (Editor)\nHardcover: 234 pages\nPublisher: Cambridge University Press; 1 edition (25 Feb 2010)\nLanguage: English\nISBN-10: 0521196582\nISBN-13: 978-0521196581\n\nBook Description\nPublication Date: 25 Feb 2010\nSilence lies between forgetting and remembering. This book explores how different societies have constructed silences to enable men and women to survive and make sense of the catastrophic consequences of armed conflict. Using a range of disciplinary approaches, it examines the silences that have followed violence in twentieth-century Europe, the Middle East, and Africa. These essays show that silence is a powerful language of remembrance and commemoration and a cultural practice with its own rules. This broad-ranging book discloses the universality of silence in the ways we think about war through examples ranging from the Spanish Civil War and the Israeli-Palestinian conflict to the Armenian Genocide and South Africa's Truth and Reconciliation Commission. Bringing together scholarship on varied practices in different cultures, this book breaks new ground in the vast literature on memory, and opens up new avenues of reflection and research on the lingering aftermath of war.\n\nReviews\n&quot;...Shadows of War is worth reading...&quot; -Matthew B. Holmes, Military Review\n\n&quot;This collection of essays provides an innovative contribution to broadening the evaluation of silence as cultural practice by analyzing it across different conflict zones where memory is contested and history is troubled.&quot; -Angus Mitchell, Canadian Journal of History\n\n&quot;Shadows of War assembles well-written essays of a consistently high standard. It goes a considerable way towards achieving its goal of shifting the focus away from the prevalent remembering-versus-forgetting binary towards an appreciation of what we might see as an intermediate position of silence. That is no mean feat.&quot; -Bill Niven, European History Quarterly\n\nBook Description II\nBreaking new ground in the vast literature on memory, this book explores the ways that different societies have constructed silences to enable them to survive and make sense of the catastrophic consequences of armed conflict. It examines the silences that have followed violence in Europe, the Middle East, and Africa.\n\nAbout the Editors\nEfrat Ben-Ze'ev is Senior Lecturer in Anthropology at the Department of Behavioral Sciences, Ruppin Academic Center, Israel. She has published on Palestinian-Arab and Jewish-Israeli memories of the war of 1948.\nRuth Ginio is Lecturer in History at Ben Gurion University of the Negev and a research fellow at the Harry S. Truman Research Institute for the Advancement of Peace in Jerusalem. Her recent publications include French Colonialism Unmasked: The Vichy Years in French West Africa (2006) and Violence and Non-Violence in Africa (as co-editor, 2007).\nJay Winter is Charles J. Stille Professor of History at Yale University. He is the author of Sites of Memory, Sites of Mourning: The Great War in European Cultural History (1995), and War and Remembrance in the Twentieth Century (as editor, with Emmanuel Sivan, 1999).\n","torrent":{"xt":"urn:btih:f0b0550cafbba478cdebad8e0570cff6a3d41cee","amp;dn":"Efrat+Ben-Zeev+-+Shadows+of+War.+A+Social+History+of+Silence+in+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0b0550cafbba478cdebad8e0570cff6a3d41cee","infoHashBuffer":{"type":"Buffer","data":[240,176,85,12,175,187,164,120,205,235,173,142,5,112,207,246,163,212,28,238]},"announce":[],"urlList":[]}}