{"title":"The Island on Bird Street (1997) aka &quot;Øen i Fuglegad","uid":8874077,"size":4543153477,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f191a82eb87ad903087fd48ef2e42ddc78f85680&amp;dn=The+Island+on+Bird+Street+%281997%29+aka+%26quot%3B%26Oslash%3Ben+i+Fuglegad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Ubehage","files":-1,"time":1378145461,"description":"The Island on Bird Street (1997) aka &quot;Ã˜en i Fuglegaden&quot; NTSC\n------------------------------------------------------------\n&quot;Hope was his strength, imagination was his refuge.&quot;\n\nIMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0119389/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0119389/&lt;/a&gt;\n\nAudio: English (2.0 Stereo)\n\nSubs: Spanish\nSubs for the hard of hearing: English\n\nExtra materials:\n- Previews.\n\n\nPlot outline:\nDuring World War II, twelve year old Alex, his father Stefan, their Uncle Boruch and Alex's pet mouse Snow live in Warsaw in the Jewish ghetto, around which the Nazis have erected a fence so that no one can get out. The Polish Jews live their daily lives in the bombed out ghetto, but go into hiding whenever the Nazi soldiers come for what they call the selection process when truckloads of Jews are hauled away to an unknown future. Alex's family is one of the last in the ghetto, when the Nazis come to haul all remaining Jews away. Previously discussed amongst themselves, Alex manages to escape from the Nazis before he can be taken away. Alex is supposed to hide in the ghetto, with Stefan vowing that he will eventually come back for him. As Alex lives alone in the ghetto, he has to use his resourcefulness to find food and potable water, and to find a suitable hiding place for whenever the Nazis come looking for any remaining Jews. He also has to assess who he can and cannot trust amongst the handful of remaining people who are also hiding out in the ghetto. After he meets and befriends two other hiding Jews named Freddy and Henryk, Alex is shown a secret tunnel leading out of the ghetto into unfenced Warsaw. Alex has to make the decision to go to the safer unfenced zone, where the likelihood of ever seeing Stefan again is slim to none, or to stay in the ghetto and the thought of reuniting with Stefan but with the understanding that the Nazis will eventually demolish the ghetto.","torrent":{"xt":"urn:btih:f191a82eb87ad903087fd48ef2e42ddc78f85680","amp;dn":"The+Island+on+Bird+Street+%281997%29+aka+%26quot%3B%26Oslash%3Ben+i+Fuglegad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f191a82eb87ad903087fd48ef2e42ddc78f85680","infoHashBuffer":{"type":"Buffer","data":[241,145,168,46,184,122,217,3,8,127,212,142,242,228,45,220,120,248,86,128]},"announce":[],"urlList":[]}}