{"title":"Everly Brothers - Roots (a forgotten classic album) 1968 - FLAC","uid":6432607,"size":222386769,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f1aa3ec47d74450eb03f4a0a84186ba18986f3ea&amp;dn=Everly+Brothers+-+Roots+%28a+forgotten+classic+album%29+1968+-+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Skyppys","files":15,"time":1306705263,"description":"The Everly Brothers' &quot;Roots&quot; is a lost American classic. Not only did The Everly Brothers influence groups like the Beatles and the Byrds, but this album, recorded in Los Angeles in 1968, was one of the very first country-rock albums, and influenced scores of country-rock artists such as the Flying Burrito Brothers, the Eagles, CSNY, Poco, and to an extent the Gratfeul Dead.\n\n&quot;Roots&quot; showcases the Everlys in all their vocal glory, and should be purchased along with the Byrds' &quot;Sweetheart of the Rodeo&quot;, Jerry Lee Lewis' &quot;Another Place, Another Time&quot;, Elvis' 1968 comeback special, any Merle Haggard album, and the double-issue CD of Rick Nelson's &quot;Bright Lights/Country Fever&quot; (which was actually recorded in 1966 and 1967).\n\nThe Everlys clearly were soaking in the example of groups like Bob Dylan, the Byrds and Love, and those musical footprints are all over this album. First of all, it's a concept album, couched in the style of an old-time country radio show featuring Dad and Mom Everly, 15-year-old Don and 13-year-old Phil. Interspersed between short snippets of those mono recordings of the teenaged Everlys are 11 stereo recordings of the golden Everly vocals, surrounded by a gorgeous psychedelic soundscape, very much like the Byrds (who, incidentally, I'm coming to respect more and more by the day). Their cover of Jimmie Rodgers' &quot;T For Texas&quot;, and the segue into an updating of their old hit &quot;I Wonder If I Care As Much&quot;, is of fantastic production value.\n\nAnother favorite here is &quot;Living Too Close To The Ground&quot;, which was written by Don and features him alone on voacls. Clearly, the guy was a big Love fan. Although it's a bit dated, the song is so heartfelt and so unlike anything the Everly Brothers had ever done before.\n\nHowever, the Everlys did not succumb to musical trends on this album. Don and Phil's incredible two-part harmonies are never better, and they're doing songs by Jimmie Rodgers, Merle Haggard and Glen Campbell. The Everly Brothers melded country music and rock and roll into a remarkable brew on &quot;Roots&quot;, spiced with psychedelic production touches here and there. It's phenomenal.\n\nThe album itself died on the charts, but this definitely qualifies as An Album To Come Back To. Hopefully, this album will continue to get the recognition it so deserves. ","torrent":{"xt":"urn:btih:f1aa3ec47d74450eb03f4a0a84186ba18986f3ea","amp;dn":"Everly+Brothers+-+Roots+%28a+forgotten+classic+album%29+1968+-+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1aa3ec47d74450eb03f4a0a84186ba18986f3ea","infoHashBuffer":{"type":"Buffer","data":[241,170,62,196,125,116,69,14,176,63,74,10,132,24,107,161,137,134,243,234]},"announce":[],"urlList":[]}}