{"title":"Statistics for Chemical and Process Engineers - A Modern Approac","uid":13930844,"size":12260327,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f251e80cc0774eeaedb6c0e8a475b3761dbca183&amp;dn=Statistics+for+Chemical+and+Process+Engineers+-+A+Modern+Approac&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1458419750,"description":"ISBN 978-3-319-21508-2\r\n\r\nA coherent, concise and comprehensive course in the statistics needed for a modern career in chemical engineering; covers all of the concepts required for the American Fundamentals of Engineering examination.\r\n\r\nThis book shows the reader how to develop and test models, design experiments and analyse data in ways easily applicable through readily available software tools like MS Excel® and MATLAB®. Generalized methods that can be applied irrespective of the tool at hand are a key feature of the text.\r\n\r\nThe reader is given a detailed framework for statistical procedures covering:\r\n\r\n· data visualization;\r\n\r\n· probability;\r\n\r\n· linear and nonlinear regression;\r\n\r\n· experimental design (including factorial and fractional factorial designs); and\r\n\r\n· dynamic process identification.\r\n\r\nMain concepts are illustrated with chemical- and process-engineering-relevant examples that can also serve as the bases for checking any subsequent real implementations. Questions are provided (with solutions available for instructors) to confirm the correct use of numerical techniques, and templates for use in MS Excel and MATLAB can also be downloaded from extras.springer.com.\r\n\r\nWith its integrative approach to system identification, regression and statistical theory, Statistics for Chemical and Process Engineers provides an excellent means of revision and self-study for chemical and process engineers working in experimental analysis and design in petrochemicals, ceramics, oil and gas, automotive and similar industries and invaluable instruction to advanced undergraduate and graduate students looking to begin a career in the process industries","torrent":{"xt":"urn:btih:f251e80cc0774eeaedb6c0e8a475b3761dbca183","amp;dn":"Statistics+for+Chemical+and+Process+Engineers+-+A+Modern+Approac","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f251e80cc0774eeaedb6c0e8a475b3761dbca183","infoHashBuffer":{"type":"Buffer","data":[242,81,232,12,192,119,78,234,237,182,192,232,164,117,179,118,29,188,161,131]},"announce":[],"urlList":[]}}