{"title":"Tarbox Ramblers - A Fix Back East [2004][EAC,log,cue. FLAC]","uid":8736090,"size":270076073,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f2ddbd29a5208919b31b39f0c5ada9f817d4e5f6&amp;dn=Tarbox+Ramblers+-+A+Fix+Back+East+%5B2004%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":14,"time":1374686243,"description":"Artist: Tarbox Ramblers\nRelease: A Fix Back East\nReleased: 2004\nLabel: Rounder\nCatalog#: 11661-9061-2\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: swamp blues,blues\n\n1\tAlready Gone\t\n2\tWere You There?\t\n3\tCountry Blues\t\n4\tA Fix Back East\t\n5\tNo Night There\t\n6\tHoney Babe\t\n7\tCloth of Gold\t\n8\tThe Shining Sun\t\n9\tFrom the Algiers Station\t\n10\tLast Month of the Year\t\n11\tAshes to Ashes\n\nFour years ago, when the Tarbox Ramblers introduced their train wreck of swamp blues, hillbilly, gospel, and woolly folk, the North Mississippi Allstars, Black Keys, Fiery Furnaces, or that Detroit band with the funny clothes, weren't even blips on the screen. Now they're the competition. It's OK, it's a big world, and with A Fix Back East, the Tarbox Ramblers go down into the deep reaches of their frontman's collective American Gothic psyche, and dredge up the ghosts, the faded photographs, the myths and texts of a time that may never have existed in the popular consciousness. This is a much wilder record; yet it's very rawness contains starkly beautiful textures that are drenched in sepia-toned images, and black and white newsreels from the focal point of the ravaged human heart. The album opens with a huge, R.L. Burnside-styled barroom record machine groove. Using the riff from &quot;Honey Hush,&quot; and warping it all to hell, Michael Tarbox indulges his iconographic marriage of rural loneliness, backwater holiness, and steaming sex, which, immediately after is dragged through a drunkenly redemptive version of &quot;Were You There (When They Crucified My Lord?)&quot; where violins, electric guitars, and echoing drums from time immemorial try to match the grief and longing in Tarbox's convicted voice. But it's right back to hell in the band's caveman read of Dock Boggs' &quot;Country Blues,&quot; with a roiling slide guitar all nasty and distorted, like it was calling from the devil's playground. And this is where it all starts. From the elegiac loss and shimmer of the title track, to the backwoods two-step of the American traditional song, &quot;No Night There,&quot; to the murderous gutter blues of &quot;Honey Babe,&quot; this is a slash and burn affair that holds it secrets close, and offers its dirty treasures abundantly and regally -- if the parades in Robert Frank's The Americans are your idea of majesty. Produced by Jim Dickinson, Paul Q. Kolderie, and Sean Slade, this is the banshee's howl after all the liquor is gone; it's the drunken, lascivious, preacher's moan when he's still in the whorehouse at seven a.m. on Sunday morning; a dying bluesman's final snarl at a world that's left him empty and broke, and a brokenhearted cowboy's last lament -- all rolled into one","torrent":{"xt":"urn:btih:f2ddbd29a5208919b31b39f0c5ada9f817d4e5f6","amp;dn":"Tarbox+Ramblers+-+A+Fix+Back+East+%5B2004%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2ddbd29a5208919b31b39f0c5ada9f817d4e5f6","infoHashBuffer":{"type":"Buffer","data":[242,221,189,41,165,32,137,25,179,27,57,240,197,173,169,248,23,212,229,246]},"announce":[],"urlList":[]}}