{"title":"Alex Jones Show - 2012 Nov 15 TH [sebaygo1]","uid":7830620,"size":69989370,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f434e5873bf54134a601cdd21de6ba7e0d4c7c7e&amp;dn=Alex+Jones+Show+-+2012+Nov+15+TH+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":11,"time":1353043903,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nThursday, 15 Oct 2012\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site ::\n\nAlex Jones will break down what the exploding secessionist movement really means and the federal government's plan to crush the states and sideline their rights guaranteed under the Constitution and the Tenth Amendment. Constitutional lawyer Edwin Vieira, Jr. will examine the different angles on the burgeoning movement and Alex will give you the key to true secession and how it can lead to true restoration of the Republic. We will also cover the historic farewell speech by Rep. Ron Paul on this Thursday, November 15 edition of the Alex Jones Show.\n\nAfter the broadcast was over, the posted show description was changed to this:\n\nToday on the syndicated radio broadcast, Alex Jones laid out a constitutional plan to have the states secede, not to destroy the Union, but to reconstitute it because the federal government admits it is now run by foreign special interest powers and has been conquered. Over the three hour show, he had constitutional lawyers, Lew Rockwell and others on who concurred with his analysis. We are going to Ron Paul to ask him to lead this movement at the states. We will soon have a transcript of Alex's constitutional battle plan.\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n","torrent":{"xt":"urn:btih:f434e5873bf54134a601cdd21de6ba7e0d4c7c7e","amp;dn":"Alex+Jones+Show+-+2012+Nov+15+TH+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f434e5873bf54134a601cdd21de6ba7e0d4c7c7e","infoHashBuffer":{"type":"Buffer","data":[244,52,229,135,59,245,65,52,166,1,205,210,29,230,186,126,13,76,124,126]},"announce":[],"urlList":[]}}