{"title":"Horace Silver - 1962 - Paris Blues (2002) FLAC","uid":8399451,"size":222760105,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f4e907203914db1c3de27de83403cf3b9070e35f&amp;dn=Horace+Silver+-+1962+-+Paris+Blues+%282002%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1366657806,"description":"Horace Silver - 1962 - Paris Blues (2002)\n\nHorace Silver is not only important because of his contributions as a pianist/composer; he's also been a first-rate talent scout (much like Miles Davis, Chick Corea, and Art Blakey). From Donald Byrd to Joe Henderson to Tom Harrell, so many of Silver's sidemen have come to be recognized as serious jazz heavyweights. The hard bopper led his share of five-star groups -- especially in the '50s and '60s -- but if any one Silver combo went down in history as his most important, it was the 1959-1964 quintet with trumpeter Blue Mitchell, tenor saxman Junior Cook, bassist Gene Taylor, and drummer Roy Brooks. And that cohesive group is the one that Silver leads on Paris Blues, which contains previously unreleased performances from an October 6, 1962, appearance at the Olympia Theater in Paris. The concert was a Norman Granz presentation, and like a lot of Granz-produced concerts, it was taped. However, the recording remained in the can for 40 years, and didn't see the light of day until Fantasy released Paris Blues on Pablo in 2002. Pablo is an appropriate place for the CD because Pablo, like Verve, is a label that Granz founded. Silver's quintet is in good form during an hourlong set that boasts extended performances of &quot;Filthy McNasty,&quot; &quot;Doin' the Thing,&quot; and &quot;Where You At&quot; as well as &quot;The Tokyo Blues&quot; and &quot;Sayonara Blues.&quot; All of the tunes last at least ten minutes, and &quot;Sayonara Blues&quot; lasts no less than 16 minutes -- no one can claim that Silver and his sidemen don't have enough room to stretch out. Paris Blues isn't quite essential, but it's still an enjoyable hard bop CD that Silver's more devoted fans will welcome with open arms. (AllMusic)\n\nTrack list:\n01 - Introductions By Norman Granz And Horace Silver\n02 - Where You At\n03 - The Tokyo Blues\n04 - Filthy Mcnasty\n05 - Sayonara Blues\n06 - Doin' The Thing\n\nSplit with Medieval CUE Splitter.\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:f4e907203914db1c3de27de83403cf3b9070e35f","amp;dn":"Horace+Silver+-+1962+-+Paris+Blues+%282002%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4e907203914db1c3de27de83403cf3b9070e35f","infoHashBuffer":{"type":"Buffer","data":[244,233,7,32,57,20,219,28,61,226,125,232,52,3,207,59,144,112,227,95]},"announce":[],"urlList":[]}}