{"title":"Microsoft Office Enterprise 2007- English- Serial Included","uid":4264538,"size":585250430,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f500f99690c1404d00a36b355f0b5d350dcc14ea&amp;dn=Microsoft+Office+Enterprise+2007-+English-+Serial+Included&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"i_plead_the_5th","files":249,"time":1214625093,"description":"Microsoft Office 2007 is the most recent version for Windows of the Microsoft Office system, Microsofts productivity suite.\nIt was made available to retail customers on January 30, 2007.\n\nAll files have been scanned with Avira.\nNo viruses, trojans, malware, or spyware.\n\nSome of the new features include: \n\n--The new user interface (UI), has been implemented in the core Microsoft Office applications: Word, Excel, PowerPoint, Access, and in the item inspector used to create or edit individual items in Outlook.\n\n--The Office 2007 button, located on the top-left of the window, replaces the File menu and provides access to functionality common across all Office applications, including opening, saving, printing, and sharing a file.\n\n--Live Preview, a feature that temporarily applies formatting on the focused text or object when any formatting button is moused-over. The temporary formatting is removed when the mouse pointer is moved from the button. This allows users to have a preview of how the option would affect the appearance of the object, without actually applying it.\n\n--The Quick Access toolbar, which sits in the title bar, serves as a repository of most used functions, regardless of which application is being used, such as save, undo/redo and print. The Quick Access toolbar is customizable, although this feature is limited compared to toolbars in previous Office versions. Any command available in the entire Office application can be added to the Quick Access toolbar, including commands not available in the Ribbon and macros. Keyboard shortcuts for any of the commands on the toolbar are also fully customizable, similar to previous Office versions.\n\nand many many more features... This program is a must have.","torrent":{"xt":"urn:btih:f500f99690c1404d00a36b355f0b5d350dcc14ea","amp;dn":"Microsoft+Office+Enterprise+2007-+English-+Serial+Included","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f500f99690c1404d00a36b355f0b5d350dcc14ea","infoHashBuffer":{"type":"Buffer","data":[245,0,249,150,144,193,64,77,0,163,107,53,95,11,93,53,13,204,20,234]},"announce":[],"urlList":[]}}