{"title":"Richard Flook &amp; Karl Dawson - Meta-Medicine &amp; EFT - 9 DVDs","uid":5528674,"size":7443705210,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f518e646a5c9b2428755af7d2931aa810ad6c1cb&amp;dn=Richard+Flook+%26+Karl+Dawson+-+Meta-Medicine+%26+EFT+-+9+DVDs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tast","files":12,"time":1272864600,"description":"Richard Flook and Karl Dawson - Meta-medicine and EFT Matrix reimprinting\n\nIf there was a marriage made in heaven between two health disciplines, meta-Medicine and EFT Matrix Reimprinting is it.\n\nmeta-Medicine is NOT a therapy but an amazing diagnostic system that allows you to determine the specific event that causes an illness.\n\nmeta-Medicine was developed by medical doctors and health practitioners worldwide and through the use of modern CT imaging it has mapped the trapped emotional conflicts that get stuck in the brain and specific organs to their original stressful cause.\n\nFinally it answers how and why certain symptoms are there, what caused them;\nwhy do specific organs and the brain uniquely react to certain stressful events.\n\nUsing meta-Medicine with EFT you can get to these trapped emotional conflicts quicker and with more accuracy than just intuitively chasing the emotion.\n\nmeta-Medicine works by asking targeted questions in conjunction with brain mapping, the aim is to quickly determine the root cause of a client's illness, diagnose exactly where they are in their disease cycle and as a result design a 'road map' so you as the EFT practitioner deliver the right tapping sequence in the right order.\n\nYou therefore can masterfully assist in relieving pain and symptoms simply and easily by using amazing reframes that actually talk directly to the purpose behind the symptoms.\n\nThen get to the root cause of the problem with lightning speed and additionally solve complex chronic issues by knowing what to tap on with your client; reassuringly knowing where, when and why you are tapping at that point.\n\nAs an EFT practitioner meta-Medicine gets you right to the cause of your client's issue, making your work even more accurate, allowing you to get deep into the psychology and biology behind the disease and therefore you to achieve even better results.\n\nUnlike other diagnostic systems, meta-MedicineÃ‚Â® does not require guesswork, intuition or a leap of faith to determine the root cause of a disease\n\nBelow are just a fraction of the things you will learn from the DVDs:\n\n* The theory behind Matrix Reimprinting\n* See meta-Medicine and Matrix Reimprinting live in action with clients with issues such as Pain, IBS, skin conditions and Bipolar disorder\n* Why EFT works so well with meta-medicine and what EFT does to conflict shocks in the brain and the organs\n* Discover how to find the root causes of all the major diseases in our Western culture.\n* Learn how to find the original buried conflict shock that caused the disease using EFT paradigms.\n* The process of a disease and why it is there, plus what to tap on and when.\n* Use some of the meta-Medicine organ reframes to get behind the cause of a disease.\n* The possibilities of solving mania and depression.\n* Why some diseases just keep recurring like eczema and what to do to ensure they go.\n* What are the triggers that cause a disease and how to use EFT to interrupt them so a disease is stopped in its tracks.\n* How to apply EFT to simple issues like spots, IBS, Muscle ache, ear infections and other minor ailments.\n* See lots of demonstrations and plenty of practical applications and exercises plus lots, lots more","torrent":{"xt":"urn:btih:f518e646a5c9b2428755af7d2931aa810ad6c1cb","amp;dn":"Richard+Flook+%26+Karl+Dawson+-+Meta-Medicine+%26+EFT+-+9+DVDs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f518e646a5c9b2428755af7d2931aa810ad6c1cb","infoHashBuffer":{"type":"Buffer","data":[245,24,230,70,165,201,178,66,135,85,175,125,41,49,170,129,10,214,193,203]},"announce":[],"urlList":[]}}