{"title":"Cant Stop Wont Stop Hoarding S01E01 720p HDTV x264-C4TV","uid":9651803,"size":1181611783,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:f57f1aee946cb4f0561bff51cad080882aa5d479&amp;dn=Cant+Stop+Wont+Stop+Hoarding+S01E01+720p+HDTV+x264-C4TV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".SceNe.","files":1,"time":1393089279,"description":"Title: Cant Stop , Wont Stop Hoarding\nSource: HDTV\nResolution: 1280 x 720\nFramerate: 25 FPS\nVideo Codec: X264\nAudio: AC3 @ 384kbps 48KHz\nLink: http://www.channel5.com/shows/cant-stop-wont-stop-hoarding\n\nDESCRiPTiON\n\nTwo of the recognised causes of hoarding are loss of a loved one and growing up\nwith a family member who hoards. Cardiff based 82 year-old Brian has experienced\nboth. His mother was a hoarder and when his wife died almost 20 years ago his\nhoarding habit began in earnest. His three-bedroom home has a well-kept, tidy\ngarden but step inside and clutter and chaos is taking over every room. From\npieces of old shoes to boxes of supermarket magazines and obsolete TVs, Brian\nbelieves everything he has kept has a purpose and a use, however since breaking\nhis back from falling off a ladder in the garden his daughter has decided to\ntake control. But getting him to agree to throw anything away is going to prove\nharder than even getting around the house. Over in Florida 74 year-old Sandy is\nan extreme hoarder. Despite the pristine exterior of her home every single surface\nwithin is littered with rubbish. After having a heart attack, Sandy couldn t\nbear to throw anything away, she slipped into a way of life that no one was aware\nof. Eventually though a friend uncovered her secret and called in help. A\nspecialist team of cleaners come to clear the house, but as they move piles\nof rotting debris they discover more than just the odd cockroach and in the\nkitchen there are some rather disturbing things amidst the mounds of coffee\nfilters and out of date food\nFinally we meet Paul. The 52 year-old Bristolian has been cultivating his hoarding\nhabit for 14 years and it s not only his flat that is full to the brim; his van\nand his two cars are packed with all sorts too. Paul has been seeing his girlfriend\nSharon for six months, and we join them as she comes to visit his flat for the\nfirst time. Despite her arrival he hasn t cleared much out and it is so packed\nthat to show her around the whole flat they have to leave through the front door\nand go round to the back door, just to access his kitchen. Will this be the\nwake-up call he needs and will she stick around to see the end of his hoarding days?\n\nEnjoy!","torrent":{"xt":"urn:btih:f57f1aee946cb4f0561bff51cad080882aa5d479","amp;dn":"Cant+Stop+Wont+Stop+Hoarding+S01E01+720p+HDTV+x264-C4TV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f57f1aee946cb4f0561bff51cad080882aa5d479","infoHashBuffer":{"type":"Buffer","data":[245,127,26,238,148,108,180,240,86,27,255,81,202,208,128,136,42,165,212,121]},"announce":[],"urlList":[]}}