{"title":"Prison Architect - Alpha 6 (Mac) (.zip)","uid":8098659,"size":88835996,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:f58a3097cd30e2c103c212ed9a7efb45f26494f0&amp;dn=Prison+Architect+-+Alpha+6+%28Mac%29+%28.zip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dwarth","files":1,"time":1359913170,"description":"Alpha 6 introduces prisoner risk categories with coloured uniforms to reflect this. Prisoners now have a criminal history and are classified according to perceived risk, however this is an ESTIMATE and may not be accurate - you'll still need to keep a close eye on the little darlings! We've also adjusted the prisoner intake settings to allow even more customisation of the game.\n\n\n= Prisoner Categories\nAll prisoners are now classified based on their risk level - Min, Normal, or Max.\nPrisoner uniforms are coloured to reflect this: Grey, Orange and Red respectively.\nNote: The Category of a prisoner is an ESTIMATE of their risk level,\nbased on their convictions. However their true risk is determined by their TRAITS\n\n= Prisoner Traits, 'Rap Sheet' &amp; Criminal History\nAll prisoners now have Bios that detail their criminal history, length of time in jail etc\nClick on any prisoner to review his Rap Sheet.\nPrisoners have (internal) traits which determine if they are violent, destructive etc\nThese traits determine the Prisoner's likely response to their needs not being met\n\n= New Sector Categories\nYou can now set sectors to be used for MinSec or MaxSec prisoners in the deployment screen.\nNote: This only affects prisoners cell assignment. They currently share all other rooms.\nMaxSec or MinSec prisoners without cell space will overflow into the shared (White) sectors.\nA Holding Cell is required as temporary housing to facilitate cell changes\n\n= Intake Control\nYou can now control the intake of new inmates from the 'Prisoners Report' screen.\nYou can choose which categories you are open to, or stop receiving any new prisoners.\nNote: Unavailable if 'Continuous Intake' is enabled; You will receive a random mixture\n\n= The hunt for Stuck Prisoners \nSeveral subtle bugs have been fixed which resulted in prisoners becoming stuck, shackled,\npushed into the wall, forgotten, or trapped in hospital beds. (Guards sometimes as well)\nPrisoners who are trapped will now be escorted back to their cells by a guard.\nNote: All entities need to be healed before they will be let out the medical ward, and \nPrisoners need to have a cell to be taken back to.\n\n- There is now some variation in the physical size of prisoners. Higher Risk prisoners tend to be larger\n\n- Doctors will now heal injured people around them more reliably (within range 10 sq)\n\n- The tape measure dragging sounds will no longer play unless you are laying out construction orders\n\n- Building frameworks now look more 3d and cast shadows when under construction\n\n- Links have been added to the Main Menu to access the latest version, legal terms &amp; conditions and buy page\n\n- Fixed a bug which allowed prisoners to glitch through doors when they were trying to escape,\nmaking it quite a bit easier for them to succeed\n\n- Fixed: The game would crash on loading or selecting a saved prison, if that prison had a\nthumbnail image of width or height &gt; 2048 pixels. (Happens if you are running at higher res, eg Retina)\n\n- Fixed: You can no longer callout unlimited numbers of firemen\n\n- Fixed: A dead or unconscious firemen will no longer drop/spawn his firehose continuously\t\t\t","torrent":{"xt":"urn:btih:f58a3097cd30e2c103c212ed9a7efb45f26494f0","amp;dn":"Prison+Architect+-+Alpha+6+%28Mac%29+%28.zip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f58a3097cd30e2c103c212ed9a7efb45f26494f0","infoHashBuffer":{"type":"Buffer","data":[245,138,48,151,205,48,226,193,3,194,18,237,154,126,251,69,242,100,148,240]},"announce":[],"urlList":[]}}