{"title":"audioboek Kluun de Weduwnaar (Dutch) 2Lions-Team","uid":5886814,"size":197872027,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f592b6b2626328e8a5d048d5b53e274ba274ef9f&amp;dn=audioboek+Kluun+de+Weduwnaar+%28Dutch%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1287085569,"description":"audioboek Kluun de Weduwnaar       \n\n\nBeschrijving\nNa de dood van zijn vrouw Carmen, dompelt Stijn zich onder in het uitgaansleven van Amsterdam en Ibiza. Aan rouwen komt hij nauwelijks toe. Tot hij met zijn dochtertje naar de andere kant van de wereld vertrekt, voor een rondreis met een gehuurde camper. Geconfronteerd met zichzelf - en met zijn dochter - begint Stijn zijn verlies te verwerken en gaat hij op zoek naar de betekenis van liefde.\nDe weduwnaar gaat verder waar het spraakmakende debuut Komt een vrouw bij de dokter (150.000 exemplaren verkocht, in acht landen vertaald) eindigde. Geschreven in de typische Kluun-stijl: direct, vol humor en bovenal nietsontziend.\nKluun (1964) is schrijver en columnist. Naast zijn romans schreef hij het vaderschapsboek Help, ik heb mijn vrouw zwanger gemaakt.\n'Kluun gebruikt woorden als mokerslagen.' - Martin Simek \n\nNBD|Biblion recensie\nDeze roman begint waar Kluuns bestseller 'Komt een vrouw bij de dokter'* eindigde. Stijns vrouw Carmen lijdt aan borstkanker en sterft, een gebeurtenis die zijn leven volkomen overhoop gooit. Haar dood, zijn emoties als hij weduwnaar is geworden, de confrontatie met zichzelf en zijn dochtertje en de spanningen tussen hen beiden zijn de belangrijkste onderwerpen van deze zeer autobiografische geschiedenis. Hij gaat met zijn dochtertje op reis, op zoek naar een ander, een nieuw leven, op zoek naar nieuwe liefde. De ambivalente Stijn leeft voortdurend tussen goed en kwaad. Zijn meanderen tussen trouw en ontrouw heeft iets aandoenlijks. Deze roman leest gemakkelijk, de stijl is soepel en direct; de structuur is helder en doorzichtig. De schrijver weet de losgeslagen Stijn en diens vrienden en vooral vriendinnen met al hun (on)hebbelijkheden aannemelijk neer te zetten. Ook ironie en (zelf)spot ontbreken niet. Het boek leest als een trein. Naast het boek verscheen een soundtrack, ook onder de titel 'De weduwnaar', met nummers van Moby, Doe Maar, De Dijk e.a., die een belangrijke rol spelen in de roman. Levendige typografie; vrij kleine letter.\n\n\n\nSpotinformatie \nCategorie : Geluid \nFormaat : MP3 \nBron : Anders\n \nBitrate : Anders\n \nGenre : Anders\n \nWeblink : http://www.bol.com/nl/p/nederlandse-boeken/de-weduwnaar/1001004002598943/index.html \n\n \n*****************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons Forum \n                           &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt;  \n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nTo the fakers Get a Live\n \n \n \n","torrent":{"xt":"urn:btih:f592b6b2626328e8a5d048d5b53e274ba274ef9f","amp;dn":"audioboek+Kluun+de+Weduwnaar+%28Dutch%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f592b6b2626328e8a5d048d5b53e274ba274ef9f","infoHashBuffer":{"type":"Buffer","data":[245,146,182,178,98,99,40,232,165,208,72,213,181,62,39,75,162,116,239,159]},"announce":[],"urlList":[]}}