{"title":"LinearX LEAP 4.6 Loudspeaker Enclosure Analysis Program","uid":15403361,"size":1773511,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f7ea3b6c7c0632893043a1b0e02ea07a9f2960e6&amp;dn=LinearX+LEAP+4.6+Loudspeaker+Enclosure+Analysis+Program&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1469481089,"description":"Runs in DOS or 32-bit Windows or via DOSBox etc.  Fully cracked version.\r\n\r\nInfo from: http://stonessoundstudio.com.au/stone/leap_4.htm\r\n\r\nLEAP Version 4.6 is the complete full range speaker system analysis package which doesn't just stop at predicting dead-on accurate responses for exotic box designs. LEAP includes an open-architecture circuit simulator for passive network analysis/optimization, an active filter modeler/optimizer, mid and high frequency general transducer modeling, the ability to import data from computer-based test equipment (including LMS, MLLSA, TEF, and AP), plus a large array of powerful utilities. The spectrum of features is unequalled in any other mere box design program.\r\n\r\nThe art and science of loudspeaker system development today has become more complex than ever before. Competition is tough, and to compete each design must perform to the best of its ability, and make the most out of every dollar's worth of transducer cost. The simple approach of choosing a combination of seemingly appropriate transducers coupled with ordinary networks and filters, has given way to a painstaking process of meticulously blending selected transducers in combination with carefully devised and matched crossover designs.\r\n\r\nLEAP (Loudspeaker Enclosure Analysis Program) is a complete full range analysis package which provides virtually all of the tools necessary to develop precision loudspeaker systems, for today's demanding audio markets. Whether your applications are consumer audio, car stereo, professional audio, or custom esoteric marvels, LEAP provides the power, flexibility, and accuracy to investigate every possible design permutation. The open architecture and broad spectrum of features provided will dramatically reduce your development time, while improving the quality of the final result... and demonstrates why LEAP has become the #1 choice of professional loudspeaker designers world-wide!\r\n\r\nLEAP Features\r\n\r\nLEAP 4.6 contains a wide assortment of capabilities that pertain to transducer design, enclosure design, passive network design, active filter design, as well as complete system design. Advanced utilities are also provided which greatly aid in the design process.\r\n\r\nComplete Importing and Exporting of data is also supported in a variety of formats. These include data communication to and from other hardware and software. Indeed, LEAP can be fully utilzed as a data format translator between various hardware and/or software tools that do not support direct communication.\r\n\r\nExcellent graphics print routines are provided in LEAP, which are not merely screen dumps. An additional side benefit for imported data, is that the print routines of LEAP can be used to produce output on devices not supported by the originating hardware or software. The output devices supported indude dot matrix printers, laser printers, photo typesetters, and pen plotters. Regardless of the output device, all graphs can be produced in either of two orientations, and at any size or aspect ratio.\r\n\r\n \r\n\r\nThe resulting analysis output data in LEAP comprises a total of 19 graphs, each with 2 curves per graph. These graphs show a tremendous amount of information about the designs including SPL on-axis response, SPL Power response, transducer impedance, network input impedance, to port air volumes and velocities.\r\n\r\nIn addition, there are many preview graphs within various sections of the program that display local results of various sub-systems within LEAP.\r\n\r\nTransducer Modeling and Analysis\r\n- Conventional Speaker Model, Motor Z Model\r\n- Parameter Correlation Check\r\n- General Models for Dynamic, Ribbon, Piezo\r\n- Non Linear: BL, Compliance, Motor Model\r\n\r\nEnclosure Modeling and Analysis\r\n- Sealed or Vented HighPass and BandPass\r\n- Passive Radiators at any port location\r\n- Compound Speaker Mounting\r\n- Multiple Spkrs &amp; Ports, Mutual Coupling\r\n- Wiring: Series, Parallel, or Series/Parallel\r\n- Time Offset Specification, Non Linear Port\r\n\r\nPassive Network System\r\n- General Circuit Simulator, High Speed Nodal\r\n- Component Activate On/Off\r\n- 22 Components per Entry\r\n\r\nActive Filter System\r\n- LPF1, HPF1, APF1, LPF2, HPF2, APF2\r\n- Shelv-EQ-LP, Shelv-EQ-HP, Shelv-EQ-BP, Delay\r\n- 16 Filters per Entry\r\n\r\nDesign Compilation\r\n- Large Signal Analysis\r\n- Design Parameter Select, Entry Selection\r\n\r\nGraph Displays\r\n- Cursor Readouts, Relative/ Absolute Modes\r\n- Entry Info Display, Corrective Filter Mode\r\n\r\nImport Data\r\n- MLLSA,TEF,APS1,GDT\r\n- Correction, and Scaling, Impedance Translation\r\n- Extrapolate, Interpolate, Any number of Points\r\n\r\nExport Data\r\n- XOPT,APS1,GDT\r\n- Any Number of Points, Export any Graph\r\n\r\nUtilities\r\n- Quick Cabinet, Crossover Network, Conjugates\r\n- Impedance Calculator, Motor Coef Calculator\r\n- Speaker Parameter Measurement\r\n\r\nOutput/Printer System\r\n- Dot Matrix 9 Pin/ 24 Pin, HPGL Plotter, HPLJ II Laser, PostScript Laser\r\n- Scale/Aspect Graphs, Spool File to Disk\r\n\r\nSystem Control\r\n- Color Maps for Screens, System Parameters\r\n- Video: CGA/ HGC/ EGA/ VGA/ Etc\r\n- Frequency Ranges: 6- 1Hz to 100KHz\r\n- Data Libraries, File System Managers\r\n\r\nLEAP Graphs\r\n\r\nLEAP 4.6 produces a very complete set of design graphs containing a tremendous amount of acoustical and electrical information covering virtually all aspects of the design.\r\n\r\nUp to 5 different designs can be displayed simultaneously. This feature can be used for comparison of different design trials, or for different ranges in the context of system design. In this case, each design selected for display represents a single range of a multiway system","torrent":{"xt":"urn:btih:f7ea3b6c7c0632893043a1b0e02ea07a9f2960e6","amp;dn":"LinearX+LEAP+4.6+Loudspeaker+Enclosure+Analysis+Program","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7ea3b6c7c0632893043a1b0e02ea07a9f2960e6","infoHashBuffer":{"type":"Buffer","data":[247,234,59,108,124,6,50,137,48,67,161,176,224,46,160,122,159,41,96,230]},"announce":[],"urlList":[]}}