{"title":"Principles of Polymerization 4th ed - George Odian","uid":12433756,"size":11237816,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8107df18ad415c1b683d4b6f98447c481069360&amp;dn=Principles+of+Polymerization+4th+ed+-+George+Odian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1442489917,"description":"Principles of Polymerization 4th ed - George Odian (Wiley, 2004).pdf\n\nISBN 0-471-27400-3\n\nThe new edition of a classic text and reference\nThe large chains of molecules known as polymers are currently used in everything from &quot;wash and wear&quot; clothing to rubber tires to protective enamels and paints. Yet the practical applications of polymers are only increasing; innovations in polymer chemistry constantly bring both improved and entirely new uses for polymers onto the technological playing field. Principles of Polymerization, Fourth Edition presents the classic text on polymer synthesis, fully updated to reflect today's state of the art. New and expanded coverage in the Fourth Edition includes: \n* Metallocene and post-metallocene polymerization catalysts\n* Living polymerizations (radical, cationic, anionic)\n* Dendrimer, hyperbranched, brush, and other polymer architectures and assemblies\n* Graft and block copolymers\n* High-temperature polymers\n* Inorganic and organometallic polymers\n* Conducting polymers\n* Ring-opening polymer ization\n* In vivo and in vitro polymerization\nAppropriate for both novice and advanced students as well as professionals, this comprehensive yet accessible resource enables the reader to achieve an advanced, up-to-date understanding of polymer synthesis. Different methods of polymerization, reaction parameters for synthesis, molecular weight, branching and crosslinking, and the chemical and physical structure of polymers all receive ample coverage. A thorough discussion at the elementary level prefaces each topic, with a more advanced treatment following. Yet the language throughout remains straightforward and geared towards the student.\nExtensively updated, Principles of Polymerization, Fourth Edition provides an excellent textbook for today's students of polymer chemistry, chemical engineering, and materials science, as well as a current reference for the researcher or other practitioner working in these areas","torrent":{"xt":"urn:btih:f8107df18ad415c1b683d4b6f98447c481069360","amp;dn":"Principles+of+Polymerization+4th+ed+-+George+Odian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8107df18ad415c1b683d4b6f98447c481069360","infoHashBuffer":{"type":"Buffer","data":[248,16,125,241,138,212,21,193,182,131,212,182,249,132,71,196,129,6,147,96]},"announce":[],"urlList":[]}}