{"title":"Fight to Win: 20 Simple Techniques That Will Win Any Fight [2013","uid":9094236,"size":20631466,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f81418e095ab320621095371ea8ff55b708641ff&amp;dn=Fight+to+Win%3A+20+Simple+Techniques+That+Will+Win+Any+Fight+%5B2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1382649030,"description":"Fight to Win: 20 Simple Techniques That Will Win Any Fight [2013][Martin Dougherty][mobi/epub][INFERNO]\nFight to Win: 20 Simple Techniques That Will Win Any Fight by Martin Dougherty\n\n\nFormat: mobi/epub\nLength: 192 pages (many photographs)\nGenre: Non-Fiction/Martial Arts\nDate: 8 October 2013\n\nFight to Win strips self-defense and street fighting tactics down to the basics, presenting a uniquely effective fighting system with a minimum of technical jargon and maximum effect.\n\nMartin Dougherty holds three black belts and has spent more than two decades training championship fighters in many discipline. Dougherty is committed to teaching men and women of all skill levels and incorporates specialized programs tailored to the physically disadvantaged and those with disabilities. Drawing upon his broad-based expertise, Dougherty presents twenty simple fighting techniques guaranteed to give the you the advantage in any fight. Whether used in competition or on the street, these fighting techniques are virtually unbeatable.\n\nIn addition to step-by-step photos, Fight to Win offers easy-to-follow instructions and additional notes on combat psychology and tactics to help you hone a fighter's instincts. Fight techinques include:\n\nThe Hammerfist - delivered by straightening a bent arm and striking with the base of the fist.\nThe Double Leg Takedown - will make the opponent land so hard he'll be stunned and unable to defend himself.\nThe Triangle Choke - uses the opponent's arm and shoulder to cut off the blood supply to the brain and more!\n\nAuthor:\n\nMartin J. Dougherty is a Master Instructor with the Self-Defence Federation, holds three black belts and is professionally qualified as a fencing coach. He has more than 20 years of experience as a sports instructor and has written or contributed to more than 50 books. He has trained championship fencers, kickboxers and martial artists in many disciplines, and has taught self-defense for a wide range of applications including female attack victims and individuals with severe physical disabilities. He lives in the United Kingdom.","torrent":{"xt":"urn:btih:f81418e095ab320621095371ea8ff55b708641ff","amp;dn":"Fight+to+Win%3A+20+Simple+Techniques+That+Will+Win+Any+Fight+%5B2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f81418e095ab320621095371ea8ff55b708641ff","infoHashBuffer":{"type":"Buffer","data":[248,20,24,224,149,171,50,6,33,9,83,113,234,143,245,91,112,134,65,255]},"announce":[],"urlList":[]}}