{"title":"Anger Management(2003)DVDRip.AC3(ENG)-DROCK","uid":6071904,"size":734392320,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f86b1e6a6264565cf7136fccb57782ffb49fbd38&amp;dn=Anger+Management%282003%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"drock232","files":1,"time":1293660639,"description":"A man comes face to face with the rage he didn't know he had in this comedy. Dave Buznick (Adam Sandler) is an even-tempered businessman who, after a series of strange misunderstandings on an airline flight, finds himself accused of air rage. A judge sentences Dave to undergo anger management therapy, and he soon finds himself in the care of Dr. Buddy Rydell (Jack Nicholson), a celebrated therapist. However, Dave's group therapy sessions with a handful of truly disturbed individuals -- among them jumpy ex-con Chuck (John Turturro), obsessive sports fan Nate (Jonathan Loughran), slow-burning Lou (Luis Guzman), egocentric Andrew (Allen Covert), and bisexual porn stars Gina and Stacy (Krista Allen and January Jones) -- leave him far more unsettled than when he arrived. Later, when Buddy decides to move into Dave's home for intensive therapy, he soon discovers Buddy has more than a bit of his own anger to resolve, and that no one brings out Dave's deeply buried inner rage quite like Buddy. Anger Management also stars Marisa Tomei as Dave's girlfriend, Linda; in addition, the film features a number of notable actors in cameos, including Woody Harrelson, John C. Reilly, Ray Liotta, Heather Graham, and Harry Dean Stanton. \n\nRipped with DVD Decrypter and Autogk. \n\n(I'm having problems with bayimg right now trying to upload photos  for the torrents its just going to a page when I hit upload with no code for the image tag if anyone could shed some light on this please feel free to leave a comment thank you)","torrent":{"xt":"urn:btih:f86b1e6a6264565cf7136fccb57782ffb49fbd38","amp;dn":"Anger+Management%282003%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f86b1e6a6264565cf7136fccb57782ffb49fbd38","infoHashBuffer":{"type":"Buffer","data":[248,107,30,106,98,100,86,92,247,19,111,204,181,119,130,255,180,159,189,56]},"announce":[],"urlList":[]}}