{"title":"Flash MP3 Player Builder 2.6.15 Crk StreeTTe@M","uid":4174429,"size":1951850,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f9328f83f02745a631fba99edf21e768e2358456&amp;dn=Flash+MP3+Player+Builder+2.6.15+Crk+StreeTTe%40M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Irish32","files":1,"time":1210041034,"description":"Flash MP3 Player Builder (formerly MP3 to SWF Converter)\n\nBatch convert MP3 and WAV to small Flash SWF without losing quality, generate Flash MP3 Player for your website and blog (MySpace, Google Blog, MSN Blog and all other popular blogs) with ease.\n  \t\t\t\n \nAdd music on your website, blogs and CDROM today!\n\n    * On your web site\n    * On your MySpace, MSN Space and Google BlogSpot page\n    * On your blogs (works in all blogs that accept Flash)\n    * In your CDROM\n\nSkins (Click to View More Flash Player Skins)\nFlash MP3 Player Generator Examples\n\nNot just a Flash MP3 Player, why convert MP3 and WAV files to Adobe Flash SWF files?\n\n    * By re-encoding audio data with different parameters, you can convert a large MP3 or WAV file to a small SWF file without losing quality. Size of a five minutes music MP3 is usally 6Mbit, but size of the corresponding Flash SWF can be as small as 600Kbit, that&amp;#039;s, 10 percent of the MP3 size. The smaller size means your visitors only need a shorter waiting time for the music playing.\n    * Unlike MP3 file, Flash SWF audio file is compatible with all browsers. It will stream through firewall, will never be blocked.\n    * Unlike Quick Time or Windows Media Player, nearly every web browser has the free Flash player installed, your visitors do not need to download and install a plugin.\n    * Instantly running: does not need any extra hardware or software, upload Flash SWF file to your website, it&amp;#039;s ready for listening.\n","torrent":{"xt":"urn:btih:f9328f83f02745a631fba99edf21e768e2358456","amp;dn":"Flash+MP3+Player+Builder+2.6.15+Crk+StreeTTe%40M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9328f83f02745a631fba99edf21e768e2358456","infoHashBuffer":{"type":"Buffer","data":[249,50,143,131,240,39,69,166,49,251,169,158,223,33,231,104,226,53,132,86]},"announce":[],"urlList":[]}}