{"title":"The Invention of Italy   (BBC 2013 - Complete Series)","uid":9205856,"size":80761284,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f9a01279133f1a1621250b2b2a5487016dc5a650&amp;dn=The+Invention+of+Italy+++%28BBC+2013+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robin1966","files":6,"time":1384694600,"description":"The Invention of Italy\n\nMisha Glenny presents a history of Italy, from 1494 to the end of the First World War\n\nWith expert contributions from Christopher Duggan, Marco Meriggi, Leoluca Orlando, Lucy Riall, Lucy Hughes-Hallet, Filippo de Vivo, David Gilmour, Beppe Severgnini, Simon Winder, Joze Serbec and David Laven.\n\nEpisode 1\n\nPiedmont, the Venetian Republic, Mantua, Modena, the Grand Duchy of Florence, the kingdom of Naples, the Papal States - the arrival of Italy as a unified state is a surprisingly recent affair. &quot;We are a new nation,&quot; says Professor Marco Meriggi, and this is true - but the 150th anniversary was celebrated two years ago in quite muted style. So forget what you may know about the Roman empire, and enter a country which doesn't really feel unified yet.\n\nBeginning with the French invasion of 1494, when Charles VIII's mercenaries reached Naples and then spread syphilis to all points north of the Alps, the Invention of Italy tells a story of fragmentation, foreign occupation and nationalist false starts. The second programme looks at how unification finally occurred, and why many believe that the mafia emerged at the same time. the third programme focuses on why Italians were so eager to shed blood in the First World War.\n\nEpisode 2\n\nIn October 1860, on a misty road north of Naples, Giuseppe Garibaldi met the future king of Italy and handed over control of the south. This brief moment in the story of the new Italian state has been often mythologised, but it is not as straightforward as it seems. Violence, civil war, the birth of the mafia - these elements in the story are often overlooked.\n\nBeginning with Napoleon's call to the peoples of Italy in 1796, Misha Glenny picks his way through Italian unification with clarity and care. Rome only became part of this new European country under a century and a half ago - and even then the Pope ordered his followers neither to stand in nor vote in elections for the new state. Small wonder some claim that Italy is not really unified yet.\n\nEpisode 3\n\nIn 1915 Italy entered the Great War on the side of France, Britain and Russia. The aim ? To gain new territory up north to the watershed of the Alps; and also east over the Adriatic into parts of what later became Yugoslavia. The price of these ambitions - nearly three quarters of a million Italians dead in the snow and rock. They died upholding the nationalist belief this new Italian nation - barely fifty years old - needed to spill blood to prove itself, to demonstrate they were not just waiters and ice cream salesmen.\n\nChief among the characters who dragged Italy into war was a poet, Gabrielle d'Annunzio, bald as a coot and a great seducer of Italian women, and Italian minds. In the third and final Invention of Italy, Misha Glenny travels along the frontline, from Trieste via alpine trenches to Lake Garda, where d'Annunzio's Vittoriale degli Italiani attempted to create an Italian fighting tradition by dragging a battleship up the hill and setting it among ornamental gardens.\n\nPresenter -  Misha Glenny\nProducer - Miles Warde\n\n--------------------------------------------------------\nFirst broadcast: BBC Radio 4, 14th, 21st and 28th October 2013\nType: MPEG-1 Audio Layer 3, 128 kbps mp3 - 44 kHz - Joint Stereo\n\nDuration: 3 episodes of approximately 28 minutes each\n\nWebrips from Radio 4, October 2013 with GetiPlayer / converted with iTunes 11.1 and edited with MP3 Trimmer\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:f9a01279133f1a1621250b2b2a5487016dc5a650","amp;dn":"The+Invention+of+Italy+++%28BBC+2013+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9a01279133f1a1621250b2b2a5487016dc5a650","infoHashBuffer":{"type":"Buffer","data":[249,160,18,121,19,63,26,22,33,37,11,43,42,84,135,1,109,197,166,80]},"announce":[],"urlList":[]}}