{"title":"No Light in August and A Sightless Place - R.L. Robinson","uid":11330397,"size":23555535,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9c3c8e0380d9448a572ae290fcf456bd832bf68&amp;dn=No+Light+in+August+and+A+Sightless+Place+-+R.L.+Robinson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":4,"time":1414627328,"description":"No Light in August: Tales from Carcosa &amp; the Borderland\nFrom depression era America, to fantasy worlds similar and yet different from our own. Journey into the realm of the Yellow King. \nThere are many roads to Carcosa, which one will you take? \n\nFeaturing eight short stories and two novelettes inspired by the King in Yellow by Robert W. Chambers, as well as Lovecraftian elements, 'No Light in August' also includes illustrations by Brazilian comic artist Pedro Elefante. \nBonus material: Concept art and development sketches.\n\nA Sightless Place\nIn the midst of a brutal war, three brigands turned sell swords leave a village smouldering behind them and cross a countryside being laid waste. A detour through a nearby forest offers the fastest way back to their army and the prospect of greater plunder. \nThey're on the winning side and have little to fear from those they have wronged. That every tree has a face carved on it means little to these men, but nothing here is as it seems. \n\nGenre: dark fantasy, horror, weird fiction, thriller\n\nHorror Fiction author R.L. Robinson has been kind enough to share his latest collection here on piratebay\n\nPlease read, enjoy and review at the link below","torrent":{"xt":"urn:btih:f9c3c8e0380d9448a572ae290fcf456bd832bf68","amp;dn":"No+Light+in+August+and+A+Sightless+Place+-+R.L.+Robinson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9c3c8e0380d9448a572ae290fcf456bd832bf68","infoHashBuffer":{"type":"Buffer","data":[249,195,200,224,56,13,148,72,165,114,174,41,15,207,69,107,216,50,191,104]},"announce":[],"urlList":[]}}