{"title":"John Scalzi-Lock In","uid":11012962,"size":573138380,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f9eec3b113ca7e12cb84d6fec2aa54de478c47ba&amp;dn=John+Scalzi-Lock+In&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twocows","files":25,"time":1410405561,"description":"A blazingly inventive near-future thriller from the best-selling, Hugo Award-winning John Scalzi.\n\nNot too long from today, a new, highly contagious virus makes its way across the globe. Most who get sick experience nothing worse than flu, fever, and headaches. But for the unlucky one percent - and nearly five million souls in the United States alone - the disease causes &quot;Lock In&quot;: Victims fully awake and aware, but unable to move or respond to stimulus. The disease affects young, old, rich, poor, people of every color and creed. The world changes to meet the challenge.\n\nA quarter of a century later, in a world shaped by what's now known as &quot;Haden's syndrome&quot;, rookie FBI agent Chris Shane is paired with veteran agent Leslie Vann. The two of them are assigned what appears to be a Haden-related murder at the Watergate Hotel, with a suspect who is an &quot;integrator&quot; - someone who can let the locked in borrow their bodies for a time. If the Integrator was carrying a Haden client, then naming the suspect for the murder becomes that much more complicated.\n\nBut &quot;complicated&quot; doesn't begin to describe it. As Shane and Vann began to unravel the threads of the murder, it becomes clear that the real mystery - and the real crime - is bigger than anyone could have imagined.\n\n","torrent":{"xt":"urn:btih:f9eec3b113ca7e12cb84d6fec2aa54de478c47ba","amp;dn":"John+Scalzi-Lock+In","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9eec3b113ca7e12cb84d6fec2aa54de478c47ba","infoHashBuffer":{"type":"Buffer","data":[249,238,195,177,19,202,126,18,203,132,214,254,194,170,84,222,71,140,71,186]},"announce":[],"urlList":[]}}