{"title":"Heaven Sent (DVD.xvid) - anal, Tawny Roberts","uid":4864352,"size":472582144,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:fc02c1f96f0873fa2e0f2da3376cd603e35011f9&amp;dn=Heaven+Sent+%28DVD.xvid%29+-+anal%2C+Tawny+Roberts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"corfitez","files":1,"time":1240396722,"description":"Heaven Sent (DVD.xvid)\n\n\n\n\nall 5 screens (+ DVD-covers): &lt;a href=&quot;\nhttp://ta.gg/2et&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ta.gg/2et&lt;/a&gt;\n\n\n\n\nActresses\n\n    * Calli Cox           [Facial Bald]\n    * Miko Lee            [Bald]\n    * Salina del Ray\n    * Tawny Roberts       [Bald]\n    * Zana                [Anal Facial]\n \n   \nScene Breakdowns\n\n    * Scene 1. Billy Glyde, Miko Lee\n    * Scene 2. Calli Cox, Joey Ray\n    * Scene 3. Chris Cannon, Zana\n    * Scene 4. Rick Patrick, Tawny Roberts\n    * Scene 5. Joel Lawrence, Salina del Ray\n\n\n\n\nStudio:          Legend Video\nReleased:        2001\nFormat:          Xvid\nLanguage:        English\n\nSource: DVDRip\nFormat: AVI\nVideo codec: DivX\nAudio codec: MPEG Audio (mp3)\nVideo: 480x360 (1.33:1), 23.976 fps, XviD MPEG-4 ~796 kbps avg, 0.19 bit/pixel\nAudio: 32 kHz, MPEG Layer 3, 2 ch, ~96.00 kbps avg \n\n\n\nREVIEW:\n\nI rather think that if I wrote the screenplay for a movie like this I'd be yelled at for being a misogynist (not that not writing this sort of screenplay saves me from being called that).\n\nJoey comes home and makes the mistake of asking career woman Miko, &quot;What's for dinner?&quot; He gets the usual lecture about how she's not his servant, cook, etc., and how she doesn't like being treated as a sex object, blah, blah. Sounds like she's on the rag but that doesn't appear to be the case because as soon as Joey leaves to get himself a bite to eat Billy arrives and Miko's over him like a rash. They screw on the stairs and after the tit cum shot Joey returns home, sees her infidelity, and has a heart attack and dies.\n\nNext thing you know Joey's in heaven where master of ceremonies Joel tells him that all males who can deal with women's crap without blowing their brains out go to heaven. Calli (hefty, cantaloupes, marginal face) is there to attend to Joey's every need and without much ado he screws her ending in a facial.\n\nJust to see how good it is to be a woman, Joel converts Joey into Zana (hefty, cantaloupes, marginal face) and sends him/her back to earth for a little while. After checking out his/her new body Zana/Joey masturbates and doesn't stop for a couple of weeks and then he/she has Cannon and a whole lot of uncredited old guys around. Cannon touches her up and screws her including an anal ending in a facial.\n\nBack in heaven Joel shows Joey about another advantage girls have: they can talk/screw their way into any job. We see an example of Tawny (gorgeous, pretty, small tits, lithe body) applying for a job to Richard (credits: just Ricky). She hasn't any qualifications except baby-sitting but wants to be a vice president. She's all over Richard and he's only human so he screws her ending in a chest cum shot. Naturally she gets the job.\n\nSomehow Joey has now been converted into Salena (hefty, cantaloupes, marginal face, tattoos) and Joel tells her that in heaven women are at the disposition of men which is only fair because on Earth women got all the breaks. He unleashes his dick and partakes of his right to screw her ending in a tit cum shot.\n\nCondoms are used for Zana and Salena; I can't tell about Calli. Tawny and Miko went bareback. Dates of production: 9/12/01, 9/13/01, 9/15/01. \n\n\n\n\n.","torrent":{"xt":"urn:btih:fc02c1f96f0873fa2e0f2da3376cd603e35011f9","amp;dn":"Heaven+Sent+%28DVD.xvid%29+-+anal%2C+Tawny+Roberts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc02c1f96f0873fa2e0f2da3376cd603e35011f9","infoHashBuffer":{"type":"Buffer","data":[252,2,193,249,111,8,115,250,46,15,45,163,55,108,214,3,227,80,17,249]},"announce":[],"urlList":[]}}