{"title":"N.T. Wright - The Pastoral Letters for Everyone (pdf)","uid":8265563,"size":1876534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc9279c3b393acb4e9e3c9aeb50097b57b60eed5&amp;dn=N.T.+Wright+-+The+Pastoral+Letters+for+Everyone+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pharmakate","files":-1,"time":1363485914,"description":"N. T. Wright - Paul for Everyone: The Pastoral Letters: 1 and 2 Timoth and Titus (Westminster John Knox Press, 2004). 182 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nFifteenth in the series New Testament for Everyone; click my username to find other volumes in the series. Soon the whole series will be posted on tpb.\n\nWriting in an approachable and anecdotal style, Tom Wright helps us to see the pastoral nature of these letters. Paul is anxious to see that those who profess the faith should allow the gospel to transform the whole of their lives, right down to the deepest part of their personality, and is concerned that every teacher of the faith should know how to build up the community in mutual support, rather than tearing it apart through the wrong sort of teaching and behavior.\n\nTom Wright has undertaken a tremendous task: to provide guides to all the books of the New Testament, and to include in them his own translation of the entire text. Each short passage is followed by a highly readable discussion, with background information, useful explanations and suggestions, and thoughts as to how the text can be relevant to our lives today. A glossary is included at the back of the book. The series is suitable for group study, personal study, or daily devotions.\n\nAbout the Author\n\nTom Wright is is Research Professor of New Testament and Early Christianity at the University of St Andrews. He is a regular broadcaster on radio and television. Tom Wright is the author of over forty books, including the other For Everyone guides to the New Testament, the best-selling Simply Christian, Surprised by Hope, and Virtue Reborn; and the magisterial series entitled Christian Origins and the Question of God.","torrent":{"xt":"urn:btih:fc9279c3b393acb4e9e3c9aeb50097b57b60eed5","amp;dn":"N.T.+Wright+-+The+Pastoral+Letters+for+Everyone+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc9279c3b393acb4e9e3c9aeb50097b57b60eed5","infoHashBuffer":{"type":"Buffer","data":[252,146,121,195,179,147,172,180,233,227,201,174,181,0,151,181,123,96,238,213]},"announce":[],"urlList":[]}}