{"title":"War Wind 1 + 2","uid":8829279,"size":895728315,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fdb94b74acd31d0fa29559e00a6fd267a9bac2f4&amp;dn=War+Wind+1+%2B+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"esharoth","files":-1,"time":1376922684,"description":"Title: War Wind 1 + 2 (includes War Wind and War Wind II: Human Onslaught)\nGenre: RTS / fantasy / top-down\nReleased: 23rd October 1996 (War Wind) / 30th November 1997 (War Wind II)\nDeveloper: DreamForge Intertainment\nPublisher: Strategic Simulations Inc\nDescription:\nThe ancient, alien world of Yavaun teeters on the brink of anarchy as the winds of change threaten to blow civilization asunder! For centuries, four diverse races have tolerated a precarious balance of power. But the time has come for change - a new order is in the wind, and it will be born of blood and fire! War Wind allows you to view this epic struggle through the eyes of four unique races, each with its own strengths, weaknesses and distinctive AI. A real-time strategy masterwork, War Wind features 28 ready-to-play scenarios. A powerful Scenario Editor that allows you to place units and build new battles. And a story of such compelling depth, you won't believe it's just a game!\n\nAfter many years of war, much has changed on the world of Yavaun. Humans, reluctant colonists, are now part of the cultural diversity of this alien world. Factions have formed over the decades since the humans appeared. The Overlord Faction includes the allied forces of Tha'roon and Obblinox. The SUN (Servants Under NagaRom) are represented by the Shama'Li and Eaggra. Of the two human factions, the Marines are comprised mainly of marines and the Descendants are scientists and academics. Each faction has its own agenda, and peaceful coexistence is not the order of the day. Human Onslaught offers a great variety of vehicular, mechanised and special units with intense and exciting maps and a rich array of options, graphics and sounds, along with a combat model that offers a dynamic balance of play. All this plus the addition of the human element make Human Onslaught the real-time strategy game of the year.\n\nHow to play:\n1) Run warwind_1_2_setup.exe and install the games;\n2) Start the games using their main executables or shortcuts.\n\n! Notice\nWindows 7/Vista users: \n- to run War Wind 1 properly, use the following Compatibility settings for the main executable, WW.EXE: Disable visual themes, Disable desktop composition;\n- to run the War Wind 1 Scenario Editor properly, use the following Compatibility settings for the main executable, MAPEDIT.EXE: Run in 256 colors, Run in 640x480 screen resolution, Disable visual themes, Disable desktop composition.\n\nWar Wind 2 should work fine without any Compatibility settings.\n\nThe games were tested and worked fine on Windows 7 x64 with all the latest updates installed.\n\nIf you like the games, BUY them!","torrent":{"xt":"urn:btih:fdb94b74acd31d0fa29559e00a6fd267a9bac2f4","amp;dn":"War+Wind+1+%2B+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdb94b74acd31d0fa29559e00a6fd267a9bac2f4","infoHashBuffer":{"type":"Buffer","data":[253,185,75,116,172,211,29,15,162,149,89,224,10,111,210,103,169,186,194,244]},"announce":[],"urlList":[]}}