{"title":"Coast to Coast Am May 25, 2013 - Bank Corruption","uid":8528227,"size":58274649,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fe90efa2541f81cda8dd9acbe003ec79061e1e82&amp;dn=Coast+to+Coast+Am+May+25%2C+2013+-+Bank+Corruption&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1370081680,"description":"MP3 version wins!\n\nCurtecy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\nDate:\n05-25-13\nHost:\nJohn B. Wells\nGuests:\nKaren  Hudes\nJoining John B. Wells, former World Bank attorney and whistleblower Karen Hudes talked about how she uncovered corruption in the World Bank. According to Hudes, forces within this international institution have placed the entire world at risk of currency wars and a permanent backwardation in gold by cooking the books and lying about it. If the financial malfeasance continues unabated, unemployment will skyrocket as international trade falters and economies around the world meltdown, she predicted, warning that it would &quot;make what happened in the 1930s look like Tiddlywinks.&quot; According to Hudes, ordinary citizens have been kept in the dark about this dire situation by an elite group that owns 40% of the net worth of all publically-traded transnational corporations. Through a series of interconnected directorships they essentially own everything, including the media, she said. \nHudes revealed how she and several other whistleblowers were (illegally) fired from the World Bank for trying to draw attention to and correct improper business practices, such as double billing. They were billing staff salaries in two separate accounts which allowed them to have additional funds to use wherever they liked, she explained. In addition to the cover-up involving the international monetary system, Hudes discovered that the U.S. was threatening ambassadors from other nations and would soon lose its right to appoint the President of the World Bank. Hudes recounted the difficulties she's had trying to bring these issues to light and to resolve the problem in favor of rule of law. The group running the World Bank should behave like human beings, not thugs, she admonished. \nWebsite(s):\n kahudes.net\nRelated Articles\n","torrent":{"xt":"urn:btih:fe90efa2541f81cda8dd9acbe003ec79061e1e82","amp;dn":"Coast+to+Coast+Am+May+25%2C+2013+-+Bank+Corruption","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe90efa2541f81cda8dd9acbe003ec79061e1e82","infoHashBuffer":{"type":"Buffer","data":[254,144,239,162,84,31,129,205,168,221,154,203,224,3,236,121,6,30,30,130]},"announce":[],"urlList":[]}}